{
  "book": "1 Peter",
  "testament": "nt",
  "corpus": "Epistles",
  "theme": "Suffering for Jesus is participation in His victory - live as exiles with hope in the new inheritance",
  "structure": [
    "Ch 1:1-12: New birth into living hope through resurrection",
    "Ch 1:13-2:10: Holy living as chosen people",
    "Ch 2:11-4:11: Living as strangers and exiles in hostile world",
    "Ch 4:12-5:14: Suffering for the name of Christ"
  ],
  "messiahProfile": "Suffering Servant who was rejected but chosen by God; Cornerstone that builders rejected; Lamb whose blood redeems; Shepherd who suffered and was exalted",
  "overview": "Peter wrote this letter decades into his mission in the wider Roman world, from Rome (which he calls 'Babylon'). The letter addresses Christians scattered across Asia Minor who are suffering for their faith. Peter shows that their suffering isn't random but a participation in Christ's own suffering, and that it leads to glory just as His did. They are exiles and strangers in this world, but they have an inheritance that can never perish.",
  "passages": {
    "1peter-1": {
      "reference": "1 Peter 1:3-12",
      "title": "Living Hope Through Resurrection",
      "types": ["expository"],
      "expository": {
        "context": "Peter writing to suffering Christians scattered across Roman provinces; opens with doxology about their hope",
        "tension": "How do we endure suffering and persecution? What hope do we have?",
        "structure": "v.3-5 (New birth into living hope and inheritance), v.6-9 (Suffering proves faith genuine), v.10-12 (Prophets searched for this salvation)",
        "messiahProfile": "The resurrected Christ who gives new birth into living hope; the promised Messiah the prophets searched for",
        "messiahLink": "Jesus' resurrection is the basis of our hope - it guarantees our inheritance is real and waiting. His suffering and glory (v.11) pattern our suffering and coming glory. Peter knows suffering firsthand, saw the risen Jesus, and promises: your suffering has meaning.",
        "notes": "Peter opens with hope, not suffering. The resurrection comes first - it's the foundation. Then suffering makes sense: it proves faith is real (v.7), it's temporary (v.6), and it leads to glory (v.7). Notice: prophets longed to see what we have (v.10-12)."
      }
    },
    "1peter-2": {
      "reference": "1 Peter 2:4-10",
      "title": "Living Stones / Rejected Cornerstone",
      "types": ["expository"],
      "expository": {
        "context": "Peter describing the church's identity as God's new temple made of living stones, built on Christ the cornerstone",
        "tension": "If we're rejected and suffering, are we on the wrong path? How can we be God's people if the world hates us?",
        "structure": "v.4-8 (Christ the rejected stone becomes cornerstone; we are living stones), v.9-10 (We are chosen people, royal priesthood, holy nation)",
        "messiahProfile": "The Living Stone rejected by people but chosen and precious to God - the cornerstone the builders rejected (Psalm 118:22)",
        "messiahLink": "Jesus is the stone the builders rejected (Israel's leaders) who became the cornerstone (Psalm 118:22, Isaiah 28:16). His rejection led to exaltation. Same pattern for us: world rejects us, but we're precious to God. Our suffering means we're on the right foundation.",
        "notes": "Peter weaves together Psalm 118:22 (rejected stone), Isaiah 28:16 (precious cornerstone), and Isaiah 8:14 (stone of stumbling). Christ's rejection wasn't failure - it was God's plan. Same for the church. We're a spiritual house, holy priesthood (fulfilling Exodus 19:6 promise)."
      }
    },
    "1peter-3": {
      "reference": "1 Peter 3:13-22",
      "title": "Suffering for Doing Good",
      "types": ["expository"],
      "expository": {
        "context": "Instructions for how to respond when suffering unjustly; Christ as the ultimate example",
        "tension": "Why suffer for doing good? How do we respond to accusers? What does Christ's suffering have to do with ours?",
        "structure": "v.13-17 (Suffering for righteousness is blessed; be ready to give answer), v.18-22 (Christ suffered for sins - unjust for just; now exalted)",
        "messiahProfile": "The righteous One who suffered for the unrighteous to bring us to God; put to death in flesh but made alive in spirit; now exalted at God's right hand",
        "messiahLink": "Jesus is the pattern: suffered unjustly → died → raised → exalted. Same pattern for us. His suffering wasn't meaningless; it accomplished salvation. Our suffering isn't meaningless; it witnesses to His victory. He's now at God's right hand with angels and authorities subject to Him (v.22).",
        "notes": "Key verse: 'Christ also suffered once for sins, the righteous for the unrighteous, that he might bring us to God' (v.18). This is substitutionary atonement. Then Peter connects to Noah (v.20-21) and baptism - we're saved through water just as Noah was. Christ's exaltation (v.22) assures us suffering leads to glory."
      }
    },
    "1peter-4": {
      "reference": "1 Peter 4:12-19",
      "title": "Suffering as a Christian",
      "types": ["expository", "prophetic"],
      "expository": {
        "context": "Peter addresses the 'fiery trial' believers are facing; reframes suffering as participation in Christ's sufferings",
        "tension": "Why this intense suffering? Are we being punished? Should we be surprised?",
        "structure": "v.12-13 (Don't be surprised - rejoice in sharing Christ's sufferings), v.14-16 (Blessed when insulted for Christ's name), v.17-19 (Judgment begins with God's household)",
        "messiahProfile": "The suffering Christ in whose sufferings we participate; the One whose glory will be revealed",
        "messiahLink": "Jesus suffered, was glorified. We share His sufferings now, will share His glory then (v.13). Being insulted for Christ's name means the Spirit of glory rests on us (v.14). Our suffering is proof we belong to Him.",
        "notes": "Peter calls it 'the fiery trial' (v.12) - intense persecution. But: (1) Don't be surprised, (2) Rejoice - you're sharing Christ's sufferings, (3) You'll rejoice even more when His glory is revealed. Suffering for 'the name' (v.14) = suffering because you're Christian. This is the path."
      },
      "prophetic": {
        "strengthen": "The Spirit of glory and of God rests on you when you're insulted for Christ's name (v.14). Your suffering proves you're His. The same Spirit who raised Jesus indwells you.",
        "encourage": "Judgment is beginning with God's household - if we barely make it through this refining fire, imagine what awaits those who reject the gospel (v.17-18). Stand firm. Your suffering has eternal weight.",
        "console": "You're not alone in this suffering - you're participating in Christ's sufferings (v.13). He walked this path first. And when His glory is revealed, you'll rejoice with joy that's inexpressible and full of glory (v.13, echoing 1:8).",
        "notes": "This passage works prophetically because Peter speaks directly to their present suffering with both warning (judgment starting with us) and promise (glory coming). He strengthens faith (Spirit rests on you), encourages action (don't be ashamed), and consoles (share Christ's sufferings)."
      }
    }
  }
}