{
  "book": "Acts",
  "testament": "nt",
  "corpus": "Acts",
  "theme": "Jesus continues His work through the Spirit - witness from Jerusalem to the ends of the earth",
  "structure": [
    "Ch 1-7: Witness in Jerusalem",
    "Ch 8-12: Witness in Judea & Samaria",
    "Ch 13-28: Witness to the ends of the earth"
  ],
  "messiahProfile": "Jesus exalted as Lord and Messiah; witness empowered by the Spirit through suffering",
  "overview": "Acts is volume 2 of Luke-Acts, showing what Jesus continued to do and teach through the Spirit. The risen King Jesus promises the Spirit will come and immerse disciples in His presence, empowering them to be witnesses. The book traces the Spirit-empowered expansion of the gospel from Jerusalem through Judea and Samaria to the ends of the earth, fulfilling Jesus' commission in Acts 1:8.",
  "passages": {
    "acts-2": {
      "reference": "Acts 2:14-41",
      "title": "Peter at Pentecost",
      "types": ["expository"],
      "expository": {
        "context": "Day of Pentecost; Spirit poured out; tongues of fire; crowd from every nation amazed and confused; Peter addresses them",
        "tension": "What does this Spirit outpouring mean? Who is this Jesus you crucified? What should we do?",
        "structure": "v.14-21 (Joel's prophecy fulfilled), v.22-28 (Jesus' mighty works and resurrection), v.29-36 (David's heir exalted as Lord), v.37-41 (Repent and be baptized)",
        "messiahProfile": "David's descendant whom God raised from death and exalted to His right hand; He pours out the promised Spirit",
        "messiahLink": "Jesus is the one Joel prophesied about - the Spirit's outpouring proves He is Lord and Messiah. He conquered death and now reigns, pouring out the Spirit on all who call on His name (Joel 2:28-32 → Acts 2)",
        "notes": "Classic expository sermon: OT text → Jesus fulfills → Call to response. Peter moves from Joel's prophecy through Jesus' life, death, and resurrection to David's prophecy about the Messiah's exaltation. Result: 3,000 baptized. First major sermon after Pentecost establishes the pattern."
      }
    },
    "acts-7": {
      "reference": "Acts 7:2-53",
      "title": "Stephen's Defense",
      "types": ["narrative"],
      "narrative": {
        "storyPanels": "Panel 1: Abraham called by God; Panel 2: Joseph rejected by brothers, later saves them; Panel 3: Moses rejected first time by Israel; Panel 4: Moses rejected second time despite miracles; Panel 5: Prophets killed by ancestors; Panel 6: You betrayed and murdered the Righteous One",
        "pattern": "Israel repeatedly resists God's chosen messengers - you're doing it again with Jesus. God sends → people reject → God persists → pattern continues",
        "messiahLink": "Jesus is the Righteous One the prophets foretold - you betrayed and murdered Him just as your ancestors killed the prophets (v.52). He is the greater Moses, the ultimate Prophet rejected by His own people.",
        "notes": "Stephen doesn't defend himself - he prosecutes them. Uses narrative as indictment: Israel's entire history is resistance to God's messengers, culminating in Jesus' murder. Notice he never answers their charges directly; instead he tells a story that puts them on trial. Gets him killed but plants seeds (Saul/Paul is there watching, Acts 7:58)."
      }
    },
    "acts-13": {
      "reference": "Acts 13:16-41",
      "title": "Paul in Pisidian Antioch",
      "types": ["expository"],
      "expository": {
        "context": "Paul's first recorded sermon in Acts; speaking in synagogue to Jews and God-fearing Gentiles; traces Israel's history",
        "tension": "How does Israel's long story culminate? What is God doing now through Jesus?",
        "structure": "v.16-25 (Israel's history to John the Baptist), v.26-37 (Jesus' death and resurrection fulfills Scripture), v.38-41 (Forgiveness offered through Jesus)",
        "messiahProfile": "Descendant of David whom God raised from death, never to decay - the Holy One who fulfills Psalm 16",
        "messiahLink": "Jesus is the Savior from David's line God promised Israel (v.23). His resurrection proves He is the Son God spoke of in Psalm 2:7. Unlike David who died and decayed, Jesus was raised and never saw decay (Psalm 16:10 fulfilled).",
        "notes": "Paul's pattern similar to Peter's Acts 2 sermon: OT history → Jesus as fulfillment → resurrection as proof → call to believe. Notice Paul emphasizes Jesus as David's descendant and uses Psalms 2, 16, and Isaiah 55 to prove resurrection was prophesied."
      }
    },
    "acts-17": {
      "reference": "Acts 17:22-31",
      "title": "Paul at the Areopagus (Athens)",
      "types": ["expository"],
      "expository": {
        "context": "Paul in Athens, cultural center of Greece; surrounded by idols; invited to speak at Areopagus (Mars Hill) to philosophers",
        "tension": "Who is the 'unknown god' you worship? How does the Creator relate to His creation?",
        "structure": "v.22-23 (Unknown God identified), v.24-29 (God as Creator who doesn't need temples), v.30-31 (Judgment coming through resurrected Man)",
        "messiahProfile": "The Man God appointed to judge the world, whom He raised from the dead",
        "messiahLink": "Jesus is the unknown God now revealed - Creator who became human, died, and rose to prove He will judge the world. Paul adapts his message for Greeks: less OT quotes, more creation theology, but still centers on resurrection as proof of Jesus' identity and coming judgment.",
        "notes": "Paul's approach differs from synagogue sermons - he quotes Greek poets instead of OT, starts with creation not Exodus, but still lands on resurrection. Some mocked, others believed. Shows gospel flexibility without compromising core message."
      }
    },
    "acts-22": {
      "reference": "Acts 22:1-21",
      "title": "Paul's Testimony (Jerusalem)",
      "types": ["testimony"],
      "testimony": {
        "before": "Zealous Pharisee, trained under Gamaliel in Jerusalem, persecuted followers of the Way to the point of death, imprisoned men and women",
        "encounter": "On road to Damascus, blinding light from heaven, Jesus speaks ('I am Jesus of Nazareth whom you are persecuting'), led blind into Damascus, Ananias sent by God restores sight, baptized, called to bear Jesus' name to Gentiles",
        "now": "Commissioned apostle to Gentiles despite resistance; obeys Jesus' call even when it costs everything; witness to what he has seen and heard",
        "messiahLink": "Jesus is the risen Lord who appeared to Paul - Paul's transformation from persecutor to apostle proves the resurrection. Paul's entire life is evidence that Jesus lives and reigns.",
        "notes": "Same story as Acts 9 but Paul tells it himself with Jewish audience in mind - emphasizes his Jewish credentials, Ananias as 'devout observer of the law,' praying in the temple. Crowd listens until he mentions Gentiles (v.21-22), then riots. Testimony's power: 'I was there, this happened to me, Jesus is alive.'"
      }
    },
    "acts-26": {
      "reference": "Acts 26:2-23",
      "title": "Paul's Testimony (Before Agrippa)",
      "types": ["testimony"],
      "testimony": {
        "before": "Strictest sect of Pharisees, hope in Israel's promises, persecuted Christians believing he was serving God",
        "encounter": "Damascus road - light brighter than sun, Jesus speaks in Aramaic, 'I am Jesus whom you are persecuting,' commissioned on the spot to open eyes of Gentiles and turn them from darkness to light",
        "now": "Could not be disobedient to heavenly vision; proclaims what prophets and Moses said would happen - Messiah would suffer, rise from dead, proclaim light to Jews and Gentiles",
        "messiahLink": "Jesus is the suffering Messiah the prophets foretold - His resurrection and Paul's commission prove it. Paul's defense: 'I'm only saying what Moses and the prophets said would happen' (v.22).",
        "notes": "Third telling of conversion (Acts 9, 22, 26) - each adapts to audience. Here Paul emphasizes to King Agrippa that his message fulfills OT prophecy, he's not teaching anything new. Agrippa almost persuaded (v.28). Shows testimony can be told different ways for different contexts without changing core truth."
      }
    }
  }
}