{
  "book": "Acts",
  "testament": "nt",
  "corpus": "Acts",
  "theme": "Jesus continues His work through the Spirit - witness from Jerusalem to the ends of the earth",
  "messiahProfile": "Jesus exalted as Lord and Messiah; witness empowered by the Spirit through suffering",
  "author": "Luke (traveling companion of Paul)",
  "relationship": "Volume 2 of Luke-Acts unified work",
  "overview": {
    "title": "The Acts of Jesus and the Spirit",
    "subtitle": "What Jesus continued to do and teach through His followers",
    "bigIdea": "The risen King Jesus, through the Holy Spirit, empowers His followers to bear witness to His kingdom from Jerusalem to the ends of the earth, forming a multiethnic family that lives under His reign through suffering and opposition.",
    "purpose": "To show how Jesus continues His work after the resurrection - not through physical presence but through the Spirit, expanding His kingdom through witnesses who proclaim Him as Lord and Messiah to all nations.",
    "keyVerse": "Acts 1:8 - 'But you will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth.'",
    "historicalContext": "Written by Luke (Paul's traveling companion) as the second volume of a unified Luke-Acts work. Covers approximately 30 years (AD 30-62) from Jesus' ascension to Paul's imprisonment in Rome. Written to show how the originally Jewish Jesus movement became a multiethnic, international movement fulfilling Old Testament promises."
  },
  "structure": [
    "Ch 1-7: Witness in Jerusalem",
    "Ch 8-12: Witness in Judea & Samaria",
    "Ch 13-28: Witness to the ends of the earth"
  ],
  "keyThemes": [
    {
      "theme": "Spirit Empowerment",
      "description": "The Holy Spirit replaces Jesus' physical presence, empowering witnesses, guiding decisions, breaking ethnic barriers, and forming the new temple in God's people rather than a building.",
      "keyPassages": [
        "Acts 1:8",
        "Acts 2:1-4",
        "Acts 4:31",
        "Acts 8:29",
        "Acts 10:44-48",
        "Acts 13:2",
        "Acts 15:28",
        "Acts 16:6-10"
      ]
    },
    {
      "theme": "Witness Through Suffering",
      "description": "Following Jesus means bearing witness to His death and resurrection, often through persecution and opposition. Suffering doesn't stop the mission - it advances it.",
      "keyPassages": [
        "Acts 4:1-22",
        "Acts 5:17-42",
        "Acts 7:54-60",
        "Acts 8:1-4",
        "Acts 14:19-22",
        "Acts 20:22-24",
        "Acts 21:10-14"
      ]
    },
    {
      "theme": "Gospel Expansion (Jerusalem → Ends of Earth)",
      "description": "The message moves outward in concentric circles from Jerusalem to Judea/Samaria to the nations, fulfilling Jesus' commission and OT prophecies about light to the Gentiles.",
      "keyPassages": [
        "Acts 1:8",
        "Acts 8:1",
        "Acts 8:4-8",
        "Acts 11:19-21",
        "Acts 13:46-47",
        "Acts 28:28"
      ]
    },
    {
      "theme": "Jewish-Gentile Unity in Messiah",
      "description": "Central tension: Can non-Jews follow the Jewish Messiah without becoming Jewish? Resolution: Jesus creates one multiethnic family under His reign, fulfilling promise to Abraham that all nations would be blessed.",
      "keyPassages": [
        "Acts 10-11",
        "Acts 15",
        "Acts 21:17-26",
        "Acts 26:22-23"
      ]
    },
    {
      "theme": "Church Growth & Persecution Cycle",
      "description": "Repeated pattern: gospel proclaimed → people respond → opposition arises → persecution scatters believers → gospel spreads further. What enemies meant for harm, God uses for good.",
      "keyPassages": [
        "Acts 2:41,47",
        "Acts 4:4",
        "Acts 5:14",
        "Acts 6:7",
        "Acts 8:1-4",
        "Acts 11:21",
        "Acts 13:48-50"
      ]
    },
    {
      "theme": "Fulfillment of Scripture",
      "description": "Every sermon grounds Jesus in OT prophecy - He is the promised Messiah, the suffering servant, the exalted Lord. The story of Acts IS the story of Israel reaching its climax.",
      "keyPassages": [
        "Acts 2:16-21",
        "Acts 2:25-36",
        "Acts 3:18-26",
        "Acts 7",
        "Acts 13:32-37",
        "Acts 26:22-23"
      ]
    }
  ],
  "characterArcs": {
    "peter": {
      "name": "Peter (Simon Peter)",
      "role": "Leading apostle in Jerusalem, bridge to Gentile mission",
      "arc": "From fearful denier (Luke 22:54-62) → bold Pentecost preacher (Acts 2) → healer and witness (Acts 3-5) → reluctant accepter of Gentiles (Acts 10-11) → defender of grace at Jerusalem Council (Acts 15). Peter's transformation shows the Spirit's power to turn cowards into bold witnesses.",
      "keyMoments": [
        "Acts 2:14-41 - Pentecost sermon, 3000 baptized",
        "Acts 3:1-10 - Heals lame beggar",
        "Acts 4:8-12 - Bold testimony before Sanhedrin",
        "Acts 5:29 - 'We must obey God rather than human beings'",
        "Acts 10 - Vision breaks down ethnic barriers, baptizes Cornelius",
        "Acts 15:7-11 - Defends salvation by grace at Jerusalem Council"
      ],
      "growth": "Learns that God's kingdom is bigger than Jewish boundaries, that the Spirit tears down ethnic walls, and that boldness comes from resurrection witness, not personal courage."
    },
    "paul": {
      "name": "Paul (Saul of Tarsus)",
      "role": "Apostle to the Gentiles, church planter, theologian",
      "arc": "From violent persecutor of the church (Acts 8:1-3) → blinded and called by Jesus (Acts 9) → trained and sent by Antioch church (Acts 13) → tireless missionary planting churches across Roman Empire (Acts 13-20) → prisoner-witness on trial before rulers (Acts 21-28). Paul's story proves Jesus transforms enemies into witnesses.",
      "keyMoments": [
        "Acts 7:58 - Watches Stephen's execution, approves",
        "Acts 8:3 - Ravages the church, imprisons believers",
        "Acts 9:1-19 - Damascus Road encounter with Jesus",
        "Acts 13:1-3 - Commissioned and sent by Antioch church",
        "Acts 16:9-10 - Macedonian vision, enters Europe",
        "Acts 20:22-24 - Knows suffering awaits, presses on",
        "Acts 21-28 - Arrested, gives testimony multiple times, reaches Rome"
      ],
      "growth": "From self-righteous Pharisee zealous for law → apostle of grace zealous for Christ. Learns that God's power is made perfect in weakness, that suffering advances the gospel, and that Jesus creates one family across all ethnic boundaries."
    },
    "stephen": {
      "name": "Stephen",
      "role": "First Christian martyr, bridge between Jerusalem phase and expansion",
      "arc": "Chosen as one of seven to serve tables (Acts 6:1-6) → Spirit-filled preacher and miracle worker (Acts 6:8-10) → arrested on false charges (Acts 6:11-15) → delivers prophetic defense/prosecution before Sanhedrin (Acts 7:1-53) → stoned to death while seeing Jesus standing at God's right hand (Acts 7:54-60). Stephen's death scatters church and plants seeds in Paul's heart.",
      "keyMoments": [
        "Acts 6:3-5 - Chosen for ministry, 'full of Spirit and wisdom'",
        "Acts 6:8 - Did great wonders and signs",
        "Acts 7:2-53 - Epic speech: Israel's history of resisting God's messengers",
        "Acts 7:55-56 - Sees Jesus standing at God's right hand",
        "Acts 7:60 - Dies praying 'Lord, do not hold this sin against them'"
      ],
      "significance": "First Christian martyr, his death sparks persecution that spreads gospel beyond Jerusalem. His speech becomes template for understanding Israel's story climaxing in Jesus. Saul/Paul watches him die - plants seeds that will bear fruit on Damascus Road."
    },
    "barnabas": {
      "name": "Barnabas (Son of Encouragement)",
      "role": "Bridge builder, Paul's mentor, champion of grace",
      "arc": "Early believer who sells field to support community (Acts 4:36-37) → vouches for converted Saul when others fear him (Acts 9:26-27) → sent to investigate Antioch, sees God's grace, rejoices (Acts 11:22-24) → recruits Paul for ministry (Acts 11:25-26) → partners with Paul on first missionary journey (Acts 13-14) → parts ways with Paul over John Mark (Acts 15:36-40). Barnabas exemplifies encouragement and seeing God's grace in unexpected people.",
      "keyMoments": [
        "Acts 4:36-37 - Sells field, gives money to apostles",
        "Acts 9:27 - Takes risk on Saul, introduces him to apostles",
        "Acts 11:23-24 - Sees grace in Antioch, encourages all to remain faithful",
        "Acts 13:2 - Set apart with Paul for missionary work",
        "Acts 15:39 - Parts from Paul over giving John Mark second chance"
      ],
      "significance": "Champion of second chances and seeing God at work in unlikely people. Without Barnabas, Paul might never have been accepted by the church."
    },
    "james": {
      "name": "James (Jesus' brother)",
      "role": "Leader of Jerusalem church, moderator at Jerusalem Council",
      "arc": "Skeptic during Jesus' ministry (John 7:5) → post-resurrection believer (1 Cor 15:7) → leader of Jerusalem church (Acts 12:17, 15:13, 21:18) → wise moderator at Jerusalem Council finding compromise between law-keeping and grace (Acts 15:13-21). James bridges Jewish roots with Gentile inclusion.",
      "keyMoments": [
        "Acts 12:17 - Peter reports to James after prison escape",
        "Acts 15:13-21 - Moderates Jerusalem Council, proposes compromise",
        "Acts 21:18-25 - Meets with Paul, advises on showing respect for Jewish customs"
      ],
      "significance": "Represents Jewish-Christian wing of early church. His leadership at Jerusalem Council prevents split between Jewish and Gentile believers. Shows you can honor heritage while embracing new work of God."
    },
    "philip": {
      "name": "Philip the Evangelist",
      "role": "Cross-cultural evangelist, Spirit-led pioneer",
      "arc": "Chosen as one of seven to serve tables (Acts 6:5) → after Stephen's death, preaches in Samaria with great response (Acts 8:4-8) → led by Spirit to Ethiopian eunuch, explains Isaiah 53, baptizes him (Acts 8:26-40) → later found in Caesarea with four prophesying daughters (Acts 21:8-9). Philip shows the Spirit leads ordinary believers into extraordinary mission.",
      "keyMoments": [
        "Acts 8:5-8 - Preaches Christ in Samaria, multitudes believe, city filled with joy",
        "Acts 8:26-40 - Angel directs him to Ethiopian, explains Scripture, baptizes him",
        "Acts 21:8-9 - Hosts Paul, has four prophesying daughters"
      ],
      "significance": "Pioneer to outsiders (Samaritans, Ethiopian). Shows gospel breaks down barriers long before Peter's Cornelius moment. Model of Spirit-led spontaneous evangelism."
    }
  },
  "sermonPatterns": {
    "expository": {
      "description": "OT text → Jesus as fulfillment → response",
      "structure": "Start with Scripture the audience knows → Show how Jesus fulfills it → Prove with resurrection → Call to faith/repentance",
      "examples": [
        "acts-2-pentecost",
        "acts-3-healing",
        "acts-10-cornelius",
        "acts-13-antioch",
        "acts-17-athens"
      ],
      "keyFeatures": [
        "Grounds message in Scripture",
        "Moves from text to Christ to application",
        "Uses logic and argumentation",
        "Appeals to shared sacred texts",
        "Resurrection as proof"
      ]
    },
    "narrative": {
      "description": "Story pattern → Jesus as climax → response",
      "structure": "Tell the story → Expose the pattern → Show Jesus as the answer to the pattern → Call to different way",
      "examples": [
        "acts-7-stephen",
        "acts-13-antioch",
        "acts-9-conversion"
      ],
      "keyFeatures": [
        "Uses story rather than propositions",
        "Exposes recurring patterns",
        "Shows Jesus as pattern-breaker or pattern-fulfiller",
        "Prosecutes or convicts through narrative",
        "Calls to break from pattern"
      ]
    },
    "prophetic": {
      "description": "Current situation → warning/encouragement → faithful response",
      "structure": "Assess where community is → Strengthen/encourage/console based on God's truth → Call to perseverance",
      "examples": [
        "acts-20-ephesian-elders"
      ],
      "keyFeatures": [
        "Builds up believers",
        "Warns of dangers ahead",
        "Roots encouragement in God's word and work",
        "Models faithfulness",
        "Prepares for suffering"
      ]
    },
    "testimony": {
      "description": "Before → encounter with Jesus → now",
      "structure": "Who I was without Christ → How Jesus met me → Who I am now in Christ",
      "examples": [
        "acts-22-jerusalem-testimony",
        "acts-26-agrippa-testimony",
        "acts-9-conversion"
      ],
      "keyFeatures": [
        "Personal witness",
        "Shows Jesus' transforming power",
        "Proves resurrection (He's alive, appeared to me)",
        "Adapts to different audiences",
        "Highlights Jesus as primary actor"
      ]
    }
  },
  "keyObservations": [
    "Every sermon connects Scripture to Jesus to a specific response - this is the 'spine' of biblical preaching",
    "Context shapes emphasis, but the spine remains consistent across all types - whether Peter to Jews or Paul to Greeks",
    "Peter and Paul use same basic pattern with different audiences - shows pattern transcends personality",
    "Testimony sermons show personal transformation as proof of resurrection - Paul tells his story three times, each adapted to audience",
    "Prophetic/pastoral sermons still center on Jesus' work and example - it's not about the leader's vision but Jesus' mission",
    "Resurrection is the hinge point in every message - proves Jesus' identity, validates His claims, demonstrates God's power",
    "Response varies by audience and type: repent (to unbelievers), believe (to seekers), guard the flock (to leaders), remember the poor (to church)",
    "Persecution doesn't stop preaching - it provides new platforms. Paul's trials become testimony opportunities before rulers (Acts 9:15 fulfilled)",
    "Gospel advances through unlikely means: persecution scatters believers who then spread message; Paul arrested becomes Paul testifying to governors and kings; shipwreck becomes platform for witness on Malta",
    "Book ends without ending - Paul still in Rome preaching 'with all boldness and without hindrance' (Acts 28:31). The mission continues."
  ],
  "applicationForSpeechBuilder": {
    "howToUseThisData": "This JSON provides comprehensive orientation for building speeches from Acts. When user selects a passage, show them: (1) The broader narrative context (what's happening in Acts at this point), (2) Key themes active in this section, (3) Character development if relevant, (4) The specific sermon/event details for building their own message. The goal is to help speakers understand WHERE they are in Acts' story before they start preparing.",
    "categoryExplanations": {
      "event": "Sermons embedded in narrative events (like Pentecost, Stephen's martyrdom). Both the speech AND the event matter for preaching.",
      "sermon-only": "Pure speeches without significant narrative action (rare in Acts - most sermons happen during events).",
      "narrative-only": "Major events with no embedded sermon (like Paul's conversion in ch 9, though Paul later retells it as testimony)",
      "narrative-cycle": "Repeated patterns of gospel proclamation → response → opposition → growth (Acts 3-5, for example)"
    }
  },
  "passages": {
    "acts-2-pentecost": {
      "reference": "Acts 2:14-41",
      "title": "Peter at Pentecost",
      "speaker": "Peter",
      "audience": "Jews from every nation gathered in Jerusalem",
      "category": "event",
      "narrativeContext": "Day of Pentecost; Spirit poured out on 120 disciples with sound of violent wind and tongues of fire; crowd from every nation amazed and confused by hearing their own languages; Peter stands with the Eleven to address them",
      "sermonSection": "2:14-41",
      "types": [
        "expository"
      ],
      "expository": {
        "context": "Day of Pentecost; Spirit poured out; tongues of fire; crowd from every nation amazed and confused; Peter addresses them",
        "tension": "What does this Spirit outpouring mean? Who is this Jesus you crucified? What should we do?",
        "structure": "v.14-21 (Joel's prophecy fulfilled), v.22-28 (Jesus' mighty works and resurrection), v.29-36 (David's heir exalted as Lord), v.37-41 (Repent and be baptized)",
        "messiahProfile": "David's descendant whom God raised from death and exalted to His right hand; He pours out the promised Spirit; both Lord and Messiah (Acts 2:36)",
        "messiahLink": "Jesus is the one Joel prophesied about - the Spirit's outpouring proves He is Lord and Messiah. He conquered death and now reigns, pouring out the Spirit on all who call on His name (Joel 2:28-32 → Acts 2). David prophesied the Messiah wouldn't see decay (Psalm 16:10) - that's Jesus. He's exalted to God's right hand (Psalm 110:1), the ultimate fulfillment of David's line.",
        "notes": "Classic expository sermon: OT text → Jesus fulfills → Call to response. Peter moves from Joel's prophecy through Jesus' life, death, and resurrection to David's prophecy about the Messiah's exaltation. Result: 3,000 baptized. First major sermon after Pentecost establishes the pattern. Notice Peter prosecutes them: 'YOU crucified Him' (v.23, 36) but offers grace: 'Repent and be baptized' (v.38). The multilingual miracle reverses Babel - at Babel languages divided, at Pentecost Spirit unites through language miracle."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)"
    },
    "acts-3-healing": {
      "reference": "Acts 3:12-26",
      "title": "Peter After Healing",
      "speaker": "Peter",
      "audience": "Crowd at Solomon's Colonnade (temple)",
      "category": "event",
      "narrativeContext": "Peter and John heal lame beggar at temple gate (Acts 3:1-10); crowd gathers in Solomon's Colonnade amazed; Peter seizes teaching moment",
      "sermonSection": "3:12-26",
      "types": [
        "expository"
      ],
      "expository": {
        "context": "Peter and John heal lame beggar at temple gate; crowd gathers in Solomon's Colonnade amazed; Peter seizes teaching moment",
        "tension": "Why are you amazed at us? How was this man healed? What does this healing mean?",
        "structure": "v.12-16 (Jesus healed him, not our power), v.17-21 (You killed the Author of Life, but God raised Him), v.22-26 (Moses and prophets foretold this; turn from wickedness)",
        "messiahProfile": "The Holy and Righteous One, the Author of Life whom God raised from the dead; God's Servant whom He glorified; the Prophet like Moses (Deut 18:15-19)",
        "messiahLink": "Jesus is the Prophet like Moses (Deuteronomy 18:15-19) whom God raised up. He is the Holy One whom you rejected in favor of a murderer (Barabbas). His name - His authority and power - healed this man (v.16). He is the fulfillment of what all the prophets foretold - the Servant God glorified, the Righteous One, the Author of Life. You killed the source of life itself, but God raised Him. Now turn to Him.",
        "notes": "Second major sermon - shows healing as sign pointing to Jesus. Peter doesn't celebrate the miracle but prosecutes the crowd: 'You killed the Author of Life!' (v.15) Then pivots to grace: 'You acted in ignorance...repent and turn to God' (v.17-19). Pattern: text (Deut 18) → Jesus as fulfillment → response (repent). Notice how physical healing becomes platform for spiritual message - the healing gets people's attention, the sermon points to Jesus. Peter calls Jesus 'Holy and Righteous One' (titles emphasizing His innocence contrasted with their guilt in choosing Barabbas, a murderer)."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)"
    },
    "acts-7-stephen": {
      "reference": "Acts 7:2-53",
      "title": "Stephen's Defense",
      "speaker": "Stephen",
      "audience": "Sanhedrin (Jewish high court)",
      "category": "event",
      "narrativeContext": "Stephen arrested on false charges of blasphemy against Moses, Law, and Temple (Acts 6:11-14); brought before Sanhedrin; his face like an angel (Acts 6:15); high priest asks 'Are these charges true?'; Stephen responds with epic speech",
      "sermonSection": "7:2-53",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Abraham called by God in Mesopotamia before settling in promised land; Panel 2: Joseph rejected by brothers but later saves them - God was with him; Panel 3: Moses rejected first time by Israel ('Who made you ruler?'); Panel 4: Moses returns with miracles but Israel rejected him again, made golden calf; Panel 5: David found favor, Solomon built temple, but Most High doesn't dwell in houses made by human hands; Panel 6: Like your ancestors who killed the prophets, you betrayed and murdered the Righteous One",
        "pattern": "Israel repeatedly resists God's chosen messengers - you're doing it again with Jesus. God sends → people reject → God persists → pattern continues. The entire history of Israel is resistance to God's rescue attempts, culminating in murdering the Messiah.",
        "messiahLink": "Jesus is the Righteous One the prophets foretold - you betrayed and murdered Him just as your ancestors killed the prophets (v.52). He is the greater Moses, the ultimate Prophet rejected by His own people. Like Joseph (rejected then became savior), like Moses (rejected then became deliverer), Jesus was rejected but God vindicated Him. Stephen's speech prosecutes them: you're the climax of Israel's long history of resisting God.",
        "notes": "Stephen doesn't defend himself - he prosecutes them. Uses narrative as indictment: Israel's entire history is resistance to God's messengers, culminating in Jesus' murder. Notice he never answers their charges directly; instead he tells a story that puts them on trial. Gets him killed but plants seeds (Saul/Paul is there watching, Acts 7:58). The speech is brilliant inversion: They accuse Stephen of speaking against Moses and Temple; Stephen shows THEY are the ones who consistently rejected Moses and misunderstood the Temple (God doesn't dwell in buildings). Stephen sees Jesus 'standing' (not sitting as usual) at God's right hand (Acts 7:55-56) - suggests Jesus rises as advocate/witness for His persecuted martyr."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)"
    },
    "acts-9-conversion": {
      "reference": "Acts 9:1-31",
      "title": "Saul's Conversion (Narrative)",
      "category": "narrative-only",
      "narrativeContext": "Saul breathing threats and murder against disciples, travels to Damascus with letters from high priest authorizing him to arrest Christians and bring them bound to Jerusalem",
      "types": [
        "narrative",
        "testimony"
      ],
      "narrative": {
        "context": "Saul breathing threats, headed to Damascus with arrest warrants from high priest, about 3 days journey",
        "tension": "Church's greatest persecutor encounters the risen Jesus - what will he become? Can this man who ravaged the church (Acts 8:3) really be trusted?",
        "storyPanels": "Panel 1: Saul on mission to destroy church, breathing threats; Panel 2: Light from heaven flashes, Saul falls to ground, hears voice 'Why do you persecute ME?'; Panel 3: Led blind into Damascus, doesn't eat or drink 3 days; Panel 4: Ananias (reluctant) sent by Jesus, lays hands on Saul, scales fall from eyes; Panel 5: Baptized, receives Spirit, preaches Jesus is Son of God; Panel 6: Jews plot to kill him, disciples help him escape in basket; Barnabas vouches for him in Jerusalem",
        "pattern": "Jesus transforms His enemies into witnesses; the gospel advances through the least likely people. Pattern: persecutor → encounter → preacher. What was meant to destroy the church (Saul's persecution) becomes its greatest missionary.",
        "messiahLink": "Jesus is the risen Lord who appears to Saul - proves resurrection, commissions apostle to Gentiles, shows mercy to chief of sinners. Jesus identifies with His persecuted church: 'Saul, why do you persecute ME?' - attacking Christians is attacking Christ. The one Saul thought was a dead false messiah is alive, exalted, appearing from heaven.",
        "notes": "This is THE conversion story in Acts. Luke gives full narrative (ch 9), Paul retells it twice (22, 26). Pattern: persecutor → encounter → preacher. Use as narrative (tell the story) or testimony framework (structure for conversion stories). Note Jesus' identification with His people - Saul persecutes Christians, Jesus says 'Why persecute ME?' The church is Jesus' body. Ananias's reluctance (v.13-14) shows how scary Saul's reputation was - this is the man who ravaged the church (8:3). Barnabas's vouching (v.27) was crucial - without it, Paul might never have been accepted. Three days blind without food/water (v.9) suggests this was profound spiritual crisis/transformation, not just physical healing."
      },
      "testimony": {
        "before": "Zealous Pharisee, breathing threats and murder, headed to Damascus to imprison Christians, worked to destroy the church",
        "encounter": "Blinding light, fell to ground, voice: 'I am Jesus whom you are persecuting' - led blind into city, Ananias sent by God to restore sight, scales fell from eyes, baptized, received Spirit, called to bear Jesus' name to Gentiles and kings",
        "now": "Preaching Jesus is the Son of God in synagogues, confounding Jews, facing persecution himself, devoted apostle to Gentiles",
        "messiahLink": "Same as narrative above - Jesus is the risen Lord whose appearance proves the resurrection and transforms His enemies",
        "notes": "If preaching as testimony pattern: before/encounter/now structure shows Jesus' power to transform. This is ultimate conversion story: from church's greatest enemy to church's greatest missionary. Use to show no one is beyond Jesus' reach, and that true conversion involves 180-degree turn, not minor adjustment."
      },
      "primaryType": "narrative",
      "group": "Judea & Samaria (Acts 8–12)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "acts-10-cornelius": {
      "reference": "Acts 10:34-43",
      "title": "Peter to Cornelius",
      "speaker": "Peter",
      "audience": "Cornelius (Roman centurion) and his household - first Gentile converts",
      "category": "event",
      "narrativeContext": "Peter has vision of unclean animals three times (Acts 10:9-16), God tells him not to call unclean what God has made clean; Cornelius (God-fearing Gentile) has vision telling him to send for Peter; both visions orchestrated by God to bring gospel across ethnic barrier",
      "sermonSection": "10:34-43",
      "types": [
        "expository"
      ],
      "expository": {
        "context": "Peter has vision of unclean animals, God tells him not to call anything unclean; summoned to Cornelius's house (breaking Jewish custom); realizes God shows no favoritism",
        "tension": "Can Gentiles receive the gospel without becoming Jews first? Does God accept them? Can Jews fellowship with Gentiles?",
        "structure": "v.34-36 (God shows no favoritism, peace through Jesus Christ who is Lord of all), v.37-41 (Jesus' ministry, death, resurrection - we are witnesses who ate and drank with Him), v.42-43 (He commands us to preach, judges living and dead, everyone who believes receives forgiveness through His name)",
        "messiahProfile": "Lord of all (not just Jews), anointed by God with the Holy Spirit and power; went about doing good and healing; killed on a tree but raised on third day; appointed judge of living and dead; the One all the prophets testified about",
        "messiahLink": "Jesus is Lord of all - not just Jews but Gentiles too. He is the One all the prophets testified about - everyone who believes in Him receives forgiveness of sins through His name (v.43). His resurrection and the disciples' witness (they ate and drank with Him after resurrection, v.41) prove God's acceptance extends to all peoples. The Spirit falling on Cornelius's household confirms it - God makes no distinction, He accepts people from every nation who fear Him and do what is right (v.34-35).",
        "notes": "Breakthrough sermon - gospel crosses ethnic barrier. Peter's message is streamlined compared to earlier sermons: Jesus' ministry → death → resurrection → forgiveness for all who believe. No lengthy OT argument needed because audience is Gentile. Spirit interrupts sermon and falls on them (v.44) before Peter finishes! God's 'Amen' to including Gentiles - Peter didn't even get to the altar call. Notice Peter reports this to Jerusalem church (ch 11) to defend baptizing Gentiles - shows how controversial this was. This moment validates Paul's entire Gentile mission and sets up Jerusalem Council (ch 15). Peter's opening: 'I now realize how true it is that God does not show favoritism' (v.34) - even Peter had to learn this."
      },
      "primaryType": "narrative",
      "group": "Judea & Samaria (Acts 8–12)"
    },
    "acts-13-antioch": {
      "reference": "Acts 13:16-41",
      "title": "Paul in Pisidian Antioch",
      "speaker": "Paul",
      "audience": "Jews and God-fearing Gentiles in synagogue",
      "category": "event",
      "narrativeContext": "Paul's first recorded sermon in Acts; first missionary journey with Barnabas; speaking in synagogue on Sabbath to Jews and God-fearing Gentiles; traces Israel's history from Egypt to Jesus",
      "sermonSection": "13:16-41",
      "types": [
        "expository",
        "narrative"
      ],
      "expository": {
        "context": "Paul's first recorded sermon in Acts; speaking in synagogue to Jews and God-fearing Gentiles; traces Israel's history",
        "tension": "How does Israel's long story culminate? What is God doing now through Jesus? Why did Israel's leaders reject Him?",
        "structure": "v.16-25 (Israel's history from Egypt through judges to David to John the Baptist preparing for Savior), v.26-37 (Jesus' death and resurrection fulfills Scripture - David's decay vs Jesus' no decay), v.38-41 (Forgiveness offered through Jesus, justified by faith not law, warning from Habakkuk to believe)",
        "messiahProfile": "Savior from David's line whom God promised Israel (v.23); the Son whom God raised from death (Psalm 2:7); the Holy One who never saw decay (Psalm 16:10 fulfilled); descendant of David whom God raised, unlike David who died and decayed",
        "messiahLink": "Jesus is the Savior from David's line God promised Israel (v.23). His resurrection proves He is the Son God spoke of in Psalm 2:7 ('You are my Son; today I have become your Father' - fulfilled in resurrection). Unlike David who died and decayed, Jesus was raised and never saw decay (Psalm 16:10 fulfilled, v.34-37). He is the fulfillment of God's promise to David for eternal kingdom. Through Him everyone who believes is set free from sins and justified - something the law of Moses could not do (v.38-39).",
        "notes": "Paul's pattern similar to Peter's Acts 2 sermon: OT history → Jesus as fulfillment → resurrection as proof → call to believe. Notice Paul emphasizes Jesus as David's descendant and uses three OT texts: Psalm 2:7 (You are my Son - resurrection), Isaiah 55:3 (holy and sure blessings promised to David), Psalm 16:10 (will not see decay). This becomes Paul's 'mission template' - he'll repeat this approach in synagogues throughout his journeys. Pattern: Start with shared story (Israel's history), show Jesus as climax, prove with Scripture, offer forgiveness."
      },
      "narrative": {
        "storyPanels": "Panel 1: God chose our ancestors in Egypt, led them out with mighty power; Panel 2: Endured them 40 years in wilderness; Panel 3: Gave them the land, inheritance for 450 years; Panel 4: Gave them judges, then Samuel, then Saul as king; Panel 5: Raised up David as king - 'man after my own heart'; Panel 6: From David's descendants came Jesus the Savior as God promised; John prepared the way, now Jesus has come",
        "pattern": "Israel's history flows toward Jesus - every stage points forward to the promised Savior from David's line. God has been working toward this climax all along.",
        "messiahLink": "The entire narrative arc from Egypt to David was preparation for Jesus. God's faithfulness to Israel culminates in the Savior He promised - Jesus from David's line who fulfills all the prophecies. The story makes sense only when it leads to Jesus."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)"
    },
    "acts-17-athens": {
      "reference": "Acts 17:22-31",
      "title": "Paul at the Areopagus (Athens)",
      "speaker": "Paul",
      "audience": "Greek philosophers (Epicureans and Stoics) at Mars Hill",
      "category": "event",
      "narrativeContext": "Paul in Athens (cultural/intellectual center of Greece), greatly distressed by city full of idols; debates in synagogue and marketplace; invited to speak at Areopagus (Mars Hill) to explain his 'strange ideas' about Jesus and resurrection",
      "sermonSection": "17:22-31",
      "types": [
        "expository"
      ],
      "expository": {
        "context": "Paul in Athens, cultural center of Greece; surrounded by idols; invited to speak at Areopagus (Mars Hill) to philosophers (Epicureans, Stoics) who want to hear about 'foreign gods' he's proclaiming",
        "tension": "Who is the 'unknown god' you worship? How does the Creator relate to His creation? What about these 'strange gods' (Jesus and resurrection) Paul is preaching?",
        "structure": "v.22-23 (Unknown God altar - I will proclaim Him to you), v.24-29 (God as Creator doesn't need temples, gives life to all, made all nations from one man, wants people to seek Him, we are His offspring), v.30-31 (Past ignorance overlooked, now commands repentance because judgment is coming through Man He raised from dead)",
        "messiahProfile": "The Man God appointed to judge the world, whom He raised from the dead as proof; the Creator who doesn't live in temples made by human hands; the God who made all nations and wants all to seek Him",
        "messiahLink": "Jesus is the unknown God now revealed - the Creator who became human, died, and rose to prove He will judge the world. Paul adapts his message for Greeks: less OT quotes, more creation theology, starts with what they can observe (their own altar), quotes their own poets ('we are his offspring'), but still centers on resurrection as proof of Jesus' identity and coming judgment. The resurrection is God's assurance that He will judge the world through this Man (v.31).",
        "notes": "Paul's approach differs from synagogue sermons - he quotes Greek poets (Epimenides and Aratus) instead of OT, starts with creation not Abraham, uses natural theology, but still lands on resurrection. Some mocked (Greeks thought bodily resurrection absurd), others believed (Dionysius, Damaris, others). Shows gospel flexibility without compromising core message - Paul contextualizes approach but doesn't change content. Notice he uses their own altar 'TO AN UNKNOWN GOD' (v.23) as entry point - meets them where they are. Fascinating that some mocked at mention of resurrection (v.32) - this was stumbling block for Greek mind (they believed soul immortal but despised physical body). Paul's sermon interrupted - doesn't finish his full argument."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)"
    },
    "acts-20-ephesian-elders": {
      "reference": "Acts 20:18-35",
      "title": "Paul to Ephesian Elders",
      "speaker": "Paul",
      "audience": "Elders of the Ephesian church",
      "category": "event",
      "narrativeContext": "Paul's farewell address to Ephesian elders at Miletus during third missionary journey; he's heading to Jerusalem knowing bonds and afflictions await; last time he'll see them; charges them to guard the flock",
      "sermonSection": "20:18-35",
      "types": [
        "prophetic",
        "pastoral"
      ],
      "prophetic": {
        "context": "Paul's farewell address to Ephesian elders at Miletus; he's heading to Jerusalem knowing bonds and afflictions await; last time he'll see them; emotional goodbye",
        "tension": "What will happen to the church after Paul leaves? How should leaders shepherd God's flock? How do they continue without their founding apostle?",
        "structure": "v.18-21 (Paul's example of ministry: served with humility, tears, trials, taught publicly and house to house, called Jews and Greeks to repentance), v.22-27 (Going to Jerusalem bound in Spirit; suffering awaits; have declared whole counsel of God; innocent of blood of all), v.28-31 (Guard yourselves and flock; Holy Spirit made you overseers; savage wolves will come after I leave; be alert), v.32-35 (Commend you to God and word of grace; worked with own hands to support self and weak; remember Jesus' words: 'More blessed to give than receive')",
        "messiahProfile": "The Lord whose blood purchased the church (v.28); His words guide us ('It is more blessed to give than to receive' - v.35); Gospel of God's grace (v.24, 32); Repentance toward God and faith in Lord Jesus (v.21)",
        "messiahLink": "Jesus is the Chief Shepherd who purchased the church with His own blood (v.28 - note: 'blood of God' phrase suggests Jesus' deity). Paul's ministry imitates Jesus' example of serving rather than being served - worked with own hands (v.34), didn't covet (v.33), served humbly (v.19). The gospel of God's grace (v.24) centers on Jesus' sacrificial death and resurrection. Paul's farewell centers not on himself but on the Lord and His word.",
        "notes": "ONLY sermon in Acts addressed to believers, not unbelievers. Paul's farewell: I've been faithful (v.26-27) → you be faithful (v.28) → savage wolves will come (v.29) → guard the flock (v.28) → remember Jesus' example of generosity (v.35). Notice Paul models leadership he's calling them to: worked with own hands (v.34) so as not to burden anyone, didn't covet (v.33), served humbly (v.19), suffered willingly (v.23-24). Emotional ending - they wept, embraced, kissed him (v.37) 'grieving especially over his statement that they would not see his face again' (v.38). This is pastoral theology in action: guarding the flock from false teaching, tending the church Jesus bought with His blood, remembering Jesus' words. Paul mentions Jesus' saying 'More blessed to give than receive' (v.35) - not recorded in Gospels but preserved in oral tradition."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)"
    },
    "acts-22-jerusalem-testimony": {
      "reference": "Acts 22:1-21",
      "title": "Paul's Testimony (Jerusalem)",
      "speaker": "Paul",
      "audience": "Hostile Jewish crowd in Jerusalem",
      "category": "event",
      "narrativeContext": "Paul arrested in Jerusalem after riot sparked by false accusation he brought Gentile into temple; Roman commander about to flog him when Paul reveals Roman citizenship; allowed to address crowd from steps; speaks in Aramaic to get their attention",
      "sermonSection": "22:1-21",
      "types": [
        "testimony"
      ],
      "testimony": {
        "before": "Zealous Pharisee, born in Tarsus but raised in Jerusalem, trained under Gamaliel in strict observance of law, zealous for God just like crowd, persecuted followers of the Way to the death, arrested and imprisoned men and women, had letters from high priest to Damascus to arrest believers",
        "encounter": "On road to Damascus about noon, brilliant light from heaven flashed around me, fell to ground, heard voice: 'Saul, Saul, why do you persecute me?' Asked 'Who are you Lord?' Voice: 'I am Jesus of Nazareth whom you are persecuting' - companions saw light but didn't understand voice - 'What shall I do Lord?' Told to go to Damascus, would be told what to do - led blind into city - Ananias (devout observer of law, highly respected by Jews) sent by God, restored sight, said: 'God of our ancestors has chosen you to know his will, see the Righteous One, hear words from his mouth, be his witness to all people' - baptized, calling on his name - Later in Jerusalem praying in temple, fell into trance, Jesus spoke: 'Leave Jerusalem, they will not accept testimony about me' - Paul protested: they know I imprisoned and beat believers - Jesus: 'Go, I will send you far away to the Gentiles'",
        "now": "Commissioned apostle to Gentiles despite Jewish resistance; obeys Jesus' call even when it costs everything; witness to what he has seen and heard; prisoner but still testifying",
        "messiahLink": "Jesus is the risen Lord who appeared to Paul - Paul's transformation from persecutor to apostle proves the resurrection. Jesus identifies with His persecuted church ('Why persecute ME?'). Paul's entire life is evidence that Jesus lives and reigns. The Righteous One whom God chose Paul to see and hear - the One worth losing everything for.",
        "notes": "Same story as Acts 9 but Paul tells it himself with Jewish audience in mind - emphasizes: (1) Jewish credentials (born in Tarsus, raised in Jerusalem, trained under Gamaliel - vv.3), (2) Ananias as 'devout observer of the law' highly respected by Jews (v.12 - different emphasis than Acts 9), (3) Praying in the temple when commissioned (v.17 - shows he's still observant), (4) His reluctance to leave Jerusalem (vv.19-20). Speaks in Aramaic (v.2) to get their attention. Crowd listens peacefully until he mentions 'Gentiles' (v.21-22), then riots - shows deep-seated ethnic prejudice. Testimony's power: 'I was there, this happened to me, Jesus is alive.' Paul adapts same story to different audiences while keeping core truth: Jesus appeared, I was changed, now I testify."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)"
    },
    "acts-26-agrippa-testimony": {
      "reference": "Acts 26:2-23",
      "title": "Paul's Testimony (Before Agrippa)",
      "speaker": "Paul",
      "audience": "King Agrippa, Festus (Roman governor), and assembled dignitaries",
      "category": "event",
      "narrativeContext": "Paul held in Caesarea 2+ years; King Agrippa visits Festus, wants to hear Paul's case; next day with great pomp Agrippa and Bernice enter audience room with high-ranking military officers and prominent men of city; Paul brought in, Festus explains case, Paul given opportunity to speak for himself",
      "sermonSection": "26:2-23",
      "types": [
        "testimony"
      ],
      "testimony": {
        "before": "Lived as Pharisee according to strictest sect of Jewish religion, standing trial because of hope in promise God made to ancestors (resurrection of the dead), prayed this hope would be fulfilled, once believed I ought to do everything to oppose name of Jesus of Nazareth - imprisoned many saints, cast vote against them, tried to force them to blaspheme, persecuted them to foreign cities",
        "encounter": "On road to Damascus at midday, light from heaven brighter than sun blazing around me and companions, all fell to ground, voice speaking in Aramaic: 'Saul, Saul, why do you persecute me? It is hard for you to kick against the goads' - 'Who are you Lord?' - 'I am Jesus whom you are persecuting. Now get up, I have appeared to you to appoint you as servant and witness of what you have seen and will see of me - I am sending you to Gentiles to open their eyes, turn them from darkness to light, from power of Satan to God, so they may receive forgiveness of sins and place among those sanctified by faith in me'",
        "now": "Could not be disobedient to heavenly vision; first to Damascus, then Jerusalem, then all Judea, then to Gentiles - preached they should repent, turn to God, demonstrate repentance by deeds; for this reason Jews seized me in temple and tried to kill me; with God's help stand here testifying to small and great; saying nothing beyond what prophets and Moses said would happen: that Messiah would suffer, be first to rise from dead, proclaim light to his own people and to Gentiles",
        "messiahLink": "Jesus is the suffering Messiah the prophets foretold - His resurrection and Paul's commission prove it. Jesus appeared to Paul as ultimate proof of resurrection. Paul's defense: 'I'm only saying what Moses and the prophets said would happen' (v.22) - Messiah would suffer, rise from dead, be light to nations. The resurrection is God's proof, Paul is its witness.",
        "notes": "Third telling of conversion (Acts 9, 22, 26) - each adapts to audience. Here Paul emphasizes to King Agrippa: (1) Everything in OT prophecy (v.6 - 'hope in promise to ancestors', v.22 - 'what prophets and Moses said'), (2) He's not teaching anything new or strange (v.22), (3) Agrippa knows these things and believes the prophets (v.27). This is apologetic defense to Roman authority. Festus interrupts: 'You're out of your mind! Your great learning is driving you insane!' (v.24) - Paul's response: 'I'm not insane; what I'm saying is true and reasonable' (v.25). Agrippa almost persuaded: 'Do you think in such a short time you can persuade me to be a Christian?' (v.28) - tantalizing 'what if?'. Paul's response beautiful: 'Short time or long, I pray that not only you but all hearing me today may become what I am, except for these chains' (v.29). Shows testimony can be told different ways for different contexts without changing core truth."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)"
    },
    "arc-acts1": {
      "title": "Jesus Ascends, Disciples Wait & Choose Matthias",
      "reference": "Acts 1:1-26",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Jesus' final instructions → Ascension (taken up in cloud) → Angels: He will return same way → Disciples return to Jerusalem → 120 gathered in upper room → Peter proposes replacing Judas → Cast lots, Matthias chosen → All wait for promised Spirit",
        "tension": "Jesus is gone. What now? How will His kingdom advance without Him physically present?",
        "resolution": "Jesus will be present through the Spirit. His physical absence is preparation for spiritual presence that will fill all believers, not just be localized in one body.",
        "messiahLink": "Risen King enthroned as Son of Man (Daniel 7), Lord over all, who will return to judge and restore",
        "notes": "Sets up entire book: Jesus ascends → Spirit comes → Witness expands. The mission statement (Acts 1:8) is the table of contents for Acts."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts2": {
      "title": "Pentecost & Birth of the Church",
      "reference": "Acts 2:1-47",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Sound like violent wind fills house → Tongues of fire rest on each person → All filled with Spirit, speak in other languages → Crowd amazed, confused → Some mock → Peter stands, explains Joel's prophecy fulfilled → Jesus crucified, raised, exalted → 3000 cut to heart, baptized → Community shares everything, meets daily in temple and homes → Signs and wonders → Favor with people, Lord adds to their number",
        "tension": "What does this Spirit outpouring mean? Who is this Jesus? What should we do?",
        "resolution": "Jesus is the exalted Messiah who poured out the Spirit as promised. Repent and be baptized - join this new covenant family being formed.",
        "messiahLink": "Exalted Lord at God's right hand who pours out the Spirit; David's descendant who conquered death",
        "notes": "Pentecost reverses Babel (Gen 11): At Babel, languages divided nations; at Pentecost, Spirit unites nations through language miracle. OT images of God's presence (wind, fire) now dwell IN believers. Peter's sermon becomes template: OT text → Jesus fulfills → resurrection proof → call to response."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)",
      "expository": {
        "context": "Follow the narrative movement; keep author/audience in view and let the scene set the claims.",
        "bigIdea": "In the face of what does this spirit outpouring mean? who is this jesus? what should we do?, God brings jesus is the exalted messiah who poured out the spirit as promised. repent and be baptized - join this new covenant family being formed..",
        "structure": "Sound like violent wind fills house → Tongues of fire rest on each person → All filled with Spirit, speak in other languages → Crowd amazed, confused → Some mock → Peter stands, explains Joel's prophecy fulfilled → Jesus crucified, raised, exalted → 3000 cut to heart, baptized → Community shares everything, meets daily in temple and homes → Signs and wonders → Favor with people, Lord adds to their number",
        "messiahProfile": "Exalted Lord at God's right hand who pours out the Spirit; David's descendant who conquered death"
      },
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts3-5": {
      "title": "Signs, Growth & Persecution in Jerusalem",
      "reference": "Acts 3:1-5:42",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Peter heals lame beggar at temple → Preaches to amazed crowd → Arrested with John → Trial before Sanhedrin → Threatened, released → Church prays, Spirit shakes place → Generous sharing, Barnabas example → Ananias & Sapphira lie, die → More signs and wonders → Apostles arrested again → Angel frees them → Preach in temple again → Re-arrested, beaten → Rejoice in suffering for Jesus' name → Continue teaching daily",
        "tension": "Gospel message brings both joy (thousands believe) and conflict (leaders threatened). Can the movement survive opposition from temple establishment?",
        "resolution": "Nothing can stop what God has started. Persecution only emboldens apostles. Growth continues despite (because of?) suffering.",
        "messiahLink": "Name of Jesus heals (Acts 3:16); no other name for salvation (Acts 4:12); Holy and Righteous One rejected by leaders (Acts 3:14-15)",
        "notes": "Establishes pattern for rest of Acts: Gospel proclaimed → Signs follow → Opposition arises → Apostles bold → Church grows. Notice apostles don't pray for persecution to stop but for boldness to keep witnessing (Acts 4:29-30)."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts6-7": {
      "title": "Seven Chosen, Stephen's Martyrdom",
      "reference": "Acts 6:1-7:60",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Complaint about food distribution → Apostles appoint seven Spirit-filled men → Stephen does great wonders → Synagogue members oppose, can't refute his wisdom → False witnesses accuse him of blasphemy → Brought before Sanhedrin → Stephen's face like angel → Delivers epic speech: Abraham → Joseph → Moses → Tabernacle → Temple → Prophets killed → You betrayed Messiah → Sees Jesus standing at God's right hand → Dragged out, stoned → Saul watches approvingly → Stephen dies praying for his killers",
        "tension": "Growing church faces internal conflict AND external persecution. Will this destroy the unity and mission?",
        "resolution": "Internal conflict resolved through wise leadership. External persecution births first martyr whose death scatters church (advancing mission) and plants seeds in Paul's heart.",
        "messiahLink": "Righteous One whom Israel betrayed and murdered (Acts 7:52); Stephen sees Him standing (not sitting) at God's right hand - advocate for His persecuted people",
        "notes": "Stephen doesn't defend himself - he prosecutes them. His speech is indictment, not defense: Israel's entire history is resisting God's messengers, culminating in Jesus' murder. The 'standing' Jesus (vs usual 'sitting') suggests Jesus rises as advocate/witness for Stephen. Saul watches (Acts 7:58) - this plants seeds for Damascus Road."
      },
      "primaryType": "narrative",
      "group": "Jerusalem (Acts 1–7)",
      "expository": {
        "context": "Follow the narrative movement; keep author/audience in view and let the scene set the claims.",
        "bigIdea": "In the face of growing church faces internal conflict and external persecution. will this destroy the unity and mission?, God brings internal conflict resolved through wise leadership. external persecution births first martyr whose death scatters church (advancing mission) and plants seeds in paul's heart..",
        "structure": "Complaint about food distribution → Apostles appoint seven Spirit-filled men → Stephen does great wonders → Synagogue members oppose, can't refute his wisdom → False witnesses accuse him of blasphemy → Brought before Sanhedrin → Stephen's face like angel → Delivers epic speech: Abraham → Joseph → Moses → Tabernacle → Temple → Prophets killed → You betrayed Messiah → Sees Jesus standing at God's right hand → Dragged out, stoned → Saul watches approvingly → Stephen dies praying for his killers",
        "messiahProfile": "Righteous One whom Israel betrayed and murdered (Acts 7:52); Stephen sees Him standing (not sitting) at God's right hand - advocate for His persecuted people"
      },
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts8": {
      "title": "Persecution Scatters, Philip in Samaria & Ethiopia",
      "reference": "Acts 8:1-40",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Great persecution, all except apostles scattered → Saul ravages church → Philip preaches in Samaria → Signs and great joy → Simon the Sorcerer believes, baptized → Peter and John sent, lay hands, Spirit given → Simon wants to buy this power, rebuked → Angel directs Philip to desert road → Ethiopian eunuch reading Isaiah 53 → Philip explains Jesus → Ethiopian believes, baptized → Spirit snatches Philip away → Ethiopian goes home rejoicing → Philip preaches in coastal towns to Caesarea",
        "tension": "Persecution seems to be winning - church scattered, Saul destroying it. Can the gospel survive this assault?",
        "resolution": "Persecution becomes the means of spreading gospel beyond Jerusalem. What enemies meant for evil, God uses for good. Gospel reaches ancient enemies (Samaritans) and distant outsiders (Ethiopian).",
        "messiahLink": "The suffering servant of Isaiah 53 who was led like sheep to slaughter - this is Jesus who died and rose",
        "notes": "Turning point: persecution scatters church OUT of Jerusalem as Jesus predicted (Acts 1:8). Philip pioneers gospel to Samaritans (ancient enemies) and Ethiopian (distant Gentile). Ethiopian's question 'Who is the prophet talking about?' gets answered: Isaiah 53 = Jesus. This is missions template: Scripture → Jesus → Baptism."
      },
      "primaryType": "narrative",
      "group": "Judea & Samaria (Acts 8–12)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts10-11": {
      "title": "Peter & Cornelius - Gospel to Gentiles",
      "reference": "Acts 10:1-11:18",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Cornelius's vision: angel tells him to send for Peter → Peter's vision: sheet with unclean animals, voice says 'Kill and eat' → Peter refuses, voice says 'Don't call unclean what God has made clean' → Happens 3x → Cornelius's messengers arrive → Spirit tells Peter to go with them → Peter goes to Cornelius's house (breaking Jewish custom) → Cornelius explains his vision → Peter preaches Jesus → Spirit interrupts sermon, falls on all who hear → Gentiles speak in tongues → Peter: 'Can anyone withhold water for baptizing these people?' → Baptizes them → Returns to Jerusalem, criticized by circumcision party → Peter explains visions and Spirit's work → Critics silenced, praise God: 'God has granted Gentiles repentance that leads to life'",
        "tension": "Can Gentiles be saved without becoming Jewish? Can Jews fellowship with Gentiles? Is the gospel really for ALL nations or just Israel plus proselytes?",
        "resolution": "God shows no favoritism. Spirit falls on Gentiles before baptism, proving God accepts them. Peter defends this to Jerusalem church. The gospel is for ALL peoples.",
        "messiahLink": "Lord of all (Acts 10:36); Judge of living and dead (Acts 10:42); Everyone who believes receives forgiveness (Acts 10:43)",
        "notes": "Watershed moment in Acts: Gospel officially crosses ethnic barrier to Gentiles. Both Peter AND Cornelius receive visions - God orchestrates from both sides. Spirit falls BEFORE baptism - undeniable proof God accepts Gentiles. Peter's defense in Jerusalem (ch 11) shows early church struggled with this. This sets up Jerusalem Council (ch 15) and validates Paul's Gentile mission."
      },
      "primaryType": "narrative",
      "group": "Judea & Samaria (Acts 8–12)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts12": {
      "title": "James Killed, Peter Freed, Herod's Death",
      "reference": "Acts 12:1-25",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Herod kills James (brother of John) with sword → Sees this pleases Jews → Arrests Peter during Passover → Peter bound between two soldiers in prison → Church prays earnestly → Night before trial, angel appears, chains fall off → Angel leads Peter past guards, iron gate opens by itself → Peter realizes it's not a vision → Goes to Mary's house where church is praying → Knocks, servant girl Rhoda hears his voice → She's so excited she forgets to open door → Church doesn't believe her → Peter keeps knocking → They open door, astonished → Peter tells them what happened, says 'Tell James' → Leaves → Morning: guards can't find Peter, Herod has them executed → Herod goes to Caesarea → Makes speech, people shout 'Voice of a god!' → Angel strikes Herod, he's eaten by worms, dies → Word of God continues to spread",
        "tension": "Persecution intensifies. One apostle (James) dead, another (Peter) imprisoned. Will Herod wipe out the leadership?",
        "resolution": "God's sovereignty: James dies, Peter miraculously freed. Both outcomes under God's control. Herod - who claimed divine authority - struck down by God. Gospel continues spreading.",
        "messiahLink": "Jesus' sovereignty: James' death and Peter's rescue both part of Jesus' plan. The church belongs to Him - even persecution can't destroy it.",
        "notes": "Sobering reality: Sometimes God delivers (Peter), sometimes He doesn't (James). Both are faithful - outcomes differ. This prepares readers for Paul's eventual execution. Church's prayer: not 'get Peter out' but general intercession - they're shocked when he shows up! Herod's pride leads to his death: claims to be god, real God strikes him down. Pattern continues: opposition arises, gospel advances."
      },
      "primaryType": "narrative",
      "group": "Judea & Samaria (Acts 8–12)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts13-14": {
      "title": "First Missionary Journey (Antioch → Cyprus → Galatia)",
      "reference": "Acts 13:1-14:28",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Antioch church worshiping → Spirit: 'Set apart Barnabas and Saul' → Fasted, prayed, laid hands, sent them → Cyprus: Proconsul believes after Elymas the sorcerer struck blind → Perga: John Mark leaves → Pisidian Antioch: Paul preaches in synagogue, many believe, Jews jealous, turn to Gentiles → Iconium: Signs and wonders, city divided → Lystra: Heal lame man, crowd tries to worship them as gods, Paul preaches true God → Jews from Antioch stone Paul, leave him for dead → Paul gets up, continues → Derbe: Many disciples → Return through same cities, appoint elders → Sail back to Antioch → Report: 'God opened door of faith to Gentiles'",
        "tension": "Will Paul's message be received? How will Jews respond to Gospel going to Gentiles? Can this small team plant lasting churches?",
        "resolution": "Pattern emerges: Preach in synagogue → Some believe, some oppose → Turn to Gentiles → Plant church → Opposition arises → Move on. Churches established across region despite opposition.",
        "messiahLink": "Savior from David's line (Acts 13:23); Risen one who never saw decay (Acts 13:34-37); Light to Gentiles (Acts 13:47)",
        "notes": "First missionary journey establishes Paul's pattern: (1) Enter city, (2) Go to synagogue first, (3) Some believe, (4) Opposition arises, (5) Turn to Gentiles, (6) Plant church with appointed elders, (7) Move on. Paul and Barnabas almost worshiped as gods in Lystra (Zeus and Hermes) - shows how pagan world viewed miracles. Paul stoned and left for dead but gets up and continues - foreshadows his later 'dying daily' for gospel."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "expository": {
        "context": "Follow the narrative movement; keep author/audience in view and let the scene set the claims.",
        "bigIdea": "In the face of will paul's message be received? how will jews respond to gospel going to gentiles? can this small team plant lasting churches?, God brings pattern emerges: preach in synagogue → some believe, some oppose → turn to gentiles → plant church → opposition arises → move on. churches established across region despite opposition..",
        "structure": "Antioch church worshiping → Spirit: 'Set apart Barnabas and Saul' → Fasted, prayed, laid hands, sent them → Cyprus: Proconsul believes after Elymas the sorcerer struck blind → Perga: John Mark leaves → Pisidian Antioch: Paul preaches in synagogue, many believe, Jews jealous, turn to Gentiles → Iconium: Signs and wonders, city divided → Lystra: Heal lame man, crowd tries to worship them as gods, Paul preaches true God → Jews from Antioch stone Paul, leave him for dead → Paul gets up, continues → Derbe: Many disciples → Return through same cities, appoint elders → Sail back to Antioch → Report: 'God opened door of faith to Gentiles'",
        "messiahProfile": "Savior from David's line (Acts 13:23); Risen one who never saw decay (Acts 13:34-37); Light to Gentiles (Acts 13:47)"
      },
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts15": {
      "title": "Jerusalem Council - Gentiles Accepted by Grace",
      "reference": "Acts 15:1-35",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Certain men from Judea: 'Gentiles must be circumcised' → Sharp dispute → Paul and Barnabas appointed to go to Jerusalem → Jerusalem: Much debate → Peter stands: 'God gave Spirit to Gentiles, made no distinction, purified hearts by faith' → Barnabas and Paul report signs God did among Gentiles → James speaks: Prophets predicted this, Gentiles seeking God → James' proposal: Don't burden Gentiles with law, only ask them to abstain from things polluted by idols, sexual immorality, strangled meat, blood → Decision made, letter written → Judas and Silas sent with Paul and Barnabas → Antioch church encouraged",
        "tension": "Can Gentiles be saved by faith alone or must they become Jewish first? Will Jewish and Gentile believers split into separate movements?",
        "resolution": "Apostles and elders decide: Salvation is by grace through faith for both Jews and Gentiles. Law-keeping not required for salvation. Minimal requirements for fellowship. Unity preserved.",
        "messiahLink": "Lord Jesus Christ whose grace saves both Jews and Gentiles (Acts 15:11); Prophesied Davidic king who rebuilds God's dwelling so all nations can seek the Lord (Acts 15:16-17)",
        "notes": "MOST IMPORTANT theological decision in early church. Without this, Christianity might have remained Jewish sect. Peter's argument: God gave Spirit to Gentiles (Acts 10) - settled issue then. James uses Amos 9:11-12: rebuilt house of David includes seeking Gentiles. Decision: No circumcision required, but avoid things offensive to Jewish believers (idol food, blood, sexual immorality). This is not legalism but concession for unity."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts16-18": {
      "title": "Second Missionary Journey (Galatia → Macedonia → Greece)",
      "reference": "Acts 16:1-18:22",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Paul and Silas revisit churches → Timothy joins → Spirit forbids preaching in Asia, redirects to Macedonia → Philippi: Lydia believes, baptized → Slave girl with spirit follows them → Paul casts out spirit → Owners riot, Paul/Silas beaten, imprisoned → Midnight: Praying and singing → Earthquake opens doors → Jailer about to kill himself → Paul stops him → 'What must I do to be saved?' → 'Believe in Lord Jesus' → Jailer and household baptized → Thessalonica: Some believe, Jews form mob → Berea: Examine Scriptures, many believe → Athens: Paul at Areopagus, preaches to philosophers → Corinth: Meets Aquila and Priscilla, stays 18 months → Returns to Antioch",
        "tension": "Gospel entering new territory (Europe). Will Greek/Roman world receive Jewish Messiah? How does Paul adapt his message?",
        "resolution": "Gospel successfully planted in Macedonia and Greece. Churches established in Philippi, Thessalonica, Berea, Corinth. Some believe, some mock, pattern continues.",
        "messiahLink": "Lord Jesus who saves (Acts 16:31); Man appointed to judge world, proven by resurrection (Acts 17:31); Christ/Messiah whom Jews opposed (Acts 18:5)",
        "notes": "Second journey brings gospel to Europe - massive expansion. Macedonian vision (Acts 16:9) changes history. Philippi: first European convert (Lydia), first European church. Athens: Paul adapts message for Greek philosophers - quotes their poets, starts with creation not Abraham, but still lands on resurrection. Corinth: Paul stays 18 months (longest recorded stay) - shows planting churches takes time and investment."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "expository": {
        "context": "Follow the narrative movement; keep author/audience in view and let the scene set the claims.",
        "bigIdea": "In the face of gospel entering new territory (europe). will greek/roman world receive jewish messiah? how does paul adapt his message?, God brings gospel successfully planted in macedonia and greece. churches established in philippi, thessalonica, berea, corinth. some believe, some mock, pattern continues..",
        "structure": "Paul and Silas revisit churches → Timothy joins → Spirit forbids preaching in Asia, redirects to Macedonia → Philippi: Lydia believes, baptized → Slave girl with spirit follows them → Paul casts out spirit → Owners riot, Paul/Silas beaten, imprisoned → Midnight: Praying and singing → Earthquake opens doors → Jailer about to kill himself → Paul stops him → 'What must I do to be saved?' → 'Believe in Lord Jesus' → Jailer and household baptized → Thessalonica: Some believe, Jews form mob → Berea: Examine Scriptures, many believe → Athens: Paul at Areopagus, preaches to philosophers → Corinth: Meets Aquila and Priscilla, stays 18 months → Returns to Antioch",
        "messiahProfile": "Lord Jesus who saves (Acts 16:31); Man appointed to judge world, proven by resurrection (Acts 17:31); Christ/Messiah whom Jews opposed (Acts 18:5)"
      },
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts18:23-20:38": {
      "title": "Third Missionary Journey (Galatia → Ephesus → Greece → Farewell)",
      "reference": "Acts 18:23-20:38",
      "types": [
        "narrative",
        "prophetic"
      ],
      "narrative": {
        "storyPanels": "Paul revisits Galatian churches → Ephesus: Finds disciples who only knew John's baptism → Baptizes them in Jesus' name, Spirit comes → Preaches in synagogue 3 months → Opposition → Moves to lecture hall, 2 years → All Asia hears the word → Extraordinary miracles → Seven sons of Sceva try to use Jesus' name → Evil spirit overpowers them → Many burn magic books worth 50,000 pieces of silver → Silversmiths riot (threatened by loss of Artemis business) → Leaves for Macedonia and Greece → Plot against him → Sails from Philippi → Troas: Eutychus falls from window, dies, Paul raises him → Miletus: Sends for Ephesian elders → Farewell speech: Guarded the flock, declared whole counsel of God → Warns of wolves coming → Emotional goodbye",
        "tension": "Paul's most fruitful ministry yet (Ephesus) but knows suffering awaits in Jerusalem. Will churches survive without him?",
        "resolution": "Churches established and elders appointed. Paul entrusts them to God's grace. His ministry bears lasting fruit even as he moves toward suffering.",
        "messiahLink": "Lord Jesus whose blood purchased the church (Acts 20:28); His words guide us: 'More blessed to give than receive' (Acts 20:35)",
        "notes": "Ephesus becomes Paul's longest ministry (2+ years). Sees major breakthrough: All Asia hears gospel, magic books burned (spiritual warfare victory), silversmiths riot (economic threat to pagan system). Farewell to Ephesian elders (Acts 20:18-35) is only sermon to believers in Acts - shows Paul's heart for churches he planted. He knows suffering awaits but presses on. Warns of false teachers (wolves) coming after he leaves."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "prophetic": {
        "strengthen": "Name the calling and reinforce faithfulness amid pressure.",
        "encourage": "Churches established and elders appointed. Paul entrusts them to God's grace. His ministry bears lasting fruit even as he moves toward suffering.",
        "console": "Speak comfort for the cost of obedience and the grief of hard goodbyes.",
        "grounding": "Paul's most fruitful ministry yet (Ephesus) but knows suffering awaits in Jerusalem. Will churches survive without him?",
        "messiahLink": "Lord Jesus whose blood purchased the church (Acts 20:28); His words guide us: 'More blessed to give than receive' (Acts 20:35)",
        "notes": "Scaffolded for charge-style proclamation (Acts 20 farewell/charge).",
        "suggestedPanels": "Paul revisits Galatian churches → Ephesus: Finds disciples who only knew John's baptism → Baptizes them in Jesus' name, Spirit comes → Preaches in synagogue 3 months → Opposition → Moves to lecture hall, 2 years → All Asia hears the word → Extraordinary miracles → Seven sons of Sceva try to use Jesus' name → Evil spirit overpowers them → Many burn magic books worth 50,000 pieces of silver → Silversmiths riot (threatened by loss of Artemis business) → Leaves for Macedonia and Greece → Plot against him → Sails from Philippi → Troas: Eutychus falls from window, dies, Paul raises him → Miletus: Sends for Ephesian elders → Farewell speech: Guarded the flock, declared whole counsel of God → Warns of wolves coming → Emotional goodbye"
      },
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts21-23": {
      "title": "Paul Arrested in Jerusalem, Testifies Before Sanhedrin",
      "reference": "Acts 21:1-23:35",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Voyage to Jerusalem → Multiple warnings: Don't go → Paul: 'Ready to die for Jesus' → Jerusalem: Meets James, reports on Gentiles → James suggests purification vow to show respect for law → Paul agrees → Jews from Asia see him, accuse him of defiling temple → Riot, try to kill Paul → Roman commander rescues him → Paul asks to speak → Paul's testimony: Jewish credentials, persecuted church, Damascus road, call to Gentiles → Crowd listens until 'Gentiles' - then riot → About to be flogged → 'Is it legal to flog Roman citizen?' → Commander afraid → Next day before Sanhedrin → Paul: 'Lived in good conscience' → High priest orders him struck → Paul: 'God will strike you, whitewashed wall' → Realizes he's high priest, apologizes → Paul cleverly divides Pharisees and Sadducees over resurrection → Violent dissension → Commander rescues Paul again → That night: Lord stands by Paul: 'Take courage, you will testify in Rome' → Jewish plot to kill Paul → Paul's nephew warns commander → Paul sent to Caesarea under heavy guard",
        "tension": "Paul warned repeatedly not to go to Jerusalem. Has he made a mistake? Will he be killed before reaching Rome?",
        "resolution": "Paul arrested but under Roman protection. Jesus appears: 'You WILL testify in Rome.' Even Jewish plots become means of advancing mission.",
        "messiahLink": "Risen Jesus who appeared to Paul and called him to Gentiles (Acts 22:6-21); Lord who stands by Paul and promises he'll reach Rome (Acts 23:11)",
        "notes": "Paul's friends beg him not to go to Jerusalem but he presses on (Acts 21:13): 'Ready to die for Jesus.' Note James' compromise suggestion: Take vow to show you respect law. Paul agrees (showing flexibility) but still ends up arrested. His testimony to the crowd goes well until he mentions 'Gentiles' - then they riot (Acts 22:21-22). This shows deep-seated ethnic prejudice. Jesus appears: 'You WILL testify in Rome' - Paul's arrest becomes God's vehicle to get him to Rome as prisoner-witness."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts24-26": {
      "title": "Paul's Trials Before Felix, Festus & Agrippa",
      "reference": "Acts 24:1-26:32",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Felix: High priest accuses Paul → Paul defends himself, speaks of Way, resurrection, righteousness, self-control, judgment → Felix afraid, sends him away → Hopes for bribe, keeps Paul imprisoned 2 years → Festus succeeds Felix → Jews request Paul be sent to Jerusalem (planning ambush) → Festus suggests trial in Jerusalem → Paul: 'I appeal to Caesar' → Days later: King Agrippa and Bernice visit → Festus explains Paul's case → Agrippa wants to hear Paul → Next day: Paul before Agrippa → Paul's testimony: Strict Pharisee, hope in promise to ancestors, persecuted church, Damascus road, commissioned to Gentiles, preaches only what prophets and Moses said → Festus: 'You're out of your mind!' → Paul: 'I'm not insane, King Agrippa knows these things' → Agrippa: 'You almost persuade me to become a Christian' → Verdict: 'This man has done nothing worthy of death or imprisonment' → But he appealed to Caesar, so to Caesar he must go",
        "tension": "Paul in custody 2+ years. Will he rot in prison? Will Jewish plot succeed? How will his case end?",
        "resolution": "Through trials, Paul gives testimony to rulers (fulfilling Jesus' prophecy Acts 9:15). His appeal to Caesar guarantees he'll reach Rome. Even imprisonment becomes platform for witness.",
        "messiahLink": "Resurrected Lord who appeared to Paul (Acts 26:15-18); Suffering Messiah prophesied by Moses and prophets (Acts 26:22-23)",
        "notes": "Paul's three defenses progress: (1) Jews in Jerusalem (Acts 22) - emphasizes Jewish credentials, (2) Felix (Acts 24) - emphasizes righteousness and judgment, (3) Agrippa (Acts 26) - emphasizes fulfillment of OT prophecy. Each audience hears adapted version. Agrippa 'almost persuaded' (Acts 26:28) - tantalizing 'what if?' Felix wants bribe, Festus thinks Paul insane, but they all agree he's innocent. Paul's appeal to Caesar fulfills Jesus' promise (Acts 23:11) - he WILL reach Rome."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "speaker": "Narrator",
      "audience": "All readers"
    },
    "arc-acts27-28": {
      "title": "Voyage to Rome, Shipwreck, Arrival & Ministry",
      "reference": "Acts 27:1-28:31",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Sail from Caesarea → Storm brewing → Paul warns: 'This will be disastrous' → Ignored → Caught in violent storm (Northeaster) → 14 days at sea, no sun, no hope → Angel appears to Paul: 'Don't be afraid, you must stand before Caesar, God has given you all who sail with you' → Paul encourages all: 'Take heart, I have faith in God' → Run aground on Malta → Ship breaks apart → All 276 people reach shore safely → Malta: Viper bites Paul, people expect him to die → Paul unharmed, people think he's a god → Paul heals Publius's father and many others → 3 months later sail to Rome → Roman Christians come to meet Paul → Paul encouraged → Rome: Under house arrest, allowed to receive visitors → Calls local Jewish leaders → Paul explains gospel, some believe, some don't → Paul: Isaiah prophesied you'd hear but not understand → 'Therefore salvation sent to Gentiles' → 2 years preaching kingdom, teaching about Jesus, with boldness, unhindered",
        "tension": "Will Paul survive voyage? Will he reach Rome as promised? Will his ministry continue even in chains?",
        "resolution": "Jesus' promise fulfilled (Acts 23:11) - Paul reaches Rome. Even as prisoner, he preaches boldly for 2 years. Gospel has gone from Jerusalem to the capital of the empire. Book ends with mission still advancing.",
        "messiahLink": "Jesus' promise to Paul fulfilled (Acts 23:11); Kingdom of God and Lord Jesus Christ preached in Rome (Acts 28:31)",
        "notes": "Epic sea voyage mirrors Jonah (storm, God's man on boat) but reverses it (Paul obedient, saves everyone). Paul's encouragement during storm (Acts 27:21-26) shows his faith. Malta: viper bite doesn't harm him (fulfills Mark 16:18). Book ends abruptly with Paul still in Rome preaching - not about Paul's death but about gospel's unstoppable advance. The mission continues."
      },
      "primaryType": "narrative",
      "group": "Ends of the Earth (Acts 13–28)",
      "speaker": "Narrator",
      "audience": "All readers"
    }
  }
}