{
  "book": "Luke",
  "testament": "nt",
  "corpus": "Gospels",
  "theme": "Jesus fulfills Israel's covenant story and inaugurates God's kingdom—good news for all people, especially the poor and marginalized.",
  "structure": "1–2 Infancy narratives (promise/fulfillment) - HOW through faithful waiting, WHY to share hope globally\n3–4 Preparation + Nazareth manifesto (Spirit + Scripture)\n4–9 Galilee ministry (kingdom deeds/words)\n9:51–19a Journey to Jerusalem (discipleship + reversal) - literal road motif\n19b–23 Jerusalem conflict, supper, cross\n24 Resurrection + commissioning (bridge to Acts)",
  "messiahProfile": "Son of Man who seeks and saves the lost; Suffering Servant-King who brings God's kingdom through sacrifice",
  "overview": "Luke presents an orderly account showing how Jesus fulfills the Scriptures, brings God's kingdom to the poor and outsiders, and forms a Spirit-led people. The story moves from Israel's hope (Luke 1–2), to Jesus' Spirit-anointed mission in Galilee, to a long journey toward Jerusalem, culminating in the cross and resurrection, and ending with commissioning and worship (Luke 24). Volume 1 of Luke-Acts.",
  "passages": {
    "luke-1-zechariah": {
      "reference": "Luke 1:5-25",
      "title": "Announcement to Zechariah (John's Coming)",
      "speaker": "Angel Gabriel",
      "audience": "Zechariah",
      "category": "narrative-only",
      "narrativeContext": "God breaks centuries of prophetic silence with news of a forerunner in the spirit of Elijah.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Barren couple; priestly duty; angelic announcement; unbelief leads to silence.",
        "tension": "Can God's promises be trusted after 400 years of silence?",
        "storyPanels": "Panel 1: Faithful priest at duty; Panel 2: Gabriel appears with promise; Panel 3: 'How can I be sure?'; Panel 4: Sign of silence until fulfillment.",
        "pattern": "God acts through faithful waiting, but doubt delays full experience of promise.",
        "messiahLink": "John prepares the way for the Messiah—the forerunner in Elijah's spirit who calls Israel to repentance.",
        "notes": "Parallels Abraham/Sarah, Hannah/Elkanah. Shows HOW God works—through faithful people waiting on His timing."
      },
      "expository": {
        "context": "Luke begins with temple worship and priestly faithfulness to show covenant continuity.",
        "tension": "Promise meets impossibility; faith wrestles with doubt.",
        "structure": "v.5-7 (setting + barrenness), v.8-17 (promise), v.18-20 (doubt + sign), v.21-25 (silence + conception).",
        "messiahProfile": "The Messiah's forerunner announced in temple—connecting old covenant to new.",
        "messiahLink": "John will turn hearts back to God and prepare a people for the Lord (v.17)—fulfilling Malachi 4.",
        "notes": "Gabriel's appearance echoes Daniel 9—another promise of Messiah's coming."
      },
      "primaryType": "narrative",
      "group": "Infancy Narratives (Luke 1–2)"
    },
    "luke-4": {
      "reference": "Luke 4:16-30",
      "title": "Rejection at Nazareth (Mission Manifesto)",
      "types": [
        "expository",
        "narrative"
      ],
      "expository": {
        "context": "Jesus returns to hometown Nazareth; reads from Isaiah 61 in synagogue; claims it's fulfilled today; initially welcomed, then violently rejected",
        "tension": "How can hometown boy be the Messiah? Why does He say God will bless Gentiles while judging Israel?",
        "structure": "v.16-21 (Isaiah fulfilled today), v.22-27 (Examples of God blessing Gentiles - widow of Zarephath, Naaman), v.28-30 (Violent rejection, Jesus escapes)",
        "messiahProfile": "Spirit-anointed Messiah who brings good news to the poor, freedom to captives, sight to blind - but will be rejected by His own people",
        "messiahLink": "Jesus is the fulfillment of Isaiah 61 - the Jubilee year personified. But His mission includes Gentiles (like Elijah to Zarephath, Elisha to Naaman), which enrages hometown crowd. Foreshadows His rejection and Gentile mission.",
        "notes": "This is Jesus' mission statement in Luke—WHY He came: to share hope with the whole world, especially the poor and marginalized. Isaiah 61 describes the Jubilee year - debts canceled, slaves freed, land returned. Jesus says 'Today this scripture is fulfilled' - He IS the Jubilee. Crowd's rage when He mentions Gentiles shows Israel's resistance to God's global plan. This manifesto sets the agenda for all of Luke-Acts."
      },
      "narrative": {
        "storyPanels": "Panel 1: Elijah sent to Gentile widow in famine (1 Kings 17); Panel 2: Elisha heals Gentile leper Naaman (2 Kings 5); Panel 3: Jesus announces good news to the poor; Panel 4: Hometown rejects Him",
        "pattern": "God's people expect exclusive blessing but resist when God shows mercy to outsiders. This pattern repeats from OT prophets through Jesus.",
        "messiahLink": "Jesus is greater than Elijah and Elisha - His mission of mercy extends beyond Israel to all nations. His rejection at Nazareth foreshadows Israel's rejection and the gospel going to Gentiles.",
        "notes": "Notice Jesus chooses two OT stories where God blesses Gentiles while judging Israel. This is deliberate - He's warning that the pattern will repeat. They try to kill Him (v.29) but He walks through the crowd - they can't stop God's plan."
      },
      "speaker": "Jesus",
      "audience": "Nazareth synagogue",
      "category": "sermon",
      "narrativeContext": "Jesus returns to Nazareth, reads Isaiah in synagogue, announces fulfillment, confronts hometown unbelief.",
      "sermonSection": "4:16-27",
      "primaryType": "narrative",
      "group": "Preparation + Galilee (Luke 3–9)"
    },
    "luke-15": {
      "reference": "Luke 15:11-32",
      "title": "The Prodigal Son(s)",
      "types": [
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Younger son demands inheritance, wastes it, returns broken; Panel 2: Father runs to embrace him, throws party; Panel 3: Elder son refuses to join, angry at father's grace; Panel 4: Father pleads with elder son",
        "pattern": "Both sons are lost - younger son in obvious rebellion, elder son in self-righteous resentment. Father's love pursues both. The real scandal: grace for the undeserving while the 'righteous' refuse to celebrate.",
        "messiahLink": "Father represents God's extravagant grace in Jesus. Younger son = tax collectors and sinners Jesus welcomes (Luke 15:1). Elder son = Pharisees who grumble (Luke 15:2). Jesus IS the true elder brother who doesn't resent grace to rebels but dies to bring them home.",
        "notes": "Context is key: Pharisees complaining 'This man welcomes sinners and eats with them' (15:2). Jesus tells three parables (lost sheep, lost coin, lost sons) to show God's joy over finding the lost. Story ends with elder son outside - will he come in? Will Pharisees accept Jesus' mission? Open ending forces decision. Part of Luke's ongoing 'Jesus' banquet with sinners vs. religious leaders' conflict."
      },
      "speaker": "Jesus",
      "audience": "Pharisees, scribes, and the crowd",
      "category": "parable",
      "narrativeContext": "Tax collectors and sinners draw near; Pharisees grumble; Jesus answers with three parables of lostness and joy.",
      "sermonSection": "15:1-32",
      "primaryType": "expository",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-9-51-journey-begins": {
      "reference": "Luke 9:51-62",
      "title": "Journey to Jerusalem Begins (Setting His Face)",
      "speaker": "Jesus",
      "audience": "Disciples + would-be followers",
      "category": "teaching",
      "narrativeContext": "Jesus resolutely turns toward Jerusalem; the journey narrative begins; tests of discipleship.",
      "sermonSection": "9:51-62",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Jesus sets His face toward Jerusalem (cross); Samaritan village rejects; disciples want judgment; radical discipleship calls.",
        "tension": "Will followers understand that the way to glory passes through the cross?",
        "storyPanels": "Panel 1: Determined turn to Jerusalem; Panel 2: Samaritan rejection; Panel 3: James/John want fire; Panel 4: Three discipleship challenges—foxes/dead/plow.",
        "pattern": "The journey motif shapes everything from 9:51 to 19:44—disciples learn kingdom values on the road to the cross.",
        "messiahLink": "Jesus is the Son of Man with nowhere to lay His head; following Him means radical allegiance and sacrifice.",
        "notes": "This verse (9:51) is the hinge—everything shifts to journey mode. Luke emphasizes the road as discipleship school."
      },
      "expository": {
        "context": "Luke marks a structural shift: from Galilee ministry to Jerusalem-focused journey.",
        "tension": "Discipleship means following a rejected, suffering Messiah.",
        "structure": "v.51-56 (resolve + rejection), v.57-62 (three calls to radical commitment).",
        "messiahProfile": "Suffering Son of Man whose way is the cross.",
        "messiahLink": "The journey to Jerusalem is Luke's extended meditation on what it means to follow the crucified Messiah.",
        "notes": "Sets up the entire middle section of Luke (9:51–19:44)—the longest journey narrative in the Gospels."
      },
      "primaryType": "narrative",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-19-entry": {
      "reference": "Luke 19:28-44",
      "title": "Triumphal Entry + Weeping Over Jerusalem",
      "speaker": "Jesus",
      "audience": "Disciples + Jerusalem crowds",
      "category": "narrative-only",
      "narrativeContext": "Jesus enters Jerusalem as King; crowds praise; religious leaders resist; Jesus weeps over the city's coming judgment.",
      "sermonSection": "",
      "types": [
        "narrative",
        "prophetic"
      ],
      "narrative": {
        "context": "Deliberate Messianic entry on a colt; Psalm 118 praise; Pharisees object; Jesus prophesies destruction.",
        "tension": "Will Jerusalem receive her King—or reject Him and face judgment?",
        "storyPanels": "Panel 1: Colt preparation; Panel 2: 'Blessed is the King'; Panel 3: Pharisees complain; Panel 4: Jesus weeps; Panel 5: Prophecy of siege.",
        "pattern": "The King arrives humbly (Zechariah 9); the city doesn't recognize the time of visitation; judgment follows rejection.",
        "messiahLink": "Jesus is the Davidic King who fulfills Zechariah 9:9—righteous, humble, bringing peace. But rejection leads to covenant curse.",
        "notes": "Journey to Jerusalem culminates here. Marks transition from journey (9:51–19:27) to Jerusalem conflict (19:28–23:56)."
      },
      "prophetic": {
        "context": "Jesus announces judgment on Jerusalem for missing 'the time of your visitation' (19:44).",
        "tension": "Covenant people face covenant judgment when they reject the Messiah.",
        "structure": "28-40 (entry + praise), 41-44 (weeping + prophecy).",
        "messiahProfile": "Weeping King who offers peace but pronounces judgment on rejection.",
        "messiahLink": "The Messiah's tears reveal His heart—He longs for Jerusalem's peace but must pronounce judgment for their hardness.",
        "notes": "Fulfilled in AD 70. Luke's audience would recognize this as covenant lawsuit language."
      },
      "primaryType": "narrative",
      "group": "Jerusalem Conflict (Luke 19–23)"
    },
    "luke-22-gethsemane": {
      "reference": "Luke 22:39-46",
      "title": "Gethsemane (Agony + Surrender)",
      "speaker": "Jesus",
      "audience": "The Father + disciples",
      "category": "narrative-only",
      "narrativeContext": "Jesus faces the cup of suffering; prays in agony; disciples sleep; an angel strengthens Him.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Jesus withdraws to pray; sweat like blood; 'not my will but yours'; disciples found sleeping.",
        "tension": "Will Jesus go through with the Father's plan—and will disciples watch and pray?",
        "storyPanels": "Panel 1: Withdrawal to pray; Panel 2: Agony—'remove this cup'; Panel 3: Angel strengthens; Panel 4: Sweat like blood; Panel 5: Disciples sleeping; Panel 6: 'Pray that you may not enter temptation.'",
        "pattern": "Prayer sustains through testing; surrender to the Father's will is the pattern for all disciples.",
        "messiahLink": "Jesus is the obedient Son who submits to the cup of wrath for our sake—the second Adam who succeeds where the first failed.",
        "notes": "Luke uniquely mentions the angel and the sweat like blood, emphasizing the human agony of Jesus' choice."
      },
      "expository": {
        "context": "Luke frames Gethsemane as prayer warfare—Jesus vs. temptation, sustained by heaven.",
        "tension": "Obedience to the cross requires supernatural strength.",
        "structure": "v.39-42 (prayer for cup removal + surrender), v.43-44 (angel + agony), v.45-46 (sleeping disciples).",
        "messiahProfile": "Obedient Son who prays His way to the cross.",
        "messiahLink": "Jesus models the prayer-dependence He taught (Luke 11); His victory in Gethsemane secures ours.",
        "notes": "The cup = wrath of God against sin. Jesus drinks it so we don't have to."
      },
      "primaryType": "narrative",
      "group": "Jerusalem Passion (Luke 19–23)"
    },
    "luke-23-burial": {
      "reference": "Luke 23:50-56",
      "title": "Burial by Joseph of Arimathea",
      "speaker": "Narrator",
      "audience": "All readers",
      "category": "narrative-only",
      "narrativeContext": "A righteous council member buries Jesus; women observe; Sabbath rest observed.",
      "sermonSection": "",
      "types": [
        "narrative"
      ],
      "narrative": {
        "context": "Joseph (a dissenting council member) asks for the body; wraps in linen; places in new tomb; women watch; Sabbath rest.",
        "tension": "Is this the end—or is there hope beyond the tomb?",
        "storyPanels": "Panel 1: Joseph's courage; Panel 2: Body taken down; Panel 3: Linen wrapping; Panel 4: New tomb; Panel 5: Women observe; Panel 6: Sabbath rest.",
        "pattern": "Faithful remnant (Joseph, women) honor Jesus in death; Sabbath rest before resurrection morning.",
        "messiahLink": "Jesus is buried as a criminal but honored by the faithful—foreshadowing vindication through resurrection.",
        "notes": "Luke emphasizes the women's faithfulness—they prepare spices and wait for Sunday. Continuity from cross to tomb to resurrection."
      },
      "primaryType": "narrative",
      "group": "Jerusalem Passion (Luke 19–23)"
    },
    "luke-24": {
      "reference": "Luke 24:13-35",
      "title": "Road to Emmaus",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Two disciples walking away from Jerusalem, hopeless; Panel 2: Stranger joins them (Jesus unrecognized); Panel 3: Jesus explains all Scripture about Himself; Panel 4: They recognize Him in breaking of bread, He vanishes; Panel 5: They return to Jerusalem with joy",
        "pattern": "Disciples expect political Messiah, are crushed by crucifixion, don't understand Scripture's plan. Jesus opens their eyes: Messiah had to suffer to enter glory. Pattern: Suffering → Glory.",
        "messiahLink": "Jesus is the key to understanding all Scripture - 'beginning with Moses and all the Prophets, he interpreted to them in all the Scriptures the things concerning himself' (v.27). The crucifixion wasn't Plan B; it was foretold throughout the OT.",
        "notes": "This is Luke's hermeneutic lesson: How to read the OT after the resurrection. Everything points to Jesus. Their 'hearts burned' when He opened the Scriptures (v.32). Recognition came in bread-breaking (Eucharist/Last Supper echo). Shows Jesus is risen AND shows how to preach the OT."
      },
      "expository": {
        "context": "Resurrection Sunday; two disciples leaving Jerusalem dejected; Jesus joins them unrecognized; teaches them from Scripture; revealed in breaking bread",
        "tension": "How could the Messiah die? Doesn't this mean He failed? How do we make sense of Scripture now?",
        "structure": "v.13-24 (Dejected disciples recount events), v.25-27 (Jesus: Messiah had to suffer - it's in Scripture!), v.28-32 (Eyes opened in bread-breaking), v.33-35 (Return to Jerusalem with testimony)",
        "messiahProfile": "The suffering Messiah foretold in Moses, Prophets, and Psalms who had to die and rise to enter His glory",
        "messiahLink": "Jesus walks through the entire OT showing how it all points to Him - His suffering, death, and resurrection were planned from the beginning. The cross isn't defeat; it's the prophesied path to glory.",
        "notes": "Best passage for teaching how Jesus fulfills the OT. Notice: (1) Messiah HAD to suffer (v.26 - divine necessity), (2) ALL Scripture speaks of Him (v.27), (3) Recognition comes through Scripture + Sacrament. This is Luke's theology in a nutshell."
      },
      "speaker": "Jesus",
      "audience": "Disciples",
      "category": "resurrection",
      "narrativeContext": "Resurrection appearances clarify Scripture and commission witnesses; Jesus opens minds and promises the Spirit.",
      "sermonSection": "24:44-49",
      "primaryType": "narrative",
      "group": "Resurrection + Commissioning (Luke 24)"
    },
    "luke-24-commissioning": {
      "reference": "Luke 24:44-53",
      "title": "Great Commission + Ascension (Bridge to Acts)",
      "speaker": "Jesus",
      "audience": "The disciples",
      "category": "teaching",
      "narrativeContext": "Jesus interprets Scripture, commissions witnesses, promises the Spirit, and ascends; disciples worship with joy.",
      "sermonSection": "24:44-49",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Jesus opens their minds to understand Scripture; announces mission to all nations; promises the Spirit.",
        "tension": "How will disciples carry the message—and with what power?",
        "structure": "v.44-47 (Scripture fulfillment + mission), v.48-49 (witnesses + Spirit promise), v.50-53 (ascension + worship).",
        "messiahProfile": "Risen Lord who sends Spirit-empowered witnesses.",
        "messiahLink": "Jesus fulfills the Law, Prophets, and Psalms—and now sends His people to proclaim repentance and forgiveness to all nations, empowered by the Spirit.",
        "notes": "This is the explicit hinge to Acts. 'Go announce God's forgiveness and offer of Spirit baptism to everyone' (poster language). Luke 24:49 = Acts 1:8. The Gospel ends where Acts begins—waiting for the Spirit."
      },
      "prophetic": {
        "context": "Jesus commissions a global mission rooted in Scripture and empowered by the Spirit.",
        "tension": "The mission requires divine power—disciples must wait for 'power from on high.'",
        "structure": "Scripture opened → mission given → Spirit promised → ascension → worship.",
        "messiahProfile": "Ascended Lord who continues His mission through Spirit-filled witnesses.",
        "messiahLink": "The Messiah's work continues in Acts through His people—Luke-Acts is one story of Jesus' ongoing mission.",
        "notes": "Volume 1 ends; Volume 2 (Acts) begins. The mission to 'all nations' fulfills Luke 4's manifesto and answers 'WHY'—to share hope with the world."
      },
      "primaryType": "expository",
      "group": "Resurrection + Commissioning (Luke 24)"
    },
    "luke-1-annunciation": {
      "reference": "Luke 1:26-38",
      "title": "Announcement to Mary (Incarnation Promise)",
      "speaker": "Angel Gabriel",
      "audience": "Mary",
      "category": "narrative-only",
      "narrativeContext": "God initiates the fulfillment of Israel's hopes through a humble young woman in Nazareth.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Gabriel announces a Davidic Son conceived by the Holy Spirit; Mary responds in faith.",
        "tension": "How can God's promised King come through weakness, shame, and impossibility?",
        "storyPanels": "Panel 1: Angel appears with favor; Panel 2: Promise of Davidic throne; Panel 3: 'How?'—Holy Spirit overshadowing; Panel 4: Mary's surrender: 'Let it be'.",
        "pattern": "God fulfills covenant promises through humble faith and Spirit power, not human control. Shows HOW God works—through faithful waiting on His impossible promises.",
        "messiahLink": "Jesus is the promised Son of David and Son of the Most High—conceived by the Spirit, embodying Israel's hope from the start.",
        "notes": "Echoes OT annunciations (Sarah/Hannah). Overshadowing evokes tabernacle presence—God dwelling with His people. Mary's 'yes' is the model of faithful response that Luke 1-2 emphasizes."
      },
      "expository": {
        "context": "The angel's message grounds Jesus' identity in Davidic and divine language.",
        "tension": "Promise meets impossibility; faith responds to God's initiative.",
        "structure": "v.26-30 (favor + fear), v.31-33 (identity + kingdom), v.34-37 (Spirit conception + sign), v.38 (surrender).",
        "messiahProfile": "Davidic King, Son of the Most High, Spirit-conceived.",
        "messiahLink": "The kingdom begins not with coercion but with a 'yes' to God's word; the Messiah arrives through the Spirit and a servant-hearted faith.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Infancy Narratives (Luke 1–2)"
    },
    "luke-2-birth-shepherds": {
      "reference": "Luke 2:1-20",
      "title": "Birth of Jesus + Shepherds (Good News to the Lowly)",
      "speaker": "Narrator",
      "audience": "All readers",
      "category": "narrative-only",
      "narrativeContext": "In Caesar's world, God's true King is born in humility; angels announce to shepherds.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Jesus is born in Bethlehem; laid in a manger; angels proclaim peace; shepherds become first witnesses.",
        "tension": "Will people recognize God's King when He arrives without status, power, or comfort?",
        "storyPanels": "Panel 1: Census and travel; Panel 2: Birth in poverty; Panel 3: Angels to shepherds; Panel 4: Shepherds visit and spread the news; Panel 5: Mary treasures and ponders.",
        "pattern": "God reveals glory to the overlooked; the kingdom advances through humble witnesses.",
        "messiahLink": "Jesus is 'Savior…Christ the Lord' (2:11). The sign is humility (manger), redefining what salvation and lordship look like.",
        "notes": "Contrast Caesar's decree vs God's decree. Shepherds as credible witnesses in God's upside-down economy."
      },
      "expository": {
        "context": "Luke frames Jesus' birth against imperial power to show a different kind of Lordship.",
        "tension": "Competing 'gospels': Rome's peace vs God's peace.",
        "structure": "1-7 (setting + humility), 8-14 (angelic gospel), 15-20 (response + witness).",
        "messiahProfile": "Savior, Christ, Lord—bringing peace through humility.",
        "messiahLink": "The 'good news' is announced first to shepherds; God's peace comes through the Messiah's humble arrival.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Infancy Narratives (Luke 1–2)"
    },
    "luke-2-simeon-anna": {
      "reference": "Luke 2:21-40",
      "title": "Simeon and Anna (Prophetic Witness)",
      "speaker": "Simeon + Anna",
      "audience": "Mary, Joseph, temple worshipers",
      "category": "narrative-only",
      "narrativeContext": "Faithful remnant in the temple recognize the Messiah; prophesy glory and suffering.",
      "sermonSection": "",
      "types": [
        "narrative",
        "prophetic"
      ],
      "narrative": {
        "context": "Jesus presented at temple; Simeon takes Him, blesses God, prophesies; Anna gives thanks, speaks of redemption.",
        "tension": "Will the faithful remnant recognize what Israel's leaders will miss?",
        "storyPanels": "Panel 1: Temple presentation; Panel 2: Simeon's embrace; Panel 3: 'My eyes have seen salvation'; Panel 4: Sword will pierce Mary's soul; Panel 5: Anna's testimony.",
        "pattern": "Spirit-led faithful ones recognize Messiah; prophecy includes both glory (light to nations) and suffering (sword).",
        "messiahLink": "Jesus is the consolation of Israel and redemption of Jerusalem—but His coming will divide hearts and cost dearly.",
        "notes": "Simeon's song (Nunc Dimittis) and prophecy are central to Luke's portrait of faithful waiting rewarded. Anna represents persistent prayer and prophetic witness."
      },
      "prophetic": {
        "context": "Simeon and Anna prophesy the Messiah's arrival and His dual impact—salvation and division.",
        "tension": "Will Israel receive the light—or will hearts be revealed in rejection?",
        "structure": "v.25-32 (Simeon's song—salvation for all), v.33-35 (sword prophecy), v.36-38 (Anna's testimony).",
        "messiahProfile": "Light for Gentiles, glory for Israel, sign of contradiction.",
        "messiahLink": "The Messiah brings salvation to all peoples but will reveal hearts and bring suffering even to His mother.",
        "notes": "'A sword will pierce your own soul' (v.35)—fulfilled at the cross. This passage shows WHY Luke emphasizes both joy and suffering."
      },
      "primaryType": "narrative",
      "group": "Infancy Narratives (Luke 1–2)"
    },
    "luke-3-baptism": {
      "reference": "Luke 3:21-22",
      "title": "Baptism of Jesus (Spirit Anointing)",
      "speaker": "Narrator",
      "audience": "All readers",
      "category": "narrative-only",
      "narrativeContext": "After John's ministry, Jesus is baptized; the Spirit descends; the Father speaks.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository",
        "prophetic"
      ],
      "narrative": {
        "context": "Jesus prays at baptism; heaven opens; Spirit descends; Father declares delight.",
        "tension": "What kind of Messiah will Jesus be—one who identifies with sinners and receives the Spirit?",
        "storyPanels": "Panel 1: Jesus joins the baptized; Panel 2: Prayer; Panel 3: Spirit descends; Panel 4: Father's voice.",
        "pattern": "Mission begins with humility + prayer + Spirit empowerment + divine identity affirmed.",
        "messiahLink": "Jesus is the beloved Son anointed by the Spirit—echoing Psalm 2 and Isaiah's servant.",
        "notes": "Luke highlights prayer. This scene anchors Luke's Spirit-and-prayer motif."
      },
      "expository": {
        "context": "The baptism reveals Trinitarian action and inaugurates Jesus' public mission.",
        "tension": "Sonship and servanthood meet—royal Psalm 2 + servant Isaiah.",
        "structure": "21 (baptism + prayer), 22 (Spirit + voice).",
        "messiahProfile": "Beloved Son/Servant, Spirit-anointed.",
        "messiahLink": "Jesus is affirmed as Son and empowered by the Spirit, setting the pattern for Spirit-led discipleship in Luke–Acts.",
        "notes": ""
      },
      "prophetic": {
        "context": "Luke presents Jesus as the Spirit-anointed fulfillment of Israel's hope and the model for Spirit-filled witness.",
        "tension": "Will Israel receive the Servant-Son and His kingdom way?",
        "structure": "Identity (beloved Son) → empowerment (Spirit) → mission (fulfilled in Nazareth manifesto).",
        "messiahProfile": "Spirit-anointed Son who delights the Father.",
        "messiahLink": "The Spirit who rests on Jesus will be promised to His people (Luke 24; Acts 2)—baptism anticipates Pentecost.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Preparation + Galilee (Luke 3–9)"
    },
    "luke-6-sermon-plain": {
      "reference": "Luke 6:20-49",
      "title": "Sermon on the Plain (Kingdom Reversal + Discipleship)",
      "speaker": "Jesus",
      "audience": "Disciples + crowd",
      "category": "sermon",
      "narrativeContext": "After choosing the Twelve, Jesus teaches a new kingdom ethic shaped by mercy, integrity, and obedience.",
      "sermonSection": "6:20-49",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Jesus announces blessings/woes and forms a community whose life matches His kingdom.",
        "tension": "Will disciples embrace reversal (poor/blessed) and costly love (enemies) rather than worldly security?",
        "structure": "20-26 (blessings/woes), 27-36 (love enemies), 37-42 (judging), 43-45 (tree/fruit), 46-49 (wise builder).",
        "messiahProfile": "King who blesses the lowly and calls for mercy like the Father.",
        "messiahLink": "Jesus redefines blessing around the kingdom and calls followers to mirror God's mercy—anticipating the cross-shaped love He Himself embodies.",
        "notes": "Luke includes 'woes' that sharpen the reversal theme. Complements Matthew's longer Sermon on the Mount."
      },
      "prophetic": {
        "context": "Kingdom teaching functions as covenant warning and hope for a renewed people.",
        "tension": "Two paths: hearing vs doing; comfort now vs comfort in the kingdom.",
        "structure": "Reversal announcement → enemy-love ethic → heart exposure → foundation test.",
        "messiahProfile": "Teacher-King who forms a holy people.",
        "messiahLink": "The kingdom community is built on Jesus' words; obedience is the sign of true allegiance to the Messiah.",
        "notes": ""
      },
      "primaryType": "expository",
      "group": "Galilee Ministry (Luke 4–9)"
    },
    "luke-7-centurion": {
      "reference": "Luke 7:1-10",
      "title": "Centurion's Faith (Outsider Trusts Jesus)",
      "speaker": "Narrator",
      "audience": "All readers",
      "category": "narrative-only",
      "narrativeContext": "A Gentile centurion appeals for healing through authority; Jesus marvels at his faith.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Centurion seeks healing for servant; trusts Jesus' word-at-a-distance.",
        "tension": "Will Israel recognize what a Gentile sees—Jesus' authority and mercy?",
        "storyPanels": "Panel 1: Elders plead; Panel 2: Friends deliver humility message; Panel 3: Jesus marvels; Panel 4: Servant healed.",
        "pattern": "Outsiders often perceive the kingdom more clearly than insiders.",
        "messiahLink": "Jesus carries authority that heals by word, like God in creation—foreshadowing Gentile inclusion in Acts.",
        "notes": "Luke's reversal theme: an outsider models faith."
      },
      "expository": {
        "context": "The centurion understands authority; he transfers that logic to Jesus.",
        "tension": "Faith trusts the Messiah's word without demanding visible proof.",
        "structure": "1-5 (request), 6-8 (humility + authority), 9-10 (amazement + healing).",
        "messiahProfile": "Lord with authority over sickness.",
        "messiahLink": "Jesus is the authoritative Lord whose mercy reaches beyond Israel; this anticipates Acts' Gentile mission.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Galilee Ministry (Luke 4–9)"
    },
    "luke-10-good-samaritan": {
      "reference": "Luke 10:25-37",
      "title": "Parable of the Good Samaritan (Neighbor Love)",
      "speaker": "Jesus",
      "audience": "Law expert",
      "category": "parable",
      "narrativeContext": "A lawyer tests Jesus; Jesus reframes neighbor love through a despised outsider.",
      "sermonSection": "10:25-37",
      "types": [
        "expository",
        "narrative"
      ],
      "narrative": {
        "context": "A man is beaten; religious insiders pass by; a Samaritan shows mercy.",
        "tension": "Who is my neighbor—and what does true righteousness look like?",
        "storyPanels": "Panel 1: Question/test; Panel 2: Trap of self-justification; Panel 3: Story of three passersby; Panel 4: Mercy and cost; Panel 5: 'Go and do likewise.'",
        "pattern": "Mercy fulfills the law; true neighborliness crosses boundaries and bears cost.",
        "messiahLink": "Jesus embodies the mercy He commands and forms a people who mirror God's compassion.",
        "notes": "Luke's outsider reversal: Samaritan as model."
      },
      "expository": {
        "context": "Jesus affirms love of God/neighbor and exposes self-justification.",
        "tension": "Law-keeping without mercy becomes avoidance; kingdom love risks proximity and cost.",
        "structure": "25-28 (law summary), 29 (self-justify), 30-35 (parable), 36-37 (application).",
        "messiahProfile": "Teacher who reveals mercy as the heart of God's law.",
        "messiahLink": "The Messiah's kingdom forms disciples who 'do' mercy, not merely define it.",
        "notes": ""
      },
      "primaryType": "expository",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-11-lords-prayer": {
      "reference": "Luke 11:1-13",
      "title": "Teach Us to Pray (Father's Generosity)",
      "speaker": "Jesus",
      "audience": "Disciples",
      "category": "teaching",
      "narrativeContext": "Jesus' prayer life prompts disciples' request; Jesus teaches prayer and persistence and promises the Spirit.",
      "sermonSection": "11:1-13",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Prayer in Luke is a Spirit-shaped dependence on the Father.",
        "tension": "Can disciples trust the Father's goodness in delay and need?",
        "structure": "1-4 (model prayer), 5-10 (persistence), 11-13 (Father gives good gifts—ultimately the Holy Spirit).",
        "messiahProfile": "Son who reveals the Father and trains disciples in dependence.",
        "messiahLink": "Luke ties prayer to the gift of the Spirit (11:13), preparing the way for Acts' Spirit-outpouring and mission.",
        "notes": "Distinctively Lukan: 'how much more will the Father give the Holy Spirit…'"
      },
      "prophetic": {
        "context": "Jesus calls a praying community that will receive the Spirit for mission.",
        "tension": "Will the people rely on self-sufficiency or ask the Father for the Spirit?",
        "structure": "Prayer → persistence → promise of Spirit.",
        "messiahProfile": "Spirit-giving Son who teaches kingdom prayer.",
        "messiahLink": "The Father's gift culminates in Pentecost; Luke's prayer teaching bridges to Acts.",
        "notes": ""
      },
      "primaryType": "expository",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-14-great-banquet": {
      "reference": "Luke 14:15-24",
      "title": "Parable of the Great Banquet (Invitation + Reversal)",
      "speaker": "Jesus",
      "audience": "Dinner guests",
      "category": "parable",
      "narrativeContext": "At a meal, Jesus warns about presumption and pictures God's inclusive banquet.",
      "sermonSection": "14:15-24",
      "types": [
        "expository",
        "narrative",
        "prophetic"
      ],
      "narrative": {
        "context": "Invited guests make excuses; host fills house with the poor and outsiders.",
        "tension": "Will insiders receive God's invitation, or will they excuse themselves out of the kingdom?",
        "storyPanels": "Panel 1: Banquet invitation; Panel 2: Excuses; Panel 3: Invite poor/crippled/blind; Panel 4: Bring in outsiders; Panel 5: Exclusion of excuse-makers.",
        "pattern": "Presumption and distraction can exclude insiders; God's mercy welcomes outsiders.",
        "messiahLink": "Jesus embodies God's invitation and forms a table-shaped kingdom that welcomes the overlooked.",
        "notes": "Pairs well with Luke's table fellowship theme. Part of the 'Jesus' kingdom banquet vs. the poor' vs 'religious leaders' conflict visualized in poster."
      },
      "expository": {
        "context": "Jesus redefines who belongs at God's table.",
        "tension": "The kingdom confronts entitlement and demands response.",
        "structure": "15 (setup), 16-20 (excuses), 21-23 (outsiders invited), 24 (warning).",
        "messiahProfile": "Host-King who invites the marginalized.",
        "messiahLink": "The Messiah's banquet is open to the poor; refusing Jesus is refusing the invitation itself.",
        "notes": ""
      },
      "prophetic": {
        "context": "A covenant warning: refusing God's invitation leads to exclusion; mercy goes to unexpected guests.",
        "tension": "Israel's leaders can miss the kingdom through delay and excuse.",
        "structure": "Invitation → refusal → reversal → warning.",
        "messiahProfile": "King who announces the banquet and enacts reversal.",
        "messiahLink": "Jesus' mission to the poor (Luke 4) is pictured as a banquet invitation that expands beyond expected boundaries.",
        "notes": ""
      },
      "primaryType": "expository",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-18-rich-ruler": {
      "reference": "Luke 18:18-30",
      "title": "Rich Ruler (Treasure + Kingdom)",
      "speaker": "Jesus",
      "audience": "Ruler + disciples",
      "category": "teaching",
      "narrativeContext": "A moral man asks about eternal life; Jesus exposes what he truly treasures.",
      "sermonSection": "18:18-30",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Ruler claims commandment-keeping; Jesus calls him to surrender wealth; he goes away sad.",
        "tension": "Can someone enter the kingdom while clinging to what they trust most?",
        "storyPanels": "Panel 1: Question; Panel 2: Goodness and commandments; Panel 3: One lack—sell/give/follow; Panel 4: Sad departure; Panel 5: Camel/needle; Panel 6: Promise to those who leave all.",
        "pattern": "Wealth can blind; kingdom requires allegiance and trust in God.",
        "messiahLink": "Jesus invites discipleship that treats Him as treasure; His kingdom reverses earthly security and promises eternal reward.",
        "notes": "Fits Luke's reversal and generosity themes."
      },
      "expository": {
        "context": "Jesus uses the man's question to reveal heart-idolatry and define discipleship.",
        "tension": "Moral performance vs surrendered trust.",
        "structure": "18-23 (encounter), 24-27 (impossibility + God's power), 28-30 (promise).",
        "messiahProfile": "King who demands whole-hearted allegiance.",
        "messiahLink": "Entrance to life comes through following Jesus; God makes possible what is impossible for humans.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-19-zacchaeus": {
      "reference": "Luke 19:1-10",
      "title": "Zacchaeus (Salvation Comes to This House)",
      "speaker": "Jesus",
      "audience": "Zacchaeus + crowd",
      "category": "narrative-only",
      "narrativeContext": "A despised tax chief welcomes Jesus; repentance shows in generosity; Jesus states His mission.",
      "sermonSection": "19:9-10",
      "types": [
        "narrative",
        "testimony",
        "expository"
      ],
      "narrative": {
        "context": "Zacchaeus climbs to see; Jesus invites Himself; crowd grumbles; Zacchaeus responds with restitution and generosity.",
        "tension": "Can grace reach the worst—and will it produce real change?",
        "storyPanels": "Panel 1: Seeking; Panel 2: Invitation; Panel 3: Grumbling; Panel 4: Repentance + restitution; Panel 5: Mission statement.",
        "pattern": "Grace seeks the lost; salvation produces tangible transformation.",
        "messiahLink": "Jesus is the seeking Savior: 'The Son of Man came to seek and to save the lost.'",
        "notes": "A clean testimony template: before (greed/exclusion) → encounter (Jesus' call) → now (restitution/generosity). Part of Luke's 'Jesus' continued mission to the poor' theme."
      },
      "testimony": {
        "before": "Excluded tax chief, rich through injustice, spiritually curious but socially despised.",
        "encounter": "Jesus calls Zacchaeus by name and comes to his house; grace precedes performance.",
        "now": "Repentance expressed through restitution (4x) and generosity (half to poor); restored identity as 'son of Abraham.'",
        "messiahLink": "Jesus seeks and saves the lost; salvation shows in concrete life change.",
        "notes": ""
      },
      "expository": {
        "context": "Luke places Zacchaeus right before Jerusalem to summarize Jesus' mission.",
        "tension": "Crowd's contempt vs Jesus' mercy; grace vs self-righteousness.",
        "structure": "1-4 (seeking), 5-7 (grace encounter), 8 (response), 9-10 (interpretation/mission).",
        "messiahProfile": "Seeking Savior who brings salvation and forms generosity.",
        "messiahLink": "Jesus' mission statement here mirrors Luke 4's manifesto—good news for the poor and the lost.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Journey to Jerusalem (Luke 9:51–19)"
    },
    "luke-22-last-supper": {
      "reference": "Luke 22:14-34",
      "title": "Last Supper (New Covenant + Servant Leadership)",
      "speaker": "Jesus",
      "audience": "The Twelve",
      "category": "teaching",
      "narrativeContext": "At Passover, Jesus interprets His death as covenant and confronts pride among disciples.",
      "sermonSection": "22:14-20; 22:24-30",
      "types": [
        "expository",
        "prophetic",
        "narrative"
      ],
      "narrative": {
        "context": "Jesus re-centers Passover around His body and blood; disciples argue about greatness; Jesus teaches servant leadership.",
        "tension": "Can covenant people be formed by self-giving love rather than status-seeking?",
        "storyPanels": "Panel 1: Passover desire; Panel 2: Bread/cup new covenant; Panel 3: Greatness argument; Panel 4: 'I am among you as one who serves'; Panel 5: Warning to Peter.",
        "pattern": "New covenant community is formed at the table and shaped by serving, not grasping.",
        "messiahLink": "Jesus is the Passover fulfillment—His blood inaugurates the new covenant; His kingship is expressed through service.",
        "notes": "Luke uniquely emphasizes serving at the table."
      },
      "expository": {
        "context": "Luke ties Jesus' death to Passover and forms a servant-kingdom identity.",
        "tension": "Old expectations of power clash with the Messiah's servant way.",
        "structure": "14-20 (new covenant), 24-30 (servant leadership), 31-34 (testing + restoration promise).",
        "messiahProfile": "Covenant-making Servant-King.",
        "messiahLink": "The Messiah establishes the covenant through His death and defines greatness by service—anticipating the cross.",
        "notes": ""
      },
      "prophetic": {
        "context": "Jesus announces covenant fulfillment and forecasts testing and restoration for His followers.",
        "tension": "A kingdom people must endure sifting and remain faithful.",
        "structure": "Covenant meal → new community ethic → testing warning.",
        "messiahProfile": "Faithful Messiah who prays for His people.",
        "messiahLink": "Jesus' covenant blood secures the people; His intercession preserves them in trial.",
        "notes": ""
      },
      "primaryType": "expository",
      "group": "Jerusalem Passion (Luke 19–23)"
    },
    "luke-23-crucifixion": {
      "reference": "Luke 23:32-49",
      "title": "Crucifixion (King Forgives + Opens Paradise)",
      "speaker": "Narrator",
      "audience": "All readers",
      "category": "passion",
      "narrativeContext": "Jesus is crucified between criminals; He forgives; a criminal believes; Jesus entrusts Himself to the Father.",
      "sermonSection": "",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "context": "Mockery and suffering; Jesus prays forgiveness; one criminal turns in faith; centurion responds.",
        "tension": "Is this really the King—and can salvation happen in utter weakness?",
        "storyPanels": "Panel 1: Crucifixion; Panel 2: Forgiveness prayer; Panel 3: Two criminals; Panel 4: 'Today…paradise'; Panel 5: Darkness/veil; Panel 6: Death + centurion.",
        "pattern": "The kingdom is revealed through suffering love; mercy triumphs in the darkest moment.",
        "messiahLink": "Jesus is the crucified King whose forgiveness and promise of paradise demonstrate true authority and salvation.",
        "notes": "Luke's emphasis: forgiveness, innocence, and faith response (criminal, centurion)."
      },
      "expository": {
        "context": "Luke interprets the cross as the climactic revelation of Jesus' kingship and mercy.",
        "tension": "Power is redefined: the King saves by dying and forgiving.",
        "structure": "32-38 (mockery + forgiveness), 39-43 (faith + promise), 44-49 (cosmic signs + witness).",
        "messiahProfile": "Forgiving King, righteous sufferer, Savior.",
        "messiahLink": "The Messiah secures salvation by mercy and self-giving—fulfilling Scripture and inaugurating the new exodus.",
        "notes": ""
      },
      "primaryType": "narrative",
      "group": "Jerusalem Passion (Luke 19–23)"
    }
  },
  "author": "Luke",
  "relationship": "Volume 1 of a 2-volume work (Luke–Acts). Luke introduces the story of Jesus as the fulfillment of Israel's hopes; Acts shows Jesus continuing His work through the Spirit.",
  "keyThemes": [
    "Fulfillment of Scripture",
    "Holy Spirit / prayer",
    "Reversal: poor lifted, proud humbled",
    "Outsiders welcomed (Gentiles, women, sinners)",
    "Discipleship on the road (9:51–19:44)",
    "Table fellowship and generosity",
    "Jesus' banquet with sinners vs. religious leaders' rejection",
    "Jesus' continued mission to the poor"
  ],
  "characterArcs": [
    "Mary: humble faith and prophetic praise (1–2)",
    "John the Baptist: forerunner who prepares the way (1–3)",
    "Peter: from calling to failure to restoration (5, 22, 24)",
    "The Twelve: learning the kingdom through misunderstanding and formation",
    "The marginalized: recipients of mercy and models of faith (7, 8, 17, 18, 19)"
  ],
  "sermonPatterns": [
    "Nazareth manifesto: Scripture → fulfillment → reversal → rejection (4:16–30)",
    "Parables that expose heart posture (10, 15, 18)",
    "Table teaching: humility, generosity, vigilance (11–14, 22)",
    "Journey discipleship: cross-shaped following (9:23–27; 9:51–19:44; 14:25–35)"
  ],
  "keyObservations": [
    "Luke frames Jesus' mission in Isaiah language and Exodus-style deliverance themes.",
    "Prayer and the Spirit recur at major transitions (baptism, choosing Twelve, transfiguration, passion, resurrection).",
    "Luke spotlights women and outsiders as key witnesses and exemplars of faith.",
    "The journey motif (9:51–19:44) is Luke's unique structural emphasis—discipleship happens on the road to Jerusalem.",
    "Luke-Acts is one continuous story: Luke ends where Acts begins (24:49 = Acts 1:8)."
  ],
  "applicationForSpeechBuilder": "Use Luke to build speeches that emphasize Scripture-fulfillment, Spirit-led mission, the kingdom's reversal of status, and a road-shaped discipleship that culminates in the cross and resurrection. Many Luke passages naturally map to narrative, expository, and parable-driven testimony patterns. The journey motif (9:51–19:44) provides a rich template for discipleship teaching. Luke's table fellowship conflicts (Jesus with sinners vs. Pharisees) and his emphasis on prayer + Spirit prepare readers for Acts' mission narrative."
}