{
  "book": "Luke",
  "testament": "nt",
  "corpus": "Gospels",
  "theme": "Jesus as the fulfillment of Israel's covenant story - good news of God's kingdom for all people, especially the poor and marginalized",
  "structure": [
    "Ch 1-2: Birth narratives (John the Baptist and Jesus)",
    "Ch 3-9: Ministry in Galilee - teaching, healing, calling disciples",
    "Ch 9-19: Journey to Jerusalem - discipleship training",
    "Ch 19-24: Jerusalem - death, resurrection, and commission"
  ],
  "messiahProfile": "Son of Man who seeks and saves the lost; Suffering Servant-King who brings God's kingdom through sacrifice",
  "overview": "Luke is part 1 of Luke-Acts, written to show how Jesus' story fulfills the long covenant story of God and Israel. Luke wants to produce 'an orderly account about the things that have been fulfilled among us.' The word 'fulfill' shows Luke's purpose: Jesus isn't just ancient history but the climax of God's story. Luke emphasizes Jesus' concern for outcasts, women, the poor, and Gentiles.",
  "passages": {
    "luke-4": {
      "reference": "Luke 4:16-30",
      "title": "Rejection at Nazareth",
      "types": ["expository", "narrative"],
      "expository": {
        "context": "Jesus returns to hometown Nazareth; reads from Isaiah 61 in synagogue; claims it's fulfilled today; initially welcomed, then violently rejected",
        "tension": "How can hometown boy be the Messiah? Why does He say God will bless Gentiles while judging Israel?",
        "structure": "v.16-21 (Isaiah fulfilled today), v.22-27 (Examples of God blessing Gentiles - widow of Zarephath, Naaman), v.28-30 (Violent rejection, Jesus escapes)",
        "messiahProfile": "Spirit-anointed Messiah who brings good news to the poor, freedom to captives, sight to blind - but will be rejected by His own people",
        "messiahLink": "Jesus is the fulfillment of Isaiah 61 - the Jubilee year personified. But His mission includes Gentiles (like Elijah to Zarephath, Elisha to Naaman), which enrages hometown crowd. Foreshadows His rejection and Gentile mission.",
        "notes": "This is Jesus' mission statement in Luke. Isaiah 61 describes the Jubilee year - debts canceled, slaves freed, land returned. Jesus says 'Today this scripture is fulfilled' - He IS the Jubilee. Crowd's rage when He mentions Gentiles shows Israel's resistance to God's global plan."
      },
      "narrative": {
        "storyPanels": "Panel 1: Elijah sent to Gentile widow in famine (1 Kings 17); Panel 2: Elisha heals Gentile leper Naaman (2 Kings 5); Panel 3: Jesus announces good news to the poor; Panel 4: Hometown rejects Him",
        "pattern": "God's people expect exclusive blessing but resist when God shows mercy to outsiders. This pattern repeats from OT prophets through Jesus.",
        "messiahLink": "Jesus is greater than Elijah and Elisha - His mission of mercy extends beyond Israel to all nations. His rejection at Nazareth foreshadows Israel's rejection and the gospel going to Gentiles.",
        "notes": "Notice Jesus chooses two OT stories where God blesses Gentiles while judging Israel. This is deliberate - He's warning that the pattern will repeat. They try to kill Him (v.29) but He walks through the crowd - they can't stop God's plan."
      }
    },
    "luke-15": {
      "reference": "Luke 15:11-32",
      "title": "The Prodigal Son(s)",
      "types": ["narrative"],
      "narrative": {
        "storyPanels": "Panel 1: Younger son demands inheritance, wastes it, returns broken; Panel 2: Father runs to embrace him, throws party; Panel 3: Elder son refuses to join, angry at father's grace; Panel 4: Father pleads with elder son",
        "pattern": "Both sons are lost - younger son in obvious rebellion, elder son in self-righteous resentment. Father's love pursues both. The real scandal: grace for the undeserving while the 'righteous' refuse to celebrate.",
        "messiahLink": "Father represents God's extravagant grace in Jesus. Younger son = tax collectors and sinners Jesus welcomes (Luke 15:1). Elder son = Pharisees who grumble (Luke 15:2). Jesus IS the true elder brother who doesn't resent grace to rebels but dies to bring them home.",
        "notes": "Context is key: Pharisees complaining 'This man welcomes sinners and eats with them' (15:2). Jesus tells three parables (lost sheep, lost coin, lost sons) to show God's joy over finding the lost. Story ends with elder son outside - will he come in? Will Pharisees accept Jesus' mission? Open ending forces decision."
      }
    },
    "luke-24": {
      "reference": "Luke 24:13-35",
      "title": "Road to Emmaus",
      "types": ["narrative", "expository"],
      "narrative": {
        "storyPanels": "Panel 1: Two disciples walking away from Jerusalem, hopeless; Panel 2: Stranger joins them (Jesus unrecognized); Panel 3: Jesus explains all Scripture about Himself; Panel 4: They recognize Him in breaking of bread, He vanishes; Panel 5: They return to Jerusalem with joy",
        "pattern": "Disciples expect political Messiah, are crushed by crucifixion, don't understand Scripture's plan. Jesus opens their eyes: Messiah had to suffer to enter glory. Pattern: Suffering → Glory.",
        "messiahLink": "Jesus is the key to understanding all Scripture - 'beginning with Moses and all the Prophets, he interpreted to them in all the Scriptures the things concerning himself' (v.27). The crucifixion wasn't Plan B; it was foretold throughout the OT.",
        "notes": "This is Luke's hermeneutic lesson: How to read the OT after the resurrection. Everything points to Jesus. Their 'hearts burned' when He opened the Scriptures (v.32). Recognition came in bread-breaking (Eucharist/Last Supper echo). Shows Jesus is risen AND shows how to preach the OT."
      },
      "expository": {
        "context": "Resurrection Sunday; two disciples leaving Jerusalem dejected; Jesus joins them unrecognized; teaches them from Scripture; revealed in breaking bread",
        "tension": "How could the Messiah die? Doesn't this mean He failed? How do we make sense of Scripture now?",
        "structure": "v.13-24 (Dejected disciples recount events), v.25-27 (Jesus: Messiah had to suffer - it's in Scripture!), v.28-32 (Eyes opened in bread-breaking), v.33-35 (Return to Jerusalem with testimony)",
        "messiahProfile": "The suffering Messiah foretold in Moses, Prophets, and Psalms who had to die and rise to enter His glory",
        "messiahLink": "Jesus walks through the entire OT showing how it all points to Him - His suffering, death, and resurrection were planned from the beginning. The cross isn't defeat; it's the prophesied path to glory.",
        "notes": "Best passage for teaching how Jesus fulfills the OT. Notice: (1) Messiah HAD to suffer (v.26 - divine necessity), (2) ALL Scripture speaks of Him (v.27), (3) Recognition comes through Scripture + Sacrament. This is Luke's theology in a nutshell."
      }
    }
  }
}