{
  "book": "Revelation",
  "testament": "nt",
  "corpus": "Johannine",
  "theme": "Jesus the slain Lamb conquers evil through sacrificial love and will return to make all things new—God's kingdom comes on earth as in heaven.",
  "subtitle": "A symbolic vision for every generation of the church",
  "greekTitle": "Ἀποκάλυψις (Apokalypsis)",
  "structure": "1:1-8 Prologue (blessing + promise)\n1:9-20 Vision of Jesus among the lampstands\n2–3 Letters to seven churches (call to faithfulness)\n4–5 Heavenly throne room + slain Lamb opens scroll\n6–7 Seven seals (judgments + sealed 144,000)\n8–11 Seven trumpets + two witnesses (call to witness)\n12–14 Seven sign visions (dragon, beasts, Lamb's army)\n15–16 Seven bowls (final judgments)\n17–18 Fall of Babylon the prostitute\n19–20 Final battle + 1,000 years + defeat of dragon\n21–22 New creation: marriage of heaven and earth + epilogue",
  "messiahProfile": "The slain Lamb who conquers through sacrificial love; Lion of Judah who reigns as King of kings; faithful witness who defeats evil and makes all things new; Alpha and Omega",
  "overview": "John's apocalyptic prophecy reveals how Jesus the slain Lamb conquered evil through the cross and will return to establish God's eternal kingdom. Written to seven churches facing persecution and compromise under Roman Empire, Revelation uses symbolic imagery from the Old Testament to show that God's kingdom advances through faithful witness—even unto death—not through violence. History's pattern: all human kingdoms become Babylon and must be resisted. God's promise: Jesus will return to remove evil and make all things new. The book culminates in the defeat of evil (dragon, beasts, Babylon) and the arrival of new creation where heaven and earth are united forever.",
  "passages": {
    "rev-1-1-8-prologue": {
      "reference": "Revelation 1:1-8",
      "title": "The Blessing: Introduction & Promise",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Opening of apocalyptic prophecy establishing its nature, blessing, and scope",
        "tension": "How should we read this book? What kind of literature is this?",
        "structure": "v.1-3 (nature of book + blessing), v.4-6 (greeting to seven churches), v.7-8 (promise of return)",
        "messiahProfile": "Faithful witness, firstborn from the dead, ruler of kings; Alpha and Omega who is coming",
        "messiahLink": "Jesus is the faithful witness who loved us and freed us by His blood. He will return visibly—every eye will see Him.",
        "notes": "Critical opening: defines book as 'apocalypse' (symbolic visions), 'prophecy' (word from God), and 'letter' (to real churches). Seven = completeness. Blessing promised to those who read, hear, and keep what's written—this is practical, not just esoteric."
      },
      "prophetic": {
        "context": "God promises Jesus' visible return and calls readers to faithful endurance",
        "tension": "Jesus is coming soon—how should we live in the meantime?",
        "structure": "Title and genre → blessing → greeting → promise",
        "messiahProfile": "Coming King whom every eye will see; the one who loves His people and freed them for God's purposes",
        "messiahLink": "Jesus has made His people 'a kingdom and priests' through His blood—they reign with Him now and will reign forever.",
        "notes": "Blessing formula (1:3) echoes beatitudes. 'Soon' means certainty, not necessarily immediacy. The book is meant to comfort and challenge, not to terrify or create speculation."
      },
      "speaker": "John + God",
      "audience": "Seven churches in Asia Minor",
      "category": "apocalyptic-letter",
      "narrativeContext": "Opening establishes the book's purpose: to reveal Jesus Christ's victory and coming kingdom to churches facing tribulation.",
      "sermonSection": "1:1-8",
      "primaryType": "expository",
      "group": "Prologue (Revelation 1:1-8)"
    },
    "rev-1-vision-of-christ": {
      "reference": "Revelation 1:9-20",
      "title": "Vision of Jesus Among the Lampstands",
      "types": [
        "narrative",
        "expository"
      ],
      "expository": {
        "context": "John exiled on Patmos receives vision of risen, exalted Jesus standing among seven lampstands (the churches)",
        "tension": "How will churches remain faithful amid persecution and compromise?",
        "structure": "v.9-11 (John's situation), v.12-16 (vision of exalted Christ), v.17-20 (commission to write)",
        "messiahProfile": "Exalted King of the world, Son of Man with eyes like fire and voice like rushing waters; Living One who holds keys of Death and Hades",
        "messiahLink": "Jesus is the risen Lord who holds the churches in His hand and walks among them—He is present with His suffering people and calls them to faithfulness.",
        "notes": "Seven lampstands = seven churches (from Zechariah). Jesus appears in glory but is intimately present with His people. Sets up the call to 'conquer' through faithfulness. John's fear and Jesus' comfort establish pattern: God's glory terrifies but also reassures."
      },
      "narrative": {
        "storyPanels": "Panel 1: John exiled on Patmos 'because of word of God'; Panel 2: Vision of majestic Christ—white hair, fiery eyes, bronze feet, voice like rushing waters; Panel 3: John falls as dead; Panel 4: Jesus' reassurance + commission",
        "pattern": "God reveals His presence and glory to His suffering people, commissioning them to bear witness.",
        "messiahLink": "Jesus the Living One who died and lives forever holds the keys of Death and Hades—His people need not fear.",
        "notes": "Adapted from Daniel 7 and 10. Jesus' appearance terrifies but also comforts. 'Do not fear' = repeated biblical pattern when God appears."
      },
      "speaker": "Jesus (in vision)",
      "audience": "John",
      "category": "apocalyptic-vision",
      "narrativeContext": "John receives prophetic vision while exiled; Jesus reveals Himself and commissions him to write to the churches.",
      "sermonSection": "1:9-20",
      "primaryType": "expository",
      "group": "Vision of Christ (Revelation 1:9-20)"
    },
    "rev-2-3-seven-churches": {
      "reference": "Revelation 2–3",
      "title": "Messages to the Seven Churches",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Jesus addresses specific churches: Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, Laodicea",
        "tension": "Will churches remain faithful amid wealth, persecution, compromise, and apathy?",
        "structure": "Each letter: address → commendation → rebuke → call to overcome → promise. Seven churches = complete picture of church struggles.",
        "messiahProfile": "The one who walks among the churches, who knows their works, who calls them to faithful witness",
        "messiahLink": "Jesus calls His people to 'conquer'—not through violence but through faithful witness. Rewards are drawn from the final vision of new creation (chs 21-22).",
        "notes": "Some churches are compromised (eating idol meat, sexual immorality in pagan temples—Pergamum, Thyatira). Others face persecution (Smyrna, Philadelphia). Some are apathetic due to wealth (Laodicea). Some lost first love (Ephesus). Jesus warns tribulation is coming—they must choose faithfulness or compromise."
      },
      "prophetic": {
        "context": "Jesus warns of coming tribulation and promises victory to those who conquer through faithful witness.",
        "tension": "Churches face temptation to deny Jesus to avoid persecution or join the spirit of Rome.",
        "structure": "Seven letters forming complete picture of church challenges: compromise, persecution, apathy, faithfulness.",
        "messiahProfile": "Judge who knows the churches' works; King who promises inheritance to overcomers",
        "messiahLink": "The rewards for conquering are all drawn from chapters 21–22: tree of life, new name, hidden manna, authority to reign, white robes, pillar in God's temple, New Jerusalem, throne with Christ.",
        "notes": "Sets up main plot tension: Will Jesus' people endure and inherit new creation? Why is faithfulness called 'conquering'? Rest of book answers this. The seven churches represent the universal church across time—every generation faces these temptations."
      },
      "speaker": "Jesus",
      "audience": "Seven churches in Asia Minor",
      "category": "prophetic-letter",
      "narrativeContext": "Jesus addresses churches facing persecution (Nero's past, Domitian's present) and cultural compromise under Roman Empire.",
      "sermonSection": "2:1–3:22",
      "primaryType": "prophetic",
      "group": "Seven Churches (Revelation 2–3)"
    },
    "rev-3-14-22-laodicea": {
      "reference": "Revelation 3:14-22",
      "title": "Letter to Laodicea: Wealth, Apathy, and Jesus at the Door",
      "types": [
        "prophetic",
        "expository"
      ],
      "prophetic": {
        "context": "Jesus addresses wealthy, self-satisfied church that thinks it needs nothing",
        "tension": "How does material wealth blind us to spiritual poverty?",
        "structure": "v.14-17 (diagnosis: lukewarm, wretched, blind, naked), v.18-20 (remedy: buy gold, see, let Jesus in), v.21-22 (promise: throne with Christ)",
        "messiahProfile": "Faithful and true witness, beginning of God's creation; the one who disciplines those He loves",
        "messiahLink": "Jesus stands at the door knocking—He pursues relationship even with compromised, complacent churches. Those who hear and open will feast with Him.",
        "notes": "Most famous image: Jesus knocking at door of His own church. Laodicea = wealthy city with banking, textile industry, medical school. They think they're rich but are 'poor, blind, and naked' spiritually. Jesus offers true riches, sight, and clothing."
      },
      "expository": {
        "context": "Church in wealthy city has become spiritually complacent—neither hot nor cold, but lukewarm",
        "tension": "Can wealth and comfort make us useless to God?",
        "structure": "Rebuke (no commendation) → call to repent → promise",
        "messiahProfile": "The Amen, faithful witness who speaks truth; loving disciplinarian",
        "messiahLink": "Jesus' rebuke is proof of His love—He disciplines those He loves. He wants restored fellowship, not comfortable apostasy.",
        "notes": "Lukewarm = water from nearby hot springs that arrived cold and full of minerals, making it nauseating. Church is useless—neither refreshing (cold) nor healing (hot). Jesus' call: 'Be zealous and repent.' The reward is staggering: share Christ's throne."
      },
      "speaker": "Jesus",
      "audience": "Church in Laodicea",
      "category": "prophetic-letter",
      "narrativeContext": "Wealthy church has become self-sufficient and blind to its spiritual poverty—represents danger of cultural accommodation through affluence.",
      "sermonSection": "3:14-22",
      "primaryType": "prophetic",
      "group": "Seven Churches (Revelation 2–3)"
    },
    "rev-4-5-throne-lamb": {
      "reference": "Revelation 4–5",
      "title": "The Throne of God & The Lamb: Who Can Open the Scroll?",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Throne room—creatures and elders worship Creator; Panel 2: Sealed scroll—no one in heaven, earth, or under earth can open; Panel 3: John weeps; Panel 4: Elder says 'Lion of Judah has conquered'; Panel 5: John sees slain Lamb standing alive; Panel 6: Lamb takes scroll; Panel 7: New song: 'Worthy is the Lamb'; Panel 8: All creation worships God and Lamb",
        "pattern": "Hear/see pattern: Hear military conquest language (Lion), see sacrificial love reality (Lamb). This is the key interpretive pattern for the entire book.",
        "messiahLink": "Jesus is the slain Lamb who conquered through His death and resurrection. The cross was not defeat—it was His enthronement, the way He conquered evil and redeemed humanity.",
        "notes": "Critical symbol: Jesus as slain Lamb. He overcame enemies by dying for them (true Passover Lamb). Resurrection proves His death was victory, not defeat. Lamb appears 'standing' (alive) but 'as if slain' (bearing marks of sacrifice). This paradox defines Revelation's Christology."
      },
      "expository": {
        "context": "Throne room worship; sealed scroll (OT prophecies of God's kingdom); only the slain Lamb can open it.",
        "tension": "How will God's kingdom come on earth? Who can bring it? Who is worthy?",
        "structure": "4:1-11 (throne worship—'Holy, holy, holy'), 5:1-5 (sealed scroll, Lion announced), 5:6-14 (Lamb appears, worshipped, opens scroll)",
        "messiahProfile": "Slain Lamb who is worthy to open the scroll; Lion of Judah who conquered through sacrifice; worthy of worship alongside God; has seven horns (power) and seven eyes (Spirit)",
        "messiahLink": "OT promise of victorious Messiah-King (Lion of Judah, Root of David) was inaugurated through the crucified Messiah. Jesus has divine authority to guide history to its conclusion.",
        "notes": "Scroll = sealed message from OT prophets (especially Daniel) about God's kingdom. Lamb's worthiness comes from His sacrificial death that redeems people from every tribe, language, people, and nation. The Lamb receives same worship as God—clear statement of deity."
      },
      "speaker": "Heavenly beings + 24 elders + 4 living creatures",
      "audience": "God and the Lamb",
      "category": "apocalyptic-vision",
      "narrativeContext": "Central vision establishing Jesus' authority and method: conquering through sacrificial love. This governs interpretation of everything that follows.",
      "sermonSection": "4:1–5:14",
      "primaryType": "narrative",
      "group": "The Throne & The Lamb (Revelation 4–5)"
    },
    "rev-5-1-14-worthy-lamb": {
      "reference": "Revelation 5:1-14",
      "title": "Worthy Is the Lamb: The Song of Redemption",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Scroll sealed with seven seals; Panel 2: No one worthy to open; Panel 3: John weeps; Panel 4: 'Lion has conquered'; Panel 5: Lamb appears—slain but standing; Panel 6: Lamb takes scroll; Panel 7: New song erupts; Panel 8: Every creature worships",
        "pattern": "Question → crisis → surprising answer → worship response. The Lamb's worthiness comes from His sacrifice, not His military might.",
        "messiahLink": "Jesus' sacrificial death is the basis of His authority. He didn't conquer by violence but by love—dying for His enemies to redeem them.",
        "notes": "The 'new song' (5:9-10) is new covenant theology: Lamb's blood purchases people for God, making them kingdom and priests. This is the gospel at the heart of Revelation."
      },
      "expository": {
        "context": "Climax of throne room scene—Lamb's worthiness revealed through His redemptive sacrifice",
        "tension": "How can God's kingdom come when evil dominates? Who is powerful enough?",
        "structure": "v.1-4 (sealed scroll, no one worthy), v.5-7 (Lion/Lamb revealed, takes scroll), v.8-14 (worship escalates: elders → angels → all creation)",
        "messiahProfile": "Lamb looking as if slain but standing alive; worthy to receive power, wealth, wisdom, strength, honor, glory, praise",
        "messiahLink": "The Lamb's sacrifice achieves what military conquest cannot: reconciliation. He creates a multi-ethnic kingdom of priests through His blood.",
        "notes": "Twenty-four elders (12 tribes + 12 apostles?) and four living creatures (all creation) worship together. Bowls of incense = prayers of saints—martyrs' prayers from 6:9-11. The Lamb receives same sevenfold worship as God (5:12-13)."
      },
      "speaker": "Elders, angels, all creation",
      "audience": "The Lamb",
      "category": "apocalyptic-vision",
      "narrativeContext": "Worship scene establishing the theological center of Revelation: the slain Lamb is worthy because He redeemed humanity through sacrificial love.",
      "sermonSection": "5:1-14",
      "primaryType": "narrative",
      "group": "The Throne & The Lamb (Revelation 4–5)"
    },
    "rev-6-7-seals-144000": {
      "reference": "Revelation 6:1–7:17",
      "title": "Seven Seals + The Lamb's Army: Who Can Stand?",
      "types": [
        "expository",
        "narrative"
      ],
      "expository": {
        "context": "Lamb opens seals: four horsemen (war/famine/death), martyrs' cry, Day of the Lord, 144,000 sealed, great multitude",
        "tension": "Who can stand in the Day of the Lord? How is God's people protected?",
        "structure": "Seals 1-4 (horsemen—tragically average human history), Seal 5 (martyrs cry 'How long?'), Seal 6 (Day of Lord—'Who can stand?'), Interlude (144,000 sealed + innumerable multitude), Seal 7 (silence → trumpets)",
        "messiahProfile": "Lamb who guides history; protector of His people through (not from) suffering; wrath of the Lamb against evil",
        "messiahLink": "The Lamb's opening of seals reveals God's sovereignty over history's tragedies and His protection of faithful witnesses through tribulation.",
        "notes": "Hear/see pattern again: Hear 144,000 (military census from 12 tribes, 12,000 each). See innumerable multitude from ALL nations. Army of the Lamb = multi-ethnic people redeemed by His blood who conquer by faithful witness, not violence. Martyrs told to rest—more will die before the end. Protection = seal on forehead (like Ezekiel 9), not exemption from suffering."
      },
      "narrative": {
        "storyPanels": "Panel 1: Four horsemen released (conquest, war, famine, death); Panel 2: Martyrs under altar cry 'How long?'; Panel 3: Cosmic upheaval—Day of the Lord; Panel 4: 'Who can stand?'; Panel 5: Angel seals 144,000 from 12 tribes; Panel 6: Innumerable multitude in white robes; Panel 7: 'These came out of great tribulation'; Panel 8: Lamb shepherds them to living water",
        "pattern": "God's people protected not from suffering but through it—sealed for endurance, not exemption. Victory comes through faithful witness unto death.",
        "messiahLink": "The Lamb's army conquers not by killing enemies but by faithful witness even unto death, following the Lamb's pattern. They wash their robes in the Lamb's blood—paradoxical image of victory through sacrifice.",
        "notes": "Four horsemen from Zechariah 1, 6. White horse ≠ Christ (first seal opened by Lamb). Fifth seal = martyrs' cry echoes Abel, prophets. Sixth seal = Day of Lord from Isaiah, Joel. 144,000 = symbolic (12 × 12 × 1,000) complete people of God, fulfilled as multi-ethnic church."
      },
      "speaker": "Narrator (John) + martyrs + angel",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "First cycle of judgments reveals God's sovereignty over history and the church's mission: faithful witness through suffering, sealed by God.",
      "sermonSection": "6:1–7:17",
      "primaryType": "expository",
      "group": "Seven Seals (Revelation 6–7)"
    },
    "rev-7-9-17-great-multitude": {
      "reference": "Revelation 7:9-17",
      "title": "The Great Multitude: Victors Through the Lamb's Blood",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Innumerable multitude from every nation; Panel 2: White robes and palm branches; Panel 3: Crying 'Salvation belongs to our God!'; Panel 4: Angels and elders worship; Panel 5: Elder asks 'Who are these?'; Panel 6: 'They came out of great tribulation'; Panel 7: 'Washed robes in Lamb's blood'; Panel 8: Lamb shepherds them—no more hunger, thirst, tears",
        "pattern": "The fulfillment of God's promise to Abraham—all nations blessed. Victory through suffering, not avoidance of suffering.",
        "messiahLink": "The Lamb who was slain becomes the Shepherd who leads His redeemed people to living water. His blood cleanses and His presence sustains.",
        "notes": "Paradox: robes made white by washing in blood. Victory imagery (white robes, palms) achieved through defeat (tribulation, death). The Lamb both sacrifices and shepherds."
      },
      "expository": {
        "context": "After 144,000 sealed, John sees the fulfillment: innumerable multitude from all nations standing victorious before God",
        "tension": "How does the sealed 144,000 from Israel become an innumerable international multitude?",
        "structure": "v.9-12 (multitude worships), v.13-14 (identity revealed: tribulation survivors), v.15-17 (eternal reward described)",
        "messiahProfile": "The Lamb who is also Shepherd; the one whose blood cleanses; the one who leads to living water",
        "messiahLink": "Jesus fulfills God's promise to Abraham to bless all nations. The sealed remnant expands to include all peoples through the Lamb's blood.",
        "notes": "This is the same group as the 144,000—seen from different angle. 'Great tribulation' = the suffering all believers face between Jesus' ascension and return. Palm branches = symbol of victory (like triumphal entry). God dwelling with them fulfills temple imagery—fulfilled in chs 21-22."
      },
      "speaker": "Elder + multitude",
      "audience": "God and Lamb",
      "category": "apocalyptic-vision",
      "narrativeContext": "Climax of first cycle shows the church's ultimate victory: not exemption from tribulation but triumph through it via the Lamb's blood.",
      "sermonSection": "7:9-17",
      "primaryType": "narrative",
      "group": "Seven Seals (Revelation 6–7)"
    },
    "rev-8-11-trumpets-witnesses": {
      "reference": "Revelation 8:1–11:19",
      "title": "Seven Trumpets + Two Witnesses: The Lamb's Scroll Opened",
      "types": [
        "expository",
        "narrative",
        "prophetic"
      ],
      "expository": {
        "context": "Seventh seal opens → seven trumpets emerge. Exodus plagues repeated. Open scroll eaten. Two witnesses prophesy, die, resurrected. Seventh trumpet: kingdom comes.",
        "tension": "Will judgment alone bring repentance? How will God's kingdom come?",
        "structure": "8:1-5 (seventh seal, silence, fire from altar), 8:6–9:21 (trumpets 1-6: plagues but no repentance), 10:1-11 (interlude: scroll eaten, prophecy commissioned), 11:1-14 (two witnesses: temple measured, prophecy, death, resurrection, earthquake, repentance), 11:15-19 (seventh trumpet: kingdom announced)",
        "messiahProfile": "Lord whose judgments call nations to repentance; whose witnesses follow the Lamb's pattern of death and resurrection",
        "messiahLink": "Like Exodus plagues, judgment alone doesn't bring repentance (9:20-21). God's kingdom comes through the church's faithful witness—even unto death—which moves nations to repentance (11:13). This is the open scroll's message.",
        "notes": "KEY INSIGHT at book's center: Judgment (seals, trumpets) doesn't produce repentance. But when nations see the church imitating the Lamb's sacrifice—dying and being vindicated—many repent and give glory to God. This is how God's kingdom advances: through the church's faithful witness, not through divine judgment alone."
      },
      "narrative": {
        "storyPanels": "Panel 1: Fire from altar (martyrs' prayers) cast to earth; Panel 2-6: Trumpet plagues echo Exodus; Panel 3: Nations don't repent despite plagues; Panel 4: Angel brings opened scroll; Panel 5: John eats scroll (sweet/bitter); Panel 6: Two witnesses prophesy; Panel 7: Beast kills witnesses; Panel 8: God resurrects witnesses; Panel 9: Nations terrified, repent, give glory to God; Panel 10: Seventh trumpet—'The kingdom of the world has become the kingdom of our Lord'",
        "pattern": "Plagues → no repentance. Martyrdom + resurrection → repentance. God's mercy shown through sacrificial witness accomplishes what judgment alone cannot.",
        "messiahLink": "The church takes up Moses and Elijah's prophetic mantle, calling nations to repent. Their death and resurrection mirror the Lamb's pattern and successfully move nations to worship God.",
        "notes": "Two witnesses = lampstands (symbol of churches). Not literal two future prophets, but the prophetic role of Jesus' followers. Temple measuring = protection through (not from) persecution. Beast from Daniel 7 conquers them, but God vindicates. Earthquake = Day of Lord event. Result: 'The rest... gave glory to the God of heaven' (11:13)."
      },
      "prophetic": {
        "context": "God's kingdom revealed through the church's faithful witness unto death—this is the open scroll's central message.",
        "tension": "Will the church follow the Lamb's path of suffering love? Will nations repent?",
        "structure": "Judgments (trumpets) → open scroll (prophetic mission) → witnesses' death and vindication → nations' repentance → kingdom announced.",
        "messiahProfile": "The Lamb whose pattern the church follows; whose victory comes through death and resurrection; whose kingdom advances through witness",
        "messiahLink": "This is the scroll's message at the book's center: God's kingdom comes when the church imitates the Lamb—not killing enemies, but dying for them. The nations' repentance proves the strategy works.",
        "notes": "Beast appears for first time, conquers witnesses. But God's vindication (resurrection) leads to the desired outcome: repentance. Seventh trumpet announces what the rest of the book will unpack: 'The kingdom of the world has become the kingdom of our Lord and of his Christ.' This is certain, though its full manifestation awaits Christ's return."
      },
      "speaker": "Narrator + heavenly voices + angel + two witnesses",
      "audience": "Seven churches + nations",
      "category": "apocalyptic-vision",
      "narrativeContext": "Second cycle of judgments reveals the church's mission: prophetic witness that leads to suffering, vindication, and the nations' repentance. This is the opened scroll's message at Revelation's center.",
      "sermonSection": "8:1–11:19",
      "primaryType": "expository",
      "group": "Seven Trumpets (Revelation 8–11)"
    },
    "rev-12-woman-dragon-child": {
      "reference": "Revelation 12:1-17",
      "title": "The Cosmic Conflict: Woman, Dragon, and Child",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Woman clothed with sun, pregnant; Panel 2: Great red dragon with seven heads; Panel 3: Dragon waits to devour child; Panel 4: Child born—will rule nations with iron scepter; Panel 5: Child caught up to God's throne; Panel 6: Woman flees to wilderness (1,260 days); Panel 7: War in heaven—Michael vs dragon; Panel 8: Dragon cast to earth; Panel 9: Dragon pursues woman; Panel 10: Woman given eagle's wings, protected; Panel 11: Dragon wages war on her offspring",
        "pattern": "Ancient conflict from Genesis 3 played out on cosmic scale. Messiah's birth, death, resurrection, ascension defeat the dragon. Dragon's response: persecute Messiah's people.",
        "messiahLink": "Jesus (the Child) defeats the dragon through His death and resurrection—He was 'caught up to God and to His throne' (ascension). The dragon, defeated in heaven, now wars against the Messiah's followers on earth.",
        "notes": "Woman = people of God (Israel/church—not Mary individually). Child = Messiah. Dragon = Satan/serpent. Seven heads = fullness of power/kingdoms. War in heaven results from Christ's victory. Dragon 'cast down' = His authority broken but still active on earth for 'a short time.'"
      },
      "expository": {
        "context": "Sign visions begin—revealing the spiritual reality behind the churches' persecution under Rome",
        "tension": "Why are God's people suffering? Who is the real enemy?",
        "structure": "v.1-2 (woman in labor), v.3-4 (dragon threatens), v.5-6 (child born, ascends, woman protected), v.7-12 (war in heaven, dragon cast down), v.13-17 (dragon pursues woman and offspring)",
        "messiahProfile": "Child who will rule nations; the one whose birth, death, and resurrection cast down the accuser",
        "messiahLink": "Jesus' victory on the cross defeated the dragon in the heavenly realm. Now the dragon wars against Jesus' followers on earth—but they conquer by the Lamb's blood and their faithful testimony, not loving their lives unto death (12:11).",
        "notes": "This is the ancient conflict from Genesis 3:15—serpent vs seed. Jesus (seed of woman) crushes serpent's head through cross. Dragon's defeat in heaven means increased (but limited) activity on earth. 1,260 days = 3.5 years = symbolic period of persecution between Jesus' ascension and return. Woman protected in wilderness echoes Israel's Exodus experience."
      },
      "speaker": "Narrator + loud voice in heaven",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Sign visions reveal the spiritual battle behind earthly persecution—Satan wars against the church because he lost the heavenly battle when Christ died and rose.",
      "sermonSection": "12:1-17",
      "primaryType": "narrative",
      "group": "Seven Signs (Revelation 12–14)"
    },
    "rev-12-11-how-they-conquered": {
      "reference": "Revelation 12:11",
      "title": "How They Conquered: Blood, Testimony, Self-Sacrifice",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "After dragon cast from heaven, voice announces how believers conquer him",
        "tension": "How can weak, persecuted Christians defeat the powerful dragon?",
        "structure": "Three-part formula: (1) blood of the Lamb, (2) word of their testimony, (3) not loving life unto death",
        "messiahProfile": "Slain Lamb whose blood provides victory over the accuser",
        "messiahLink": "Jesus conquered through sacrificial death. His followers conquer the same way: trusting His blood, bearing witness, willing to die rather than deny Him.",
        "notes": "This verse is the key to understanding the entire book. Victory over evil comes through: (1) Christ's finished work (not our effort), (2) faithful testimony (witness even under persecution), (3) martyrdom if necessary (not self-preservation). This is how the Lamb's army 'conquers.'"
      },
      "prophetic": {
        "context": "Call to the churches: this is how you will overcome the dragon's accusations and persecution",
        "tension": "Will we conquer through the world's methods (violence, compromise) or the Lamb's method (sacrifice)?",
        "structure": "Three elements of victory that mirror the Lamb's own victory pattern",
        "messiahProfile": "The Lamb whose blood speaks better than Abel's; whose testimony was faithful unto death",
        "messiahLink": "The church's victory is derivative—it comes from trusting and imitating the Lamb. His blood cleanses from accusation. His example of faithful witness unto death is the pattern for conquering.",
        "notes": "Extremely practical: (1) Trust Christ's atonement, not your righteousness. (2) Don't hide your faith—bear witness publicly. (3) Value Christ more than life itself. This is opposite of Roman imperial ideology: conquer through violence and self-assertion."
      },
      "speaker": "Loud voice in heaven",
      "audience": "Seven churches + all believers",
      "category": "prophetic-instruction",
      "narrativeContext": "Central verse explaining how the church conquers in spiritual warfare—through faith in Christ's blood, faithful testimony, and willingness to die.",
      "sermonSection": "12:11",
      "primaryType": "prophetic",
      "group": "Seven Signs (Revelation 12–14)"
    },
    "rev-13-beasts-666": {
      "reference": "Revelation 13:1-18",
      "title": "Two Beasts + 666: Empire's Power and Propaganda",
      "types": [
        "expository",
        "narrative"
      ],
      "expository": {
        "context": "Two beasts empowered by dragon: one from sea (political/military power), one from earth (religious/economic propaganda)",
        "tension": "How do empires seduce and coerce allegiance? What is the mark of the beast?",
        "structure": "v.1-10 (first beast: military/political power, demands worship, wars on saints), v.11-18 (second beast: propaganda/economics, enforces worship, gives mark 666)",
        "messiahProfile": "By contrast, the Lamb conquers through sacrifice, not coercion; through truth, not propaganda",
        "messiahLink": "The beasts parody the Trinity: dragon (anti-Father), sea beast (anti-Christ with mortal wound healed), earth beast (anti-Spirit performing signs). But they conquer through violence and deception—opposite of the Lamb's way.",
        "notes": "First beast = political/military power (Rome in John's day, any similar empire in history). Receives dragon's authority. Has mortal wound healed (parody of Christ's resurrection). Wars on saints and conquers them. Second beast = religious/economic propaganda that gives credibility to first beast. Mark of beast = allegiance to imperial system, needed for economic participation. 666 = Nero Caesar in Hebrew gematria, also 'beast' in Hebrew. But not just Nero—pattern for any beastly empire."
      },
      "narrative": {
        "storyPanels": "Panel 1: Beast rises from sea—10 horns, 7 heads, blasphemous names; Panel 2: Dragon gives beast his power; Panel 3: Mortal wound healed—world marvels; Panel 4: Beast given authority 42 months; Panel 5: Beast wars on saints, conquers them; Panel 6: Second beast from earth; Panel 7: Performs signs, gives image of first beast breath; Panel 8: Forces all to receive mark: 666",
        "pattern": "Empire seduces through propaganda and coerces through economics. Those without the mark cannot buy or sell. Choice: worship beast or remain faithful to Lamb?",
        "messiahLink": "The Lamb's followers will face economic pressure and violent persecution. Their 'defeat' (saints conquered by beast, 13:7) is actually their victory—through faithful witness unto death.",
        "notes": "42 months = 1,260 days = 3.5 years (same as 12:6, 14). Symbolic period of persecution. Beast from sea = Daniel 7 imagery (empires as beasts). Ten horns = fullness of power. Seven heads = seven kingdoms/emperors. Wound healed may refer to Nero redivivus myth. Second beast = false prophet (later named explicitly). Mark on forehead/hand = anti-Shema (Deut 6:8—true allegiance to God on forehead/hand)."
      },
      "speaker": "Narrator (John)",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Sign visions reveal how empires demand total allegiance through propaganda and economic control—churches must resist the mark even at cost of persecution.",
      "sermonSection": "13:1-18",
      "primaryType": "expository",
      "group": "Seven Signs (Revelation 12–14)"
    },
    "rev-14-1-5-144000-with-lamb": {
      "reference": "Revelation 14:1-5",
      "title": "The 144,000 With the Lamb: Sealed Saints Standing Victorious",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Lamb standing on Mount Zion; Panel 2: 144,000 with Him, Father's name on foreheads; Panel 3: Sound from heaven like waterfalls; Panel 4: New song before throne; Panel 5: No one can learn song except the 144,000; Panel 6: Description: pure, blameless, follow the Lamb, firstfruits",
        "pattern": "Contrast with chapter 13: beast's followers marked 666, Lamb's followers sealed with God's name. Beast conquers through violence; Lamb conquers through purity and faithful following.",
        "messiahLink": "The Lamb's followers bear His Father's name (not the beast's number), sing a new song of redemption, and follow Him wherever He goes—even to death.",
        "notes": "This is the same 144,000 from chapter 7—the complete people of God, sealed and protected through tribulation. Now they're standing victorious with the Lamb on Mount Zion (heavenly Jerusalem). They have God's name on foreheads (vs beast's mark on foreheads). 'Virgins' = not defiled with false worship (spiritual adultery with beast/Babylon). 'Follow the Lamb wherever he goes' = including to death."
      },
      "expository": {
        "context": "After vision of beasts demanding allegiance, John sees the Lamb's followers standing victorious",
        "tension": "How do the defeated saints end up victorious with the Lamb?",
        "structure": "v.1 (Lamb and 144,000 on Zion), v.2-3 (new song), v.4-5 (character of the redeemed)",
        "messiahProfile": "The Lamb who leads His followers; the one whose followers bear His Father's name; the one worth following to death",
        "messiahLink": "The 144,000 conquered by following the Lamb's pattern: purity over compromise, truth over lies, faithfulness unto death. Their 'defeat' by the beast resulted in victory with the Lamb.",
        "notes": "Mount Zion = heavenly Jerusalem (Hebrews 12:22). Song of redemption = song only the redeemed can sing (experiential knowledge). 'Firstfruits' = initial harvest representing the full harvest to come. 'No lie in their mouth' = refused the beast's propaganda, spoke truth. 'Blameless' = not sinless, but faithful witnesses whose robes were washed in Lamb's blood (7:14)."
      },
      "speaker": "Narrator + heavenly voices",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Encouragement to persecuted churches: those who resist the beast and remain faithful to the Lamb will stand victorious with Him in the end.",
      "sermonSection": "14:1-5",
      "primaryType": "narrative",
      "group": "Seven Signs (Revelation 12–14)"
    },
    "rev-14-6-13-eternal-gospel": {
      "reference": "Revelation 14:6-13",
      "title": "The Eternal Gospel: Call to Worship God and Come Out of Babylon",
      "types": [
        "prophetic",
        "expository"
      ],
      "prophetic": {
        "context": "Three angels proclaim messages to all nations: eternal gospel, Babylon's fall, warning against beast worship",
        "tension": "What is the church's message to the nations during tribulation? Is there hope for Babylon's inhabitants?",
        "structure": "v.6-7 (first angel: eternal gospel—fear God), v.8 (second angel: Babylon has fallen), v.9-12 (third angel: warning against beast worship), v.13 (blessing on those who die in the Lord)",
        "messiahProfile": "Creator God who deserves worship; Judge who will hold empires accountable; Savior calling nations to repent before judgment",
        "messiahLink": "The Lamb's gospel goes out to all nations—opportunity to worship the Creator and reject the beast. Those who respond are blessed; those who refuse will drink the wine of God's wrath.",
        "notes": "Eternal gospel = the good news is not just 'believe in Jesus' but 'worship the Creator, not the creature' (Romans 1). This is call to repent of idolatry. 'Fear God and give him glory' = proper response to Creator. 'Babylon has fallen' announced before chapters 17-18 detail it—prophetic certainty. Third angel's warning: tormented forever = vivid apocalyptic imagery for irreversible judgment. Blessed are the dead who die in the Lord = martyrdom is not defeat but entrance into rest."
      },
      "expository": {
        "context": "Three angelic proclamations frame the choice facing humanity: worship God or the beast",
        "tension": "Will the nations hear the gospel and repent before final judgment?",
        "structure": "Gospel announced → Babylon's fall announced → Warning given → Blessing pronounced",
        "messiahProfile": "Lord of heaven and earth who created all things and deserves exclusive worship",
        "messiahLink": "Jesus is both the content and proclaimer of the eternal gospel—through His followers' witness, the nations hear the call to repent and worship God.",
        "notes": "First angel = mission of the church (proclaim gospel to every nation). Second angel = certainty of Babylon's judgment. Third angel = warning of consequences for beast worship. Blessed dead = martyrs rest from labors; their deeds follow them (vindication). 'Patient endurance of the saints' (v.12) = key theme—faithful witness even under pressure."
      },
      "speaker": "Three angels",
      "audience": "Every nation, tribe, language, people",
      "category": "apocalyptic-proclamation",
      "narrativeContext": "Gospel goes out to all nations even during tribulation—call to repent, reject beast/Babylon, and worship the Creator before final judgment.",
      "sermonSection": "14:6-13",
      "primaryType": "prophetic",
      "group": "Seven Signs (Revelation 12–14)"
    },
    "rev-15-16-seven-bowls": {
      "reference": "Revelation 15–16",
      "title": "Seven Bowls: Exodus Plagues and Armageddon",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Final cycle of seven judgments poured out as bowls; Exodus plagues repeated; nations gathered at Armageddon for final confrontation.",
        "tension": "Will any repent, or will they curse God like Pharaoh? What is Armageddon?",
        "structure": "15:1-8 (preparation: victors sing, temple filled with smoke), 16:1-21 (seven bowls poured: escalating plagues, Armageddon, 'It is done!')",
        "messiahProfile": "Just judge who brings the Day of the Lord to completion; King who will confront rebellious nations at Armageddon",
        "messiahLink": "Jesus will return to bring final justice. Some among nations repented (from Lamb's scroll message in chs 10-11), but many resist and curse God like Pharaoh, leading to ultimate confrontation.",
        "notes": "Third and final cycle of judgments. Bowls = complete/undiluted wrath (no more opportunity for repentance). Many nations don't repent despite plagues (16:9, 11, 21)—they curse God like Pharaoh. Bowl 6: Armageddon = Har-Megiddo, plain in northern Israel where many OT battles fought (Judges 5, 2 Kings 23). Symbol from Ezekiel 38-39 (Gog gathering) = rebellious nations facing God's justice. Not necessarily literal future battle location—apocalyptic symbol for final confrontation."
      },
      "prophetic": {
        "context": "Final warning: Day of the Lord approaches when evil will be defeated forever. Blessing for those who watch and keep their garments.",
        "tension": "Pharaoh-like hardness vs repentance; Lamb's way vs beast's way. Christ comes as thief—be ready!",
        "structure": "Bowls 1-5 (plagues intensify), Bowl 6 (Armageddon gathering + blessing), Bowl 7 ('It is done!' + greatest earthquake)",
        "messiahProfile": "Coming King who will judge the earth; thief in the night whom only the watchful will be ready for",
        "messiahLink": "The seventh bowl depicts the fourth and final Day of the Lord when evil is defeated once and for all. 'It is done' echoes Jesus' 'It is finished'—God's purposes will be accomplished.",
        "notes": "Victors in 15:2-4 sing song of Moses and the Lamb—Exodus redemption fulfilled. Temple filled with smoke (Isaiah 6) = God's glory prevents access until judgments complete. Some see Armageddon as literal future battle; others as metaphor for God's final justice. Either way, it's drawn from Ezekiel 38-39 and depicts rebellious nations facing God. 'Blessed is the one who stays awake' (16:15) = call to watchfulness. Greatest earthquake ever = cosmic upheaval of Day of Lord."
      },
      "speaker": "Voice from temple + angels",
      "audience": "Seven churches + nations",
      "category": "apocalyptic-vision",
      "narrativeContext": "Third judgment cycle warns of coming final justice. Plagues repeat Exodus pattern. Nations harden like Pharaoh. Armageddon gathering sets up final battle in chs 19-20.",
      "sermonSection": "15:1–16:21",
      "primaryType": "prophetic",
      "group": "Seven Bowls (Revelation 15–16)"
    },
    "rev-17-18-fall-babylon": {
      "reference": "Revelation 17–18",
      "title": "The Fall of Babylon: Judgment on the Prostitute Empire",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Vision of Babylon the prostitute riding the beast; she's drunk with martyrs' blood; her fall announced and lamented.",
        "tension": "Will God's people come out of Babylon, or be seduced by her wealth and power? How do empires seduce?",
        "structure": "17:1-18 (prostitute on beast revealed: drunk with blood, riding seven-headed beast, will be destroyed), 18:1-24 (Babylon's fall: merchants lament, heaven rejoices, blood of saints avenged)",
        "messiahProfile": "Judge who brings justice for the blood of prophets and saints; Lamb who wars against Babylon with His called, chosen, faithful followers",
        "messiahLink": "Jesus will return to replace Babylon with His kingdom. The prostitute's fall vindicates the martyrs whose blood cried out. The Lamb conquers those who worship the beast.",
        "notes": "Babylon = Rome in John's day (seven hills, 17:9), but also archetypal pattern throughout history. John blends OT passages about fall of ancient Babylon, Tyre, and Edom. Any nation exalting military/economic power as god becomes Babylon. Prostitute = spiritual adultery (covenant unfaithfulness). Drunk with saints' blood = persecutes God's people. Rides beast = empires dependent on military/political power. Seven heads = seven kings/kingdoms (17:10). Merchants lament = economic system built on exploitation collapses."
      },
      "prophetic": {
        "context": "Warning to every generation: Babylons will come and go until Jesus returns to establish His kingdom. Come out of her!",
        "tension": "Babylons seduce with wealth and security; churches must resist and remain faithful to the Lamb. Cultural accommodation vs faithful witness.",
        "structure": "Prostitute revealed (ch 17) → fall announced (18:1-3) → call to come out (18:4-8) → lament (18:9-19) → celebration (18:20-24).",
        "messiahProfile": "Coming King whose kingdom will replace every Babylon; Judge who holds empires accountable for violence and injustice",
        "messiahLink": "The Lamb's followers must resist Babylon's seduction and remain faithful, knowing Jesus will bring justice and establish His eternal kingdom. 'Come out of her, my people' = call to cultural non-conformity.",
        "notes": "Not limited to past (Rome) or future (end times)—portrait of human condition throughout history. Nations exalt their own power/wealth as god, demand allegiance, persecute dissenters, and face inevitable fall. Seven last plagues will come in one day (18:8). Double her doom = lex talionis (measure for measure). Millstone cast into sea = Babylon will never rise again (18:21). Her fall avenges blood of apostles, prophets, all slain on earth (18:24). Churches must resist her seduction while awaiting her fall."
      },
      "speaker": "Angel + voice from heaven + kings/merchants/mariners",
      "audience": "Seven churches + nations",
      "category": "apocalyptic-vision",
      "narrativeContext": "Expanded vision of Babylon's fall warns churches to resist cultural seduction and await the Lamb's vindication. History's pattern: empires rise, demand worship, persecute saints, and fall.",
      "sermonSection": "17:1–18:24",
      "primaryType": "prophetic",
      "group": "Fall of Babylon (Revelation 17–18)"
    },
    "rev-19-20-final-battle": {
      "reference": "Revelation 19:11–20:15",
      "title": "The Final Battle: Rider on White Horse + Defeat of Dragon",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Heaven opens; Panel 2: Rider on white horse appears (Faithful and True, eyes like fire); Panel 3: Name: Word of God, King of kings; Panel 4: Covered in blood BEFORE battle; Panel 5: Sword from His mouth; Panel 6: Beast and false prophet thrown into lake of fire; Panel 7: Dragon bound 1,000 years; Panel 8: Martyrs resurrected, reign with Christ; Panel 9: Dragon released, gathers nations; Panel 10: Fire from heaven devours enemies; Panel 11: Dragon thrown into lake of fire; Panel 12: Great white throne—dead judged; Panel 13: Death and Hades thrown into lake of fire",
        "pattern": "Jesus conquers not through bloodbath but through word of justice. Martyrs vindicated. Evil eternally quarantined from new creation.",
        "messiahLink": "Jesus the Word of God comes covered in His own blood (the cross). He defeats evil through proclamation of justice, vindicates martyrs, and eternally removes evil from creation. His method remains consistent: He conquered through the cross, now He conquers through the word.",
        "notes": "Critical: Jesus covered in blood BEFORE battle = His own blood from the cross, not enemies' blood. Sword from mouth = word of justice (Isaiah 11:4, 49:2). Not a literal bloodbath but Christ's authoritative judgment. Birds invited to feast = Ezekiel 39 imagery (Gog). Two battles: (1) beast/false prophet defeated (19:11-21), (2) dragon/nations defeated (20:7-10). Both depict same final judgment from different angles."
      },
      "expository": {
        "context": "Day of the Lord depicted as final battle; martyrs vindicated; dragon and all evil defeated forever.",
        "tension": "How will final battle unfold? What happens to evil? What about the 1,000 years?",
        "structure": "19:11-21 (rider on white horse defeats beast), 20:1-6 (dragon bound, martyrs reign 1,000 years), 20:7-10 (dragon released, gathers nations, defeated forever), 20:11-15 (great white throne: final judgment, Death/Hades defeated)",
        "messiahProfile": "Faithful and True, Word of God, King of kings and Lord of lords; righteous judge who holds evil accountable and vindicates the faithful",
        "messiahLink": "The slain Lamb returns as conquering King, but His method remains consistent: He shed His blood for enemies at the cross, now He proclaims justice. Those who refused repentance face consequences. Martyrs vindicated—their faithful witness was not in vain.",
        "notes": "1,000 years debated: (1) Premillennialism: Literal future millennium after Jesus' return, then final judgment. (2) Amillennialism: Symbolic of present victory over spiritual evil between Christ's ascension and return; two battles depict Jesus' future return from two angles. Either way, main point: Jesus will deal with evil forever and vindicate the faithful. Dragon bound = Satan's authority broken (already), released = final rebellion before end (future). Lake of fire = second death, eternal quarantine from God's presence."
      },
      "speaker": "Narrator + heavenly voices",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Climactic vision of Jesus' return, final judgment, and eternal removal of evil from creation. The martyrs' faithful witness is vindicated. Evil is quarantined forever.",
      "sermonSection": "19:11–20:15",
      "primaryType": "narrative",
      "group": "The Final Battle (Revelation 19–20)"
    },
    "rev-20-1-6-thousand-years": {
      "reference": "Revelation 20:1-6",
      "title": "The Thousand Years: Martyrs Vindicated and Reigning",
      "types": [
        "expository",
        "narrative"
      ],
      "expository": {
        "context": "After beast's defeat, dragon bound for 1,000 years; martyrs resurrected and reign with Christ.",
        "tension": "What is the millennium? When does it occur? Who participates?",
        "structure": "v.1-3 (dragon bound 1,000 years), v.4-6 (martyrs resurrected, reign with Christ, first resurrection, blessed and holy)",
        "messiahProfile": "Victorious King who reigns with His martyrs; one who vindicates those who remained faithful unto death",
        "messiahLink": "Jesus shares His reign with those who suffered for His name. Their 'defeat' by the beast resulted in vindication and co-regency with Christ.",
        "notes": "Millennium = most debated passage in Revelation. Interpretations: (1) Premillennial: Future literal 1,000-year reign after Christ's return. (2) Amillennial: Symbolic of Christ's present reign from ascension to return; martyrs reign spiritually with Christ now. (3) Postmillennial: Gospel gradually brings 'millennium' before Christ returns. 'First resurrection' = martyrs brought to life to reign with Christ. 'Second death' has no power over them = eternal security. Thrones = co-regency with Christ (promised in 3:21). Who reigns? Those who were beheaded for testimony of Jesus and didn't worship beast or receive mark."
      },
      "narrative": {
        "storyPanels": "Panel 1: Angel binds dragon with great chain; Panel 2: Dragon thrown into abyss, sealed; Panel 3: Thrones—martyrs sitting on them; Panel 4: Beheaded for testimony come to life; Panel 5: They reign with Christ 1,000 years; Panel 6: Rest of dead not resurrected until 1,000 years end; Panel 7: Blessed are those in first resurrection",
        "pattern": "Martyrs' vindication—those who 'lost' by dying for Jesus actually 'won' and now reign with Him. First resurrection = their special honor.",
        "messiahLink": "Jesus shares His throne with those who followed His path of faithful witness unto death. They are 'priests of God and of Christ' and reign with Him.",
        "notes": "Dragon bound so he can't deceive nations—gospel can go out freely. After 1,000 years, released for 'short time' (final rebellion). Abyss = place of confinement. Beheaded = specific mention of martyrdom. Didn't worship beast/receive mark = faithful witnesses who resisted imperial cult. Priests of God and Christ = fulfilled destiny from 1:6, 5:10. Reign where? Over what? Specifics not given—focus is on vindication and honor."
      },
      "speaker": "Narrator (John)",
      "audience": "Seven churches, especially martyrs",
      "category": "apocalyptic-vision",
      "narrativeContext": "Encouragement to persecuted churches: faithfulness unto death results in vindication, honor, and co-regency with Christ. The martyrs' 'defeat' is actually their greatest victory.",
      "sermonSection": "20:1-6",
      "primaryType": "expository",
      "group": "The Final Battle (Revelation 19–20)"
    },
    "rev-21-22-new-creation": {
      "reference": "Revelation 21:1–22:5",
      "title": "New Creation: The Marriage of Heaven and Earth",
      "types": [
        "expository",
        "narrative",
        "prophetic"
      ],
      "narrative": {
        "storyPanels": "Panel 1: New heavens and new earth—first things passed away; Panel 2: New Jerusalem descends as bride adorned; Panel 3: 'Behold, God's dwelling is with man'; Panel 4: God will dwell with them; Panel 5: He will wipe every tear; Panel 6: No more death, mourning, crying, pain; Panel 7: 'I am making all things new'; Panel 8: River of life flowing from throne; Panel 9: Tree of life on both sides, twelve kinds of fruit; Panel 10: No more curse; Panel 11: God's servants worship and reign forever",
        "pattern": "Not just return to Eden but step forward to new Jerusalem—human cultures in peace and harmony, God's presence permeating everything. Creation healed, humanity's calling fulfilled.",
        "messiahLink": "The Lamb's people fulfill humanity's original calling: to rule as God's image, partnering with God in taking creation into new and uncharted territory. The Lamb and God's throne is central—their presence makes temple unnecessary.",
        "notes": "Kaleidoscope of OT promises fulfilled: new creation (Isaiah 65-66), new Eden (Genesis 2), new Jerusalem (Isaiah 60-62), marriage of God and people (Hosea, Isaiah). No temple—God and Lamb's presence everywhere. Nations bring their glory into the city (Isaiah 60). Tree of life restored (Genesis 3). River of life (Ezekiel 47). No more curse (Zechariah 14). God's servants reign forever (Daniel 7:27)."
      },
      "expository": {
        "context": "Final vision of God's eternal kingdom: new creation, new city, new humanity fulfilling original calling.",
        "tension": "What will God's eternal kingdom look like? What happens to God's people? What about the nations?",
        "structure": "21:1-8 (all things new—God dwells with humanity), 21:9-27 (new Jerusalem described—bride city), 22:1-5 (river and tree of life, no more curse, eternal reign)",
        "messiahProfile": "The Lamb whose throne is the source of life; whose presence fills all creation; whose people reign with Him forever; the Lamb who is the temple and the light",
        "messiahLink": "Jesus and the Father together dwell with humanity—God's ultimate purpose from Genesis 1. The Lamb's sacrifice has opened eternal life with God. His people fulfill their calling to rule and serve in God's presence forever.",
        "notes": "This is what conquerors inherit (rewards from chs 2-3 all present here). God makes His dwelling (tabernacle) with humanity—Exodus 25:8 fulfilled. No more sea = chaos defeated. Healing of creation—no more curse, pain, death. New humanity partnering with God in ongoing creative work. City's dimensions = perfect cube like Holy of Holies (1 Kings 6:20)—entire city is God's dwelling place. Twelve gates = twelve tribes; twelve foundations = twelve apostles. Nations walk by its light (21:24). Kings bring their glory (21:24). Gates never shut (21:25). Nothing unclean enters (21:27). Tree of life for healing of nations (22:2). No more night—God is the light (22:5)."
      },
      "prophetic": {
        "context": "God's ultimate promise and hope for His people: eternal life in restored creation with Him. This vision should motivate faithfulness.",
        "tension": "This vision motivates faithfulness in every generation until the King returns. Is this escapism or grounded hope?",
        "structure": "New creation → new city → no temple → river and tree of life → eternal day → eternal reign.",
        "messiahProfile": "Alpha and Omega who makes all things new; Lamb who is the temple and the light; God whose face we will see",
        "messiahLink": "The entire biblical story culminates here: God dwelling with humanity in restored creation, evil eternally removed, life and peace forever. This is the goal toward which all history moves.",
        "notes": "Not escapism but hope that grounds present faithfulness. Jesus will return to remove evil and make all things new. This promise motivates resistance to Babylon and faithfulness to the Lamb. The vision is meant to encourage suffering churches: your current tribulation is temporary; your eternal glory is certain. 'No longer will there be anything accursed' (22:3) = curse from Genesis 3 finally reversed. 'His servants will worship him. They will see his face' (22:3-4) = intimate, eternal relationship with God—what humanity was made for."
      },
      "speaker": "God + narrator + angel",
      "audience": "Seven churches + all generations",
      "category": "apocalyptic-vision",
      "narrativeContext": "Grand finale of Bible's epic storyline: God's kingdom fully realized, heaven and earth united, humanity's calling fulfilled, all things made new.",
      "sermonSection": "21:1–22:5",
      "primaryType": "expository",
      "group": "New Creation (Revelation 21–22)"
    },
    "rev-22-6-21-epilogue": {
      "reference": "Revelation 22:6-21",
      "title": "Epilogue: Blessing, Warning, and 'Come, Lord Jesus!'",
      "types": [
        "prophetic",
        "expository"
      ],
      "prophetic": {
        "context": "Book concludes with blessing, warning, and urgent expectation of Christ's return",
        "tension": "Jesus is coming soon—how should we respond? What's at stake?",
        "structure": "v.6-9 (trustworthy words, blessing on keepers), v.10-15 (don't seal the scroll, warning to heed), v.16-17 (Jesus testifies, invitation to come), v.18-19 (warning against adding/removing), v.20-21 (promise: 'I am coming soon' + prayer: 'Come, Lord Jesus' + grace)",
        "messiahProfile": "Root and Offspring of David, bright Morning Star, one who is coming soon, Alpha and Omega",
        "messiahLink": "Jesus promises to return soon and calls His people to readiness. The church's response: 'Come, Lord Jesus!' This expectant longing should characterize every generation.",
        "notes": "Mirror image of opening (1:1-8): blessed are those who keep these words (22:7 echoes 1:3). Don't seal the scroll (22:10) because the time is near—contrast Daniel who was told to seal. Outside the city: dogs, sorcerers, sexually immoral, murderers, idolaters, everyone who loves and practices falsehood (22:15)—those who chose beast over Lamb. Warning against tampering (22:18-19) emphasizes book's authority. Three times Jesus says 'I am coming soon' (22:7, 12, 20). Church responds 'Amen. Come, Lord Jesus!' (22:20)."
      },
      "expository": {
        "context": "Concluding words emphasize the book's trustworthiness, urgency, and the church's expectant hope",
        "tension": "How should we live between Christ's first and second coming?",
        "structure": "Verification of vision → blessing and warning → invitation → final warnings → promise and prayer → benediction",
        "messiahProfile": "Coming King who brings reward; one who is First and Last, Beginning and End, Alpha and Omega; bright Morning Star",
        "messiahLink": "Jesus testifies to the churches and invites all who are thirsty to come and take the water of life freely. His promise 'I am coming soon' is the church's hope.",
        "notes": "Angel refuses worship (22:8-9)—worship God only. Time is near = urgency, not delay. 'Let the evildoer still do evil' (22:11) = time for repentance is now; at Christ's return, destinies are fixed. 'I am the Root and Offspring of David' (22:16) = Jesus fulfills Davidic promise. 'Bright Morning Star' (22:16) = Messianic title from Numbers 24:17. 'The Spirit and the Bride say, "Come"' (22:17) = church's mission is invitation. 'Let the one who is thirsty come' (22:17) = gospel invitation. Grace of Lord Jesus be with all (22:21) = epistolary closing."
      },
      "speaker": "Angel + Jesus + John + Spirit and Bride",
      "audience": "Seven churches + all who hear",
      "category": "apocalyptic-letter",
      "narrativeContext": "Book concludes by framing the entire vision as trustworthy prophecy meant to encourage faithfulness and expectant longing for Christ's return.",
      "sermonSection": "22:6-21",
      "primaryType": "prophetic",
      "group": "Epilogue (Revelation 22:6-21)"
    }
  },
  "author": "John (either the apostle or a Christian prophet)",
  "historicalContext": "Written to seven churches in Asia Minor (western Turkey) facing persecution under Roman Empire (likely during Emperor Domitian's reign, AD 81-96). Churches struggled with compromise (eating idol meat, sexual immorality in pagan temples), persecution (especially for refusing imperial cult worship), and apathy due to wealth. Nero's past persecution (AD 64-68) and Domitian's present persecution created climate of fear. Roman imperial cult demanded worship of emperor as divine—refusing meant economic exclusion and potential execution.",
  "relationship": "Climax of biblical prophecy; draws heavily from Daniel, Ezekiel, Isaiah, Exodus, Zechariah, Psalms. Brings OT prophetic themes to fulfillment. Over 500 OT allusions—expects readers to look up references to understand symbols.",
  "keyThemes": [
    "The slain Lamb conquers through sacrificial love—this is the key to the entire book",
    "Faithful witness (martyrdom) over violent conquest—how the church 'conquers'",
    "Symbolic imagery and numbers (not secret predictive code for end times)",
    "Beast/Babylon vs Lamb/New Jerusalem—two competing kingdoms",
    "God's sovereignty over history—the Lamb opens the scroll and guides history to its conclusion",
    "Final justice and new creation—God will remove evil and make all things new",
    "Call to resist cultural compromise and remain faithful—relevant to every generation",
    "History's pattern: all human kingdoms become Babylon and must be resisted",
    "God's promise: Jesus will return to remove evil and make all things new",
    "A symbolic vision for EVERY generation of the church, not just first century or end times"
  ],
  "characterArcs": [
    "The Lamb: From slain sacrifice (ch 5) to conquering King (ch 19) to eternal presence (chs 21-22)—but method remains consistent: conquers through love, not violence",
    "The 144,000/Great multitude: From sealed servants (ch 7) to conquering witnesses (chs 11-12) to victorious worshipers (ch 14) to reigning co-rulers (chs 20-22)",
    "The Dragon: From accuser in heaven (ch 12) to defeated enemy on earth (ch 20) to eternally quarantined in lake of fire (ch 20)",
    "Babylon: From seductive prostitute (ch 17) to fallen empire (ch 18) to destroyed forever (ch 19)",
    "The Seven Churches: From compromise/persecution (chs 2-3) to faithful witness through tribulation (chs 6-14) to bride of the Lamb (chs 19, 21-22)"
  ],
  "sermonPatterns": [
    "Hear/See pattern: Hear military language (Lion, 144,000), see sacrificial reality (Lamb, great multitude)—this is THE key to interpreting the book",
    "Three cycles of seven judgments: Seals, trumpets, bowls—each depicts same period (Jesus' resurrection to return) from different angles, like nesting dolls",
    "Sign visions (chs 12-14): Reveal spiritual reality behind earthly persecution—dragon wars against church because he lost heavenly battle at the cross",
    "Contrasts: Beast vs Lamb, Babylon vs New Jerusalem, mark of beast (666) vs seal of God, prostitute vs bride, first death vs second death",
    "OT fulfillment: Constant allusions expecting readers to look up references—Exodus, Daniel, Ezekiel, Isaiah, Zechariah are primary sources",
    "Central message (chs 10-11): God's kingdom comes through the church's faithful witness (imitating the Lamb) which moves nations to repentance—not through violence or judgment alone"
  ],
  "keyObservations": [
    "Revelation is apocalyptic prophecy sent as a circular letter—NOT a secret code for predicting the end times or future events",
    "Seven = symbol of completeness based on Sabbath cycle; woven throughout the book's structure (7 churches, 7 seals, 7 trumpets, 7 bowls, 7 signs)",
    "The book addresses first-century churches facing Nero's past persecution and Domitian's present persecution—must be anchored in historical context first",
    "Central message at book's center (chs 10-11): God's kingdom comes through the church's faithful witness (imitating the Lamb) which moves nations to repentance—not through violence",
    "Babylon represents any nation that exalts its own power and wealth as god (Rome in John's day, but an ongoing pattern throughout history)",
    "The 1,000 years is debated but not the main point—the main point is Jesus will deal with evil forever and vindicate the faithful",
    "New creation is not escapism but hope that grounds present faithfulness to resist Babylon and follow the Lamb",
    "The book is a symbolic vision for EVERY generation—not just first century or future end times, but the church's calling throughout history",
    "Judgment alone doesn't bring repentance (like Pharaoh)—but the church's faithful witness unto death does move nations to repent (11:13)",
    "666 = Nero Caesar in Hebrew gematria, also 'beast'—represents the pattern of beastly empires demanding total allegiance, not a future individual",
    "Mark of beast = anti-Shema (Deut 6)—allegiance to empire vs allegiance to God. Economic pressure to conform (can't buy/sell without mark).",
    "Armageddon = Har-Megiddo, site of OT battles; symbol from Ezekiel 38-39 (Gog) for rebellious nations facing God's justice",
    "Two witnesses (ch 11) = the church's prophetic mission (lampstands = churches), not two literal future prophets",
    "Jesus covered in blood BEFORE final battle (19:13) = His own blood from the cross, not enemies'. He conquers through the word (sword from mouth), not violence.",
    "The three angels' messages (14:6-12): eternal gospel to all nations, Babylon's fall, warning against beast worship—the church's missionary message"
  ],
  "applicationForSpeechBuilder": "Use Revelation to build speeches that emphasize faithful witness over cultural compromise, the Lamb's pattern of conquering through sacrifice, hope in Jesus' return and final justice, and the call to resist 'Babylon' in every generation. Many passages naturally map to expository (explaining symbols with OT background), narrative (retelling visions with story panels), and prophetic (applying to present context) patterns. Always ground symbolic imagery in OT texts John alludes to (especially Daniel, Ezekiel, Isaiah, Exodus, Zechariah), and connect to the book's central message: the slain Lamb conquers through love and will return to make all things new. The hear/see pattern is crucial: what John hears uses military conquest language, but what he sees reveals the reality of sacrificial love. This pattern unlocks the book's meaning."
}