{
  "book": "Revelation",
  "testament": "nt",
  "corpus": "Apocalyptic",
  "theme": "Jesus the slain Lamb conquers evil through sacrificial love and will return to make all things new—God's kingdom comes on earth as in heaven.",
  "structure": "1:1-20 Prologue + Vision of Jesus among the lampstands\n2–3 Letters to seven churches (call to faithfulness)\n4–5 Heavenly throne room + slain Lamb opens scroll\n6–7 Seven seals (judgments + sealed 144,000)\n8–11 Seven trumpets + two witnesses (call to witness)\n12–14 Sign visions (dragon, beasts, Lamb's army)\n15–16 Seven bowls (final judgments)\n17–18 Fall of Babylon the prostitute\n19–20 Final battle + 1,000 years + defeat of dragon\n21–22 New creation: marriage of heaven and earth",
  "messiahProfile": "The slain Lamb who conquers through sacrificial love; Lion of Judah who reigns as King of kings; faithful witness who defeats evil and makes all things new",
  "overview": "John's apocalyptic prophecy reveals how Jesus the slain Lamb conquered evil through the cross and will return to establish God's eternal kingdom. Written to seven churches facing persecution and compromise, Revelation uses symbolic imagery from the Old Testament to show that God's kingdom advances through faithful witness—even unto death—not through violence. The book culminates in the defeat of evil (dragon, beasts, Babylon) and the arrival of new creation where heaven and earth are united forever.",
  "passages": {
    "rev-1-vision-of-christ": {
      "reference": "Revelation 1:9-20",
      "title": "Vision of Jesus Among the Lampstands",
      "types": [
        "narrative",
        "expository"
      ],
      "expository": {
        "context": "John exiled on Patmos receives vision of risen, exalted Jesus standing among seven lampstands (the churches)",
        "tension": "How will churches remain faithful amid persecution and compromise?",
        "structure": "v.9-11 (John's situation), v.12-16 (vision of exalted Christ), v.17-20 (commission to write)",
        "messiahProfile": "Exalted King of the world, Son of Man with eyes like fire and voice like rushing waters",
        "messiahLink": "Jesus is the risen Lord who holds the churches in His hand and walks among them—He is present with His suffering people and calls them to faithfulness.",
        "notes": "Seven lampstands = seven churches (from Zechariah). Jesus appears in glory but is intimately present with His people. Sets up the call to 'conquer' through faithfulness."
      },
      "narrative": {
        "storyPanels": "Panel 1: John exiled on Patmos; Panel 2: Vision of majestic Christ; Panel 3: John falls as dead; Panel 4: Jesus' reassurance + commission",
        "pattern": "God reveals His presence and glory to His suffering people, commissioning them to bear witness.",
        "messiahLink": "Jesus the Living One who died and lives forever holds the keys of Death and Hades—His people need not fear.",
        "notes": "Adapted from Daniel 7 and 10. Jesus' appearance terrifies but also comforts."
      },
      "speaker": "Jesus (in vision)",
      "audience": "John",
      "category": "apocalyptic-vision",
      "narrativeContext": "John receives prophetic vision while exiled; Jesus reveals Himself and commissions him to write to the churches.",
      "sermonSection": "1:9-20",
      "primaryType": "expository",
      "group": "Prologue + Vision (Revelation 1)"
    },
    "rev-2-3-seven-churches": {
      "reference": "Revelation 2–3",
      "title": "Letters to the Seven Churches",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Jesus addresses specific churches: Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, Laodicea",
        "tension": "Will churches remain faithful amid wealth, persecution, compromise, and apathy?",
        "structure": "Each letter: address → commendation → rebuke → call to overcome → promise",
        "messiahProfile": "The one who walks among the churches, who knows their works, who calls them to faithful witness",
        "messiahLink": "Jesus calls His people to 'conquer'—not through violence but through faithful witness. Rewards are drawn from the final vision of new creation.",
        "notes": "Some churches are compromised (eating idol meat, sexual immorality in pagan temples). Others face persecution. Jesus warns tribulation is coming—they must choose faithfulness or compromise."
      },
      "prophetic": {
        "context": "Jesus warns of coming tribulation and promises victory to those who conquer.",
        "tension": "Churches face temptation to deny Jesus to avoid persecution or join the spirit of Rome.",
        "structure": "Seven letters forming complete picture of church challenges: compromise, persecution, apathy, faithfulness.",
        "messiahProfile": "Judge who knows the churches' works; King who promises inheritance to overcomers",
        "messiahLink": "The rewards for conquering are all drawn from chapters 21–22: tree of life, new name, authority to reign, white robes, New Jerusalem.",
        "notes": "Sets up main plot tension: Will Jesus' people endure and inherit new creation? Why is faithfulness called 'conquering'? Rest of book answers this."
      },
      "speaker": "Jesus",
      "audience": "Seven churches in Asia Minor",
      "category": "prophetic-letter",
      "narrativeContext": "Jesus addresses churches facing persecution (Nero's past, Domitian's present) and cultural compromise.",
      "sermonSection": "2:1–3:22",
      "primaryType": "prophetic",
      "group": "Seven Churches (Revelation 2–3)"
    },
    "rev-4-5-throne-lamb": {
      "reference": "Revelation 4–5",
      "title": "Heavenly Throne + Slain Lamb Opens Scroll",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Throne room—creatures and elders worship Creator; Panel 2: Sealed scroll—no one can open; Panel 3: John hears: Lion of Judah can open it; Panel 4: John sees: slain Lamb standing alive; Panel 5: Lamb worshipped alongside God; Panel 6: Lamb begins opening scroll",
        "pattern": "Hear/see pattern: Hear military conquest language (Lion), see sacrificial love reality (Lamb). This is the key to the entire book.",
        "messiahLink": "Jesus is the slain Lamb who conquered through His death and resurrection. The cross was not defeat—it was His enthronement, the way He conquered evil.",
        "notes": "Critical symbol: Jesus as slain Lamb. He overcame enemies by dying for them (true Passover Lamb). Resurrection proves His death was victory, not defeat."
      },
      "expository": {
        "context": "Throne room worship; sealed scroll (OT prophecies of God's kingdom); only the slain Lamb can open it.",
        "tension": "How will God's kingdom come on earth? Who can bring it?",
        "structure": "4:1-11 (throne worship), 5:1-5 (sealed scroll, Lion announced), 5:6-14 (Lamb appears, worshipped, opens scroll)",
        "messiahProfile": "Slain Lamb who is worthy to open the scroll; Lion of Judah who conquered through sacrifice; worthy of worship alongside God",
        "messiahLink": "OT promise of victorious Messiah-King was inaugurated through the crucified Messiah. Jesus has divine authority to guide history to its conclusion.",
        "notes": "Scroll = sealed message from OT prophets (esp. Daniel) about God's kingdom. Lamb's worthiness comes from His sacrificial death that redeems people from every nation."
      },
      "speaker": "Heavenly beings",
      "audience": "God and the Lamb",
      "category": "apocalyptic-vision",
      "narrativeContext": "Central vision establishing Jesus' authority and method: conquering through sacrificial love.",
      "sermonSection": "4:1–5:14",
      "primaryType": "narrative",
      "group": "Throne Room (Revelation 4–5)"
    },
    "rev-6-7-seals-144000": {
      "reference": "Revelation 6:1–7:17",
      "title": "Seven Seals + Sealed 144,000",
      "types": [
        "expository",
        "narrative"
      ],
      "expository": {
        "context": "Lamb opens seals: four horsemen (war/famine/death), martyrs' cry, Day of the Lord, 144,000 sealed",
        "tension": "Who can stand in the Day of the Lord? How is God's people protected?",
        "structure": "Seals 1-4 (horsemen), Seal 5 (martyrs), Seal 6 (Day of Lord), Interlude (144,000 sealed + great multitude), Seal 7 (silence → trumpets)",
        "messiahProfile": "Lamb who guides history; protector of His people through suffering",
        "messiahLink": "The Lamb's opening of seals reveals God's sovereignty over history's tragedies and His protection of faithful witnesses.",
        "notes": "Hear/see pattern again: Hear 144,000 (military census, 12 tribes). See great multitude from all nations. Army of the Lamb = multi-ethnic people redeemed by His blood who conquer by faithful witness, not violence."
      },
      "narrative": {
        "storyPanels": "Panel 1: Four horsemen (war, conquest, famine, death); Panel 2: Martyrs cry 'How long?'; Panel 3: Day of the Lord—'Who can stand?'; Panel 4: Angel seals 144,000; Panel 5: Great multitude worships Lamb",
        "pattern": "God's people protected not from suffering but through it—sealed for endurance, not exemption.",
        "messiahLink": "The Lamb's army conquers not by killing enemies but by faithful witness even unto death, following the Lamb's pattern.",
        "notes": "Martyrs told to rest—more will die. Not told why, but won't last forever. 144,000 = symbolic military census (12 tribes × 12,000) fulfilled in multi-ethnic church."
      },
      "speaker": "Narrator (John)",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "First cycle of judgments reveals God's sovereignty and the church's mission: faithful witness through suffering.",
      "sermonSection": "6:1–7:17",
      "primaryType": "expository",
      "group": "Seven Seals (Revelation 6–7)"
    },
    "rev-8-11-trumpets-witnesses": {
      "reference": "Revelation 8:1–11:19",
      "title": "Seven Trumpets + Two Witnesses",
      "types": [
        "expository",
        "narrative",
        "prophetic"
      ],
      "expository": {
        "context": "Seventh seal opens → seven trumpets emerge. Exodus plagues repeated. Two witnesses prophesy, are killed, resurrected.",
        "tension": "Will judgment alone bring repentance? How will God's kingdom come?",
        "structure": "8:1-5 (seventh seal), 8:6–9:21 (trumpets 1-6: plagues), 10:1-11 (interlude: scroll eaten), 11:1-14 (two witnesses), 11:15-19 (seventh trumpet)",
        "messiahProfile": "Lord whose judgments call nations to repentance; whose witnesses follow the Lamb's pattern",
        "messiahLink": "Like Exodus plagues, judgment alone doesn't bring repentance (9:20-21). God's kingdom comes through the church's faithful witness—even unto death—which moves nations to repentance.",
        "notes": "KEY INSIGHT: Judgment (seals, trumpets) doesn't produce repentance. But when nations see the church imitating the Lamb's sacrifice (11:11-13), many repent. This is the message of the opened scroll at the book's center."
      },
      "narrative": {
        "storyPanels": "Panel 1: Fire from altar cast to earth; Panel 2: Trumpet plagues (like Exodus); Panel 3: Nations don't repent; Panel 4: Scroll opened, eaten; Panel 5: Two witnesses prophesy; Panel 6: Beast kills witnesses; Panel 7: God resurrects witnesses; Panel 8: Nations repent and give glory to God",
        "pattern": "Plagues → no repentance. Martyrdom + resurrection → repentance. God's mercy through sacrificial witness accomplishes what judgment alone cannot.",
        "messiahLink": "The church takes up Moses and Elijah's mantle, calling nations to repent. Their death and resurrection mirror the Lamb's pattern and move nations to worship God.",
        "notes": "Two witnesses = lampstands = churches. Not literal two future prophets, but the prophetic role of Jesus' followers. Temple measuring = protection of God's people through (not from) persecution."
      },
      "prophetic": {
        "context": "God's kingdom revealed through the church's faithful witness unto death.",
        "tension": "Will the church follow the Lamb's path of suffering love?",
        "structure": "Judgments (trumpets) → open scroll → witnesses' mission revealed.",
        "messiahProfile": "The Lamb whose pattern the church follows; whose victory comes through death and resurrection",
        "messiahLink": "This is the scroll's message at the book's center: God's kingdom comes when the church imitates the Lamb—not killing enemies, but dying for them.",
        "notes": "Beast from Daniel 7 appears, conquers witnesses, but God vindicates them. Result: nations repent (11:13). This is the surprising claim at Revelation's center."
      },
      "speaker": "Narrator + heavenly voices",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Second cycle of judgments reveals the church's mission: prophetic witness that leads to suffering, vindication, and the nations' repentance.",
      "sermonSection": "8:1–11:19",
      "primaryType": "expository",
      "group": "Seven Trumpets (Revelation 8–11)"
    },
    "rev-12-14-sign-visions": {
      "reference": "Revelation 12–14",
      "title": "Sign Visions: Dragon, Beasts, Lamb's Army",
      "types": [
        "expository",
        "narrative"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Dragon attacks woman and seed; Panel 2: Messiah defeats dragon through death/resurrection; Panel 3: Dragon cast to earth; Panel 4: Two beasts empowered by dragon; Panel 5: Lamb and His 144,000 sing victory; Panel 6: Eternal gospel proclaimed; Panel 7: Two harvests announced",
        "pattern": "Cosmic battle revealed: Dragon (Satan) vs Messiah and His people. Victory through faithful witness, not violence.",
        "messiahLink": "Jesus defeated the dragon through death and resurrection. His followers conquer the dragon by remaining faithful even unto death, just like the Lamb.",
        "notes": "Reveals spiritual reality behind persecution. Real enemy is not Rome but the dragon. Church's weapon: testimony of Jesus + word of witness + willingness to die (12:11)."
      },
      "expository": {
        "context": "Sign visions explore the opened scroll's message: cosmic battle, beastly nations, Lamb's faithful army.",
        "tension": "Will churches resist beast's mark and follow the Lamb, even unto death?",
        "structure": "12:1-17 (dragon vs woman/seed), 13:1-18 (two beasts + mark 666), 14:1-20 (Lamb's army + harvests)",
        "messiahProfile": "Slain Lamb whose followers share His victory through faithful witness; King whose army conquers through suffering",
        "messiahLink": "The Lamb forms a multi-ethnic army who resist the beast's mark (allegiance) and bear witness to God's kingdom, even if it kills them.",
        "notes": "Mark of beast (666) = anti-Shema. Forehead/hand reference to Deut 6—allegiance to God. Beast's mark = allegiance to beastly nations. 666 in Hebrew = 'Nero Caesar' and 'Beast'—not a future code, but a present pattern (any nation exalting its power as god)."
      },
      "speaker": "Narrator",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Sign visions place stark choice before churches: Follow beast (Babylon) or follow Lamb?",
      "sermonSection": "12:1–14:20",
      "primaryType": "expository",
      "group": "Sign Visions (Revelation 12–14)"
    },
    "rev-15-16-seven-bowls": {
      "reference": "Revelation 15–16",
      "title": "Seven Bowls of Final Judgment",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Final cycle of seven judgments poured out as bowls; Exodus plagues repeated; nations gathered at Armageddon.",
        "tension": "Will any repent, or will they curse God like Pharaoh?",
        "structure": "15:1-8 (preparation), 16:1-21 (seven bowls poured out), 16:16 (Armageddon)",
        "messiahProfile": "Just judge who brings the Day of the Lord to completion",
        "messiahLink": "Jesus will return to bring final justice. Some among nations repent (from Lamb's scroll message), but many resist and curse God, leading to ultimate confrontation.",
        "notes": "Third cycle of judgments. Many nations don't repent despite plagues (16:9, 11, 21)—like Pharaoh. Bowl 6: Armageddon = plain in northern Israel (many OT battles); symbol from Ezekiel's Gog = rebellious nations facing God's justice."
      },
      "prophetic": {
        "context": "Final warning: Day of the Lord approaches when evil will be defeated forever.",
        "tension": "Pharaoh-like hardness vs repentance; Lamb's way vs beast's way.",
        "structure": "Seven bowls climax in gathering at Armageddon for final confrontation.",
        "messiahProfile": "Coming King who will judge the earth",
        "messiahLink": "The seventh bowl depicts the fourth and final Day of the Lord when evil is defeated once and for all.",
        "notes": "Some see Armageddon as literal future battle; others as metaphor for God's final justice. Either way, it's drawn from Ezekiel 38–39 (Gog) and depicts rebellious nations facing God."
      },
      "speaker": "Heavenly voices",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Third judgment cycle warns of coming final justice and calls for decision: repent or resist?",
      "sermonSection": "15:1–16:21",
      "primaryType": "prophetic",
      "group": "Seven Bowls (Revelation 15–16)"
    },
    "rev-17-18-fall-babylon": {
      "reference": "Revelation 17–18",
      "title": "The Fall of Babylon the Prostitute",
      "types": [
        "expository",
        "prophetic"
      ],
      "expository": {
        "context": "Vision of Babylon the prostitute riding the beast; she's drunk with martyrs' blood; her fall announced.",
        "tension": "Will God's people come out of Babylon, or be seduced by her wealth and power?",
        "structure": "17:1-18 (prostitute on beast revealed), 18:1-24 (Babylon's fall lamented and celebrated)",
        "messiahProfile": "Judge who brings justice for the blood of prophets and saints",
        "messiahLink": "Jesus will return to replace Babylon with His kingdom. The prostitute's fall vindicates the martyrs.",
        "notes": "Babylon = Rome in John's day, but also archetypal pattern throughout history. John blends OT passages about Babylon, Tyre, Edom's fall. Any nation exalting military/economic power as god becomes Babylon."
      },
      "prophetic": {
        "context": "Warning to every generation: Babylon will come and go until Jesus returns to establish His kingdom.",
        "tension": "Babylons seduce with wealth and security; churches must resist and remain faithful to the Lamb.",
        "structure": "Prostitute revealed → fall announced → call to come out → lament and celebration.",
        "messiahProfile": "Coming King whose kingdom will replace every Babylon",
        "messiahLink": "The Lamb's followers must resist Babylon's seduction and remain faithful, knowing Jesus will bring justice and establish His eternal kingdom.",
        "notes": "Not limited to past or future—portrait of human condition throughout history. Nations exalt their own power/wealth as god, leading to inevitable fall. Call: 'Come out of her, my people' (18:4)."
      },
      "speaker": "Angel + heavenly voices",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Expanded vision of Babylon's fall warns churches to resist cultural seduction and await the Lamb's vindication.",
      "sermonSection": "17:1–18:24",
      "primaryType": "prophetic",
      "group": "Babylon's Fall (Revelation 17–18)"
    },
    "rev-19-20-final-battle": {
      "reference": "Revelation 19:11–20:15",
      "title": "Final Battle + Defeat of Dragon",
      "types": [
        "narrative",
        "expository"
      ],
      "narrative": {
        "storyPanels": "Panel 1: Rider on white horse (Jesus) appears; Panel 2: He's covered in His own blood before battle; Panel 3: His weapon: sword from His mouth (word of justice); Panel 4: Beast and false prophet defeated; Panel 5: Martyrs resurrected, reign 1,000 years; Panel 6: Dragon rallies nations again; Panel 7: Final judgment at God's throne; Panel 8: Dragon, Death, Hades thrown into lake of fire",
        "pattern": "Jesus conquers not through bloodbath but through justice and word. Evil eternally quarantined from new creation.",
        "messiahLink": "Jesus the Word of God comes covered in His own blood (the cross). He defeats evil through proclamation of justice, vindicates martyrs, and eternally removes evil from creation.",
        "notes": "Critical: Jesus covered in blood BEFORE battle = His own blood from the cross. Sword from mouth = word of justice (from Isaiah). Not a literal bloodbath but Christ's just judgment."
      },
      "expository": {
        "context": "Day of the Lord depicted as final battle; martyrs vindicated; dragon and all evil defeated forever.",
        "tension": "How will final battle unfold? What happens to evil? What about the 1,000 years?",
        "structure": "19:11-21 (rider on white horse), 20:1-6 (1,000 years), 20:7-10 (final rebellion), 20:11-15 (great white throne)",
        "messiahProfile": "Word of God, King of kings, faithful and true judge who holds evil accountable and vindicates the faithful",
        "messiahLink": "The slain Lamb returns as conquering King, but His method remains consistent: He shed His blood for enemies, now He proclaims justice. Those who refuse repentance face consequences.",
        "notes": "1,000 years debated: (1) Literal future millennium after Jesus' return, or (2) symbolic of present victory over spiritual evil. Either way, main point: Jesus will deal with evil forever and vindicate the faithful."
      },
      "speaker": "Narrator",
      "audience": "Seven churches",
      "category": "apocalyptic-vision",
      "narrativeContext": "Climactic vision of Jesus' return, final judgment, and eternal removal of evil from creation.",
      "sermonSection": "19:11–20:15",
      "primaryType": "narrative",
      "group": "Final Battle (Revelation 19–20)"
    },
    "rev-21-22-new-creation": {
      "reference": "Revelation 21:1–22:5",
      "title": "New Creation: Marriage of Heaven and Earth",
      "types": [
        "expository",
        "narrative",
        "prophetic"
      ],
      "narrative": {
        "storyPanels": "Panel 1: New heavens and earth; Panel 2: New Jerusalem descends as bride; Panel 3: God dwells with humanity forever; Panel 4: All things made new; Panel 5: No more death, pain, crying; Panel 6: New Eden with tree of life; Panel 7: River of life flows from throne; Panel 8: God's servants reign forever",
        "pattern": "Not just return to Eden but step forward to new Jerusalem—human cultures in peace and harmony, God's presence permeating everything.",
        "messiahLink": "The Lamb's people fulfill humanity's original calling: to rule as God's image, partnering with God in taking creation into new and uncharted territory.",
        "notes": "Kaleidoscope of OT promises fulfilled: new creation (Isaiah 65), new Eden (Genesis 2), new Jerusalem (Isaiah 60-62). No temple—God and Lamb's presence everywhere. Nations bring their glory into the city."
      },
      "expository": {
        "context": "Final vision of God's eternal kingdom: new creation, new city, new humanity fulfilling original calling.",
        "tension": "What will God's eternal kingdom look like? What happens to God's people?",
        "structure": "21:1-8 (all things new), 21:9-27 (new Jerusalem described), 22:1-5 (river of life, tree of life, reigning forever)",
        "messiahProfile": "The Lamb whose throne is the source of life; whose presence fills all creation; whose people reign with Him forever",
        "messiahLink": "Jesus and the Father together dwell with humanity. The Lamb's sacrifice has opened eternal life with God. His people fulfill their calling to rule and serve in God's presence forever.",
        "notes": "This is what conquerors inherit (rewards from chs 2-3). God makes His dwelling with humanity (tabernacle language). Healing of creation—no more curse, pain, death. New humanity partnering with God in ongoing creative work."
      },
      "prophetic": {
        "context": "God's ultimate promise and hope for His people: eternal life in restored creation with Him.",
        "tension": "This vision should motivate faithfulness in every generation until the King returns.",
        "structure": "New creation → new city → new Eden → eternal reign.",
        "messiahProfile": "Alpha and Omega who makes all things new; Lamb who is the temple and the light",
        "messiahLink": "The entire biblical story culminates here: God dwelling with humanity in restored creation, evil eternally removed, life and peace forever.",
        "notes": "Not escapism but hope that grounds present faithfulness. Jesus will return to remove evil and make all things new. This promise motivates resistance to Babylon and faithfulness to the Lamb."
      },
      "speaker": "God + narrator",
      "audience": "Seven churches + all generations",
      "category": "apocalyptic-vision",
      "narrativeContext": "Grand finale of Bible's epic storyline: God's kingdom fully realized, heaven and earth united, humanity's calling fulfilled.",
      "sermonSection": "21:1–22:5",
      "primaryType": "expository",
      "group": "New Creation (Revelation 21–22)"
    }
  },
  "author": "John (either the apostle or a Christian prophet)",
  "relationship": "Climax of biblical prophecy; draws heavily from Daniel, Ezekiel, Isaiah, Exodus, Zechariah. Brings OT prophetic themes to fulfillment.",
  "keyThemes": [
    "The slain Lamb conquers through sacrificial love",
    "Faithful witness (martyrdom) over violent conquest",
    "Symbolic imagery and numbers (not secret predictive code)",
    "Beast/Babylon vs Lamb/New Jerusalem",
    "God's sovereignty over history",
    "Final justice and new creation",
    "Call to resist cultural compromise and remain faithful"
  ],
  "characterArcs": [
    "The Lamb: From slain sacrifice to conquering King to eternal presence",
    "The 144,000/Great multitude: From sealed servants to conquering witnesses to reigning co-rulers",
    "The Dragon: From accuser to defeated enemy to eternally quarantined",
    "Babylon: From seductive power to fallen prostitute to destroyed forever",
    "The churches: From compromise/persecution to faithful witness to bride of the Lamb"
  ],
  "sermonPatterns": [
    "Hear/See pattern: Hear military language (Lion, 144,000), see sacrificial reality (Lamb, great multitude)",
    "Three cycles of seven: Each depicts same period (Jesus' resurrection to return) from different angles",
    "Sign visions: Reveal spiritual reality behind earthly persecution",
    "Contrasts: Beast vs Lamb, Babylon vs New Jerusalem, mark of beast vs seal of God",
    "OT fulfillment: Constant allusions expecting readers to look up references"
  ],
  "keyObservations": [
    "Revelation is apocalyptic prophecy sent as a circular letter—NOT a secret code for predicting the end times.",
    "Seven = symbol of completeness; woven throughout the book's structure.",
    "The book addresses first-century churches facing Nero's past persecution and Domitian's present persecution.",
    "Central message: God's kingdom comes through the church's faithful witness (imitating the Lamb) which moves nations to repentance—not through violence.",
    "Babylon represents any nation that exalts its own power and wealth as god (Rome in John's day, but an ongoing pattern).",
    "The 1,000 years is debated but not the main point—the main point is Jesus will defeat evil and vindicate the faithful.",
    "New creation is not escapism but hope that grounds present faithfulness to resist Babylon and follow the Lamb."
  ],
  "applicationForSpeechBuilder": "Use Revelation to build speeches that emphasize faithful witness over cultural compromise, the Lamb's pattern of conquering through sacrifice, hope in Jesus' return and final justice, and the call to resist 'Babylon' in every generation. Many passages naturally map to expository (explaining symbols), narrative (retelling visions), and prophetic (applying to present context) patterns. Always ground symbolic imagery in OT texts John alludes to, and connect to the book's central message: the slain Lamb conquers through love and will return to make all things new."
}